[
  {
    "article_id": "5fac7781a73d91fcbe1a67bd28676f3c",
    "title": "Three-Continent 2030 World Cup Gives Some Teams An Unfair Disadvantage",
    "link": "https://www.forbes.com/sites/steveprice/2023/10/05/three-continent-2030-world-cup-gives-some-teams-an-unfair-disadvantage/",
    "keywords": [
      "SportsMoney",
      "/sportsmoney",
      "Business",
      "/business",
      "SportsMoney",
      "/sportsmoney",
      "business",
      "sportsmoney",
      "standard"
    ],
    "creator": [
      "Steve Price, Senior Contributor"
    ],
    "video_url": null,
    "description": "The opening 3 games of the FIFA 2030 World Cup will be played 10,000 km away from the rest of the tournament. The teams playing in those games have a huge disadvantage.",
    "content": "Forbes Business SportsMoney Three-Continent 2030 World Cup Gives Some Teams An Unfair Disadvantage Steve Price Senior Contributor Opinions expressed by Forbes Contributors are their own. Following Oct 5, 2023, 02:45am EDT | Press play to listen to this article! Got it! Share to Facebook Share to Twitter Share to Linkedin LONDON, ENGLAND - JULY 11: Francesco Acerbi, Leonardo Bonucci and teammates celebrate after victory ... [+] in the UEFA Euro 2020 Championship Final between Italy and England at Wembley Stadium on July 11, 2021 in London, England. (Photo by Andy Rain - Pool/Getty Images) Getty Images Teams hoping to win the World Cup not only have to beat their opponents, they need to beat the local climate and conditions. Games played at altitude, in soaring temperatures, or with huge distances between venues can make or break a team’s tournament. At the 2014 World Cup, an energy-sapping encounter in Manaus, deep in the hot and humid Amazon basin, exhausted England and Italy’s players, and was partially blamed for both countries’ group-stage exits. Many of these challenges are caused simply by the diverse nature of our planet. But for the 2030 World Cup, FIFA has skewed the field for its own political reasons. Reports suggest that the 2030 World Cup will be hosted in Spain, Portugal and Morocco, but with the opening three matches played across the ocean in South America. Uruguay, Paraguay and Argentina had bid for the 2030 tournament, with a main focus of their bid being that it would be 100 years since the first World Cup in Uruguay, so it would be nice and sentimental to host the centenary event there too (despite most of the games being in neighboring Argentina). In some feat of sporting diplomacy, it seems the bulk of the 2030 tournament will now be played in Europe and North Africa, with the opening three games being played in Uruguay, Paraguay and Argentina to reflect this centenary year. MORE FOR YOU Ukrainian Troops Recovered One Of Their Damaged Strv 122 Tanks—In Time For The Tank To Meet The President Bill Gates Predicts Arista Networks Will Disrupt Google And Amazon Powerball Jackpot Rises To 1 4 Billion Here s What The Winner Will Take Home After Taxes It is a solution that tries to make everybody happy (not least Saudi Arabia, who appear to have an open goal for their bid to host the 2034 World Cup) while actually making nobody happy. Local South Americans will be unlikely to get any tickets despite “hosting” a World Cup, national team fans will have to add a transatlantic ticket to their World Cup expenses, and while Infantino says 2030 “will have a unique global footprint,” it seems he hasn’t considered the tournament’s carbon footprint . The decision to host the opening three games in South America could also impact the sporting integrity of the tournament. Buenos Aires is more than 10,000 kilometers, or a 12-hour flight, from Madrid. That’s more than double the distance between 2026 host cities Vancouver and Miami, and more than three times the distance between the two furthest apart cities at Russia 2018. While Madrid and Morocco could be in the middle of summer heatwaves during the World Cup, it will be winter in Buenos Aires with the daily mean temperature in June just 12 degrees Celsius (53 degrees Fahrenheit), and there is a six-hour time difference between Paraguay and Spain. The effect of travel on performance can be seen at Euro 2020 , which was held across Europe and had huge disparities between distances traveled, with some countries potentially traveling more than ten times further than others. Out of all the teams to reach the knockout stages, the two finalists, England and Italy, had the shortest total distance from their opening game to the final. Semi-finalists Denmark had the second shortest distance to travel up to the round of 16, where they won 4-0 against Wales, who had the fifth longest distance at that stage. The other semi-finalist, Spain, had the fifth shortest route to the final. And in the three-day turnaround between the quarterfinals and semifinals, the two losers of the semifinals had much longer journeys to London from Baku and Saint Petersburg. Correlation might not be causation, but there is certainly some correlation between the distances traveled and results during Euro 2020. Overcoming the local conditions is part of tournament soccer. As far back as the Mexico 1986 World Cup, England trained in steam rooms at altitude in Colorado to try to prepare for with the altitude of Mexico City and extreme heat of Monterrey. But depending on the fixture schedule, six teams at the 2030 World Cup could possibly have to travel an extra 10,000 miles more than their next opponents. They will also need to find two base camps, disrupting their tournament preparations. Whether it shows in the next game, or through accumulated fatigue as the tournament progresses, these kinds of factors can make the difference between winning and losing. Follow me on Twitter . Steve Price Editorial Standards Print Reprints & Permissions",
    "pubDate": "2023-10-05 06:45:29",
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/651e57ad9b42485e6812d410/0x0.jpg?width=960",
    "source_id": "forbescrypto",
    "source_priority": 57,
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english",
    "short_uuid": "b00f87ca"
  },
  {
    "article_id": "82093009c8030984a7c4dbd9fb2991d3",
    "title": "Doctors urged to ask patients about gambling in new NHS mental health guidance",
    "link": "https://www.theguardian.com/society/2023/oct/05/doctors-urged-to-ask-patients-about-gambling-in-new-nhs-mental-health-guidance",
    "keywords": [
      "Gambling",
      "Society",
      "Mental health",
      "NHS",
      "Health"
    ],
    "creator": [
      "PA Media"
    ],
    "video_url": null,
    "description": "People should be asked about problem gambling in same way they are asked about drugs and alcohol, say draft rulesPeople who seek help for mental health issues should be asked about problem gambling in the same way they are asked about drugs, smoking and alcohol, new guidance has suggested.According to the National Institute for Health and Care Excellence (Nice), those who visit an NHS health professional in England for depression, anxiety or thoughts about self-harm or suicide due to a possible addiction, such as alcohol or drugs, could be at a greater risk of harm from gambling.In the UK and Ireland, Samaritans can be contacted on freephone 116 123, or email jo@samaritans.org or jo@samaritans.ie. In the US, you can call or text the National Suicide Prevention Lifeline on 988, chat on 988lifeline.org, or text HOME to 741741 to connect with a crisis counselor. In Australia, the crisis support service Lifeline is 13 11 14. Other international helplines can be found at befrienders.org Continue reading...",
    "content": "People who seek help for mental health issues should be asked about problem gambling in the same way they are asked about drugs, smoking and alcohol, new guidance has suggested. According to the National Institute for Health and Care Excellence (Nice), those who visit an NHS health professional in England for depression, anxiety or thoughts about self-harm or suicide due to a possible addiction, such as alcohol or drugs, could be at a greater risk of harm from gambling. Nice said questions should be asked about patients’ gambling habits to ensure they can cope with their thoughts and urges. In new draft guidance, it suggested patients should be encouraged to assess the severity of their gambling by using a questionnaire available on the NHS website. Those who score eight or higher should seek support and treatment from gambling services. Health professionals should also discuss software blocking tools to limit online gambling and consider cognitive behavioural therapy (CBT) as an option. NHS England has said about 1,400 people were referred for help for gambling addiction last year, up by a third on 2021. Prof Jonathan Benger, the chief medical officer and interim director of the centre for guidelines at Nice, said: “Harmful gambling causes immense misery to all those who experience it. We want those needing help or who are at risk to be identified sooner and receive appropriate help.” Since 2019, NHS England has opened 12 gambling treatment clinics, with a further three due to open in the coming months. It is planning to treat up to 3,000 people a year across the 15 facilities, as part of the NHS long-term plan. Benger added: “The independent committee who made these draft recommendations included both clinicians and people with personal experience of harmful gambling. They scrutinised all the available evidence to identify treatments and therapies that have been shown to work and offer good value for money. The result is this useful and usable advice to help NHS clinics as they develop their service.” Fiona Macleod, the director of services at the charity GamCare, said the Nice guidance was “an important step”. “Identifying an issue with gambling as early as possible is vital to prevent harm from occurring later down the line, and we know that there is an important role that healthcare professionals can play in helping more people find the support they need. “We believe these recommendations, if implemented, will present a greater opportunity to prevent gambling harms from occurring in the UK. They represent an important step in encouraging more people to seek support, through services such as those GamCare provides.” Zoë Osmond, the chief executive of GambleAware, also welcomed the draft guidance. “Gambling harms are a serious public health issue, which can affect anyone, and healthcare professionals are ideally placed to identify and help people experiencing them,” she said. “We welcome the development of guidelines to further inform treatment for those seriously affected by gambling harm and will be responding to the consultation with our views.” The NHS England mental health director, Claire Murdoch, said: “Gambling addiction is a cruel disease that destroys people’s lives, and the NHS is already playing its part in treating it with four new specialist clinics opening in recent months and a further three opening later this year, so if you’re struggling, please come forward for help. “We will work with Nice on this consultation process and while this new guidance will ensure the NHS can help even more people struggling with gambling addiction to receive evidenced-based treatment, it is vital that the billion-pound industry also takes action in line with the government’s white paper to stop people coming to harm in the first place.” In April, the government outlined plans to reform gambling to ensure regulation meets new challenges as the “landscape has changed significantly since 2005”. For support, advice or information about gambling, contact the National Gambling Helpline on 0808 8020 133. In the UK and Ireland, Samaritans can be contacted on freephone 116 123, or email jo@samaritans.org or jo@samaritans.ie . In the US, you can call or text the National Suicide Prevention Lifeline on 988, chat on 988lifeline.org , or text HOME to 741741 to connect with a crisis counselor. In Australia, the crisis support service Lifeline is 13 11 14. Other international helplines can be found at befrienders.org",
    "pubDate": "2023-10-05 06:37:09",
    "image_url": "https://i.guim.co.uk/img/media/e859935cfbd1a3c9d1fed54ddb12dc3b5a4c5966/0_457_5357_3213/master/5357.jpg?width=460&quality=85&auto=format&fit=max&s=1a1bec6ad5c74045791e8c7b6190e8f4",
    "source_id": "theguardian",
    "source_priority": 106,
    "country": [
      "united states of america"
    ],
    "category": [
      "health"
    ],
    "language": "english",
    "short_uuid": "713c7186"
  },
  {
    "article_id": "3ce9cc74e879b5e8030e810391d83124",
    "title": "Cricket’s World Cup Starts Amid Uncertainty For Maligned ODI Format",
    "link": "https://www.forbes.com/sites/tristanlavalette/2023/10/05/crickets-world-cup-starts-amid-uncertainty-for-maligned-odi-format/",
    "keywords": [
      "SportsMoney",
      "/sportsmoney",
      "Business",
      "/business",
      "SportsMoney",
      "/sportsmoney",
      "business",
      "sportsmoney",
      "standard"
    ],
    "creator": [
      "Tristan Lavalette, Contributor"
    ],
    "video_url": null,
    "description": "There is an unknown over cricket's 50-over future as its popularity declines, but the World Cup in India might stir a wave of nostalgia.",
    "content": "Forbes Business SportsMoney Cricket’s World Cup Starts Amid Uncertainty For Maligned ODI Format Tristan Lavalette Contributor Opinions expressed by Forbes Contributors are their own. Following Oct 5, 2023, 02:34am EDT | Press play to listen to this article! Got it! Share to Facebook Share to Twitter Share to Linkedin The cricket World Cup starts on October 5 (Photo by Matthew Lewis-ICC/ICC via Getty Images) ICC via Getty Images The cricket World Cup starts on October 5 in the sport's rabid heartland. India which famously last hosted the event in 2011 when a MS Dhoni title-clinching six into a sea of ecstatic fans became instantly etched into lore. Even though T20s had been around for some time, with two T20 World Cups contested and the Indian Premier League exploding onto the scene in 2008, the most important prize was undoubtedly the World Cup of the 50-over variety. Back then there was no need to differentiate. The World Cup was the World Cup. The T20 equivalent was a little bit mickey mouse at the international level, still not taken seriously. But things have changed significantly in the last 12 years. The shorter three-hour format of T20 has grabbed the hearts of a younger generation, spawning lucrative domestic leagues globally, and proving a suitable game for this instant gratification era. Last year's T20 World Cup , marked by an epic India-Pakistan contest at a 90,000 MCG, felt like the tournament had really arrived. And the next event - just eight months away - might be a definitive moment for the sport with it being co-hosted by the U.S. Kohli inspired India to an amazing victory over arch-rivals Pakistan (Photo by Daniel ... [+] Pockett-ICC/ICC via Getty Images) ICC via Getty Images MORE FOR YOU Ukrainian Troops Recovered One Of Their Damaged Strv 122 Tanks—In Time For The Tank To Meet The President Bill Gates Predicts Arista Networks Will Disrupt Google And Amazon Powerball Jackpot Rises To 1 4 Billion Here s What The Winner Will Take Home After Taxes But sandwiched between those mega events is the World Cup, which will thrust the maligned 50-over format - becoming something of a black sheep middle sibling - to the forefront of fans over the next six months. There has been much debate over the future of the 50-over format - which is played over around eight hours - and whether it should be significantly reduced or ditched entirely. As I reported recently, ODI's immediate future is secure with cricket's powerbrokers intent on protecting the format. ODIs still holds significant cache because of the 50-over World Cup, which is a money-spinner and remains the most coveted prize for players. It won't be going anywhere because there are World Cups in the next cycle of events in 2027 and 2031. For the next event, which will be played in South Africa, Zimbabwe and Namibia, the World Cup will finally expand from its measly number of 10 teams to 14. That means smaller cricket nations will need more exposure beforehand to ensure they are competitive for the next World Cup. But amid such a crammed calendar, with ODIs seemingly the casualty, there will be precious opportunities for them. With seemingly little appetite, despite administrators saying otherwise, the format is clearly on the nose, played less these days with little fanfare from fans. It's saddening for a previous generation when the 50-over format was the most exciting spectacle imaginable. ODI cricket once attracted packed crowds (Photo by Tony Marshall/EMPICS via Getty Images) PA Images via Getty Images There have already been reports from India that this cricket-mad country has been less enthused over the World Cup. Sports fever is currently centered over India's strong showing at the Asian Games - the world's second biggest multi-sport event being contested in Hangzhou, China. Inevitably, especially if hosts and favorites India start getting on a roll, the World Cup will ignite and it could lead to a swirl of nostalgia. Maybe fans will believe the format can offer the right balance of Test cricket's slow burn along with T20's manic approach. Or perhaps this will be something of a last dance, where the often excruciating middle overs makes everyone realise that the format is a relic. Either way, 50-over cricket will be the center of attention in the cricket world. Something that rarely happens these days. Follow me on Twitter . Tristan Lavalette Editorial Standards Print Reprints & Permissions",
    "pubDate": "2023-10-05 06:34:23",
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/651e45b0e93a541eea2a4d04/0x0.jpg?width=960",
    "source_id": "forbescrypto",
    "source_priority": 57,
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english",
    "short_uuid": "bf9adce5"
  },
  {
    "article_id": "3ccb3114ac70587179265eb19ae2a333",
    "title": "Biden’s Dog Commander ‘Not Presently’ At White House After Biting Incidents",
    "link": "https://www.forbes.com/sites/siladityaray/2023/10/05/bidens-dog-commander-not-presently-at-white-house-after-biting-incidents/",
    "keywords": [
      "Business",
      "/business",
      "Business",
      "/business",
      "Breaking",
      "breaking-news",
      "topline"
    ],
    "creator": [
      "Siladitya Ray, Forbes Staff"
    ],
    "video_url": null,
    "description": "The German shepherd has been involved in a series of biting incidents at the White House.",
    "content": "Forbes Business Breaking Biden’s Dog Commander ‘Not Presently’ At White House After Biting Incidents Siladitya Ray Forbes Staff Covering breaking news and tech policy stories at Forbes. Following Oct 5, 2023, 02:22am EDT | Press play to listen to this article! Got it! Updated Oct 5, 2023, 02:33am EDT Share to Facebook Share to Twitter Share to Linkedin Topline President Joe Biden’s dog Commander is not at the White House premises at present, a spokesperson for First Lady Jill Biden said Wednesday, after multiple reports of the German shepherd biting several Presidential staffers, including Secret Service agents. File Photo: Commander, US President Joe Biden and US First Lady Jill Bidens German Shepherd, is ... [+] taken for a walk on the South Lawn before their return to the White House in Washington, DC. AFP via Getty Images Key Facts The First Lady’s spokesperson said Commander “is not presently on the White House campus while next steps are evaluated,” the Associated Press reported . The spokesperson noted that the Bidens are “grateful for the patience and support” of the Secret Service staffers and all other staffers as they attempt to “work through solutions.” Last month, a tourist took a photo of Commander biting Dale Haney, the White House’s chief groundskeeper and later that month the dog bit a Secret Service officer. White House press secretary Karine Jean-Pierre commented on the photo of Commander biting Haney and said the dog and the chief groundskeeper were playing and no skin was broken at the time. What To Watch For It is unclear where the 2-year-old German shepherd is living currently and if there are plans to bring him back to the White House. The First Lady’s spokesperson said the White House can be a “stressful environment” for pets and the family was working on “ways to help Commander handle the often unpredictable nature of the White House grounds.” Key Background Aside from the two biting incidents reported last month, the 2-year-old German shepherd has bitten Secret Service personnel at least 10 other times , according to the Department of Homeland Security’s records. The ten earlier biting incidents were recorded between October 2022 and January 2023, one of which required a hospital visit. It is unknown if any other biting incidents have taken place between January and September. Biden’s older German Shepherd Major was also involved in several biting incidents, which eventually resulted in him moving out of the White House. Tangent CNN reported that Secret Service personnel at the White House had raised concerns about workplace safety over the biting incidents. One source cited by CNN referred to the work environment as “hostile” and “dangerous” adding that agents are forced to avoid some entrances and routes inside the building to avoid getting bitten by Commander. Despite purportedly receiving assurances that the dog would receive appropriate training, the incidents continued to happen. Further Reading Biden’s Dog Bit Secret Service Officers At Least 10 Times, Records Show (Forbes) Biden’s dog Commander no longer at White House after biting incidents (Associated Press) Follow me on Twitter . Send me a secure tip . Siladitya Ray Editorial Standards Print Reprints & Permissions",
    "pubDate": "2023-10-05 06:22:44",
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/651e52ec642ecd18166ddd32/0x0.jpg?width=960&precrop=4500%2C2531%2Cx0%2Cy75",
    "source_id": "forbescrypto",
    "source_priority": 57,
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english",
    "short_uuid": "1059cb2b"
  },
  {
    "article_id": "ec63db94476c4919fc17a0c1ee744c5e",
    "title": "Red team runs away from White, 88-70, in Arkansas' annual Red/White intra-squad scrimmage on Wednesday at Barnhill Arena",
    "link": "https://www.nwahomepage.com/sports/pig-trail-nation/red-team-runs-away-from-white-88-70-in-arkansas-annual-red-white-intra-squad-scrimmage-on-wednesday-at-barnhill-arena/",
    "keywords": [
      "Pig Trail Nation",
      "Hogville"
    ],
    "creator": [
      "Kevin McPherson"
    ],
    "video_url": null,
    "description": "Sophomore wing Joseph Pinion led six Red players in double figures with a game-high 20 points (7-of-8 field goals, including 3-of-4 from 3, and 3-of-4 free throws) to go with 4 rebounds, 1 assist, 1 steal, and boxscore plus-13 in 27 minutes as his team broke a 41-all tie at halftime to topple the White, 88-70, in front of a hearty crowd of nearly 5,500 inside the venue that the men's and women's basketball teams called home through the 1992-93 season.",
    "content": "by: Posted: Updated: By Kevin McPherson FAYETTEVILLE — Even with team centerpiece and sophomore forward Trevon Brazile sitting out there were plenty of fireworks from three and other storylines that emerged from Arkansas’ annual Red/White Showcase intra-squad scrimmage at Barnhill Arena. Sophomore wing Joseph Pinion led six Red players in double figures with a game-high 20 points (7-of-8 field goals, including 3-of-4 from 3, and 3-of-4 free throws) to go with 4 rebounds, 1 assist, 1 steal, and boxscore plus-13 in 27 minutes as his team broke a 41-all tie at halftime to topple the White, 88-70, in front of a hearty crowd of nearly 5,500 inside the venue that the men’s and women’s basketball teams called home through the 1992-93 season. Seven different Hogs hit three’s as the teams combined for 14-of-28 shooting from distance (50%). “First of all, the crowd was awesome,” Head Hog Eric Musselman said after the game. “It was closer to 6,000 than 5,500. So the turnout when the weather’s not great, and we’re still a long way from playing a game. So I thought the crowd was awesome. “I think the guys felt that, even pregame. A lot of things we need to clean up, we need to get better. But all things that we think are teachable. The shooting is obviously … We’re going to be able to stretch the defense out a little bit more than maybe we have in the past. So really pleased with our shooting. Pretty pleased wit how the flow of the offense is. We’re running an offense that we ran for about 10 games two years ago that’s kind of what Milwaukee ran two years ago. And it requires a lot of thinking and a lot of reading and pretty happy with how far advanced the guys are with that. Obviously we’ve got to get a lot, lot better. Some guys are further advanced on knowing this than others, but that’ll hopefully come over time.” Senior lead guard El Ellis had a strong floor game for the Red with his 16 points (8-10 field goals), game-high 6 assists, 1 steal, 1 turnover, and boxscore plus-17 in 28 minutes. Senior big man Jalen Graham finished with 15 points (7-of-11 field goals, including 1-of-1 from 3), 6 rebounds, 4 assists, 1 steal, and 1 turnover in 28 minutes. Senior forward Chandler Lawson had a double-double for the Red team — 13 points, 10 rebounds, 2 blocks,1 steal, 0 turnovers, and a boxscore plus-16 in 27 minutes. Veteran guard Davonte “Devo” Davis contributed 13 points (5-of-7 field goals, including 2-of-3 from 3, and 1-of-1 free throw) to go with 3 assists, 2 rebounds, 1 steal, 2 turnovers, and a game-high boxscore plus-20 in 24 minutes. Senior forward Denijay Harris chipped in 11 points, a game-high 5 steals, 3 rebounds, 3 assists, 2 turnovers, and a boxscore plus-14 in 22 minutes. The White team was led by senior wing Jeremiah Davenport, who scored all 19 of his points (6-of-10 from the field, including 5-of-8 from 3, and 2-of-2 free throws) in the first half, and he also finished with 3 rebounds, 2 assists, 1 steal, and a game-high 6 turnovers in 23 minutes. Also for the White, senior forward / center Makhi Mitchell had 13 points (6-of-7 field goals, including 1-of-1 from 3, and 0-of-3 free throws), 5 rebounds, 2 blocks, 1 assist, and 2 turnovers in 23 minutes. Freshman center Baye Fall also had 13 points (5-of-7 field goals and 3-of-4 free throws) to go with 3 rebounds, 1 assist, and 1 turnover in 18 minutes. Freshman guard Layden Blocker contributed 10 points (3-of-7 field goals and 4-of-4 free throws), a team-high 5 assists, 2 rebounds, and 1 turnover in 28 minutes. Veteran wing Tramon Mark had 7 points, 4 assists, 1 rebound, 1 steal, and 2 turnovers in 28 minutes. Sophomore guard Keyon Menifield, Jr. — he’ll redshirt in 2023-24 — had 5 points, 3 assists, 1 rebound, 1 steal, and 1 turnover in 28 minutes. The Red team shot a blistering 37-of-54 from the field (68.5%), including 6-of-11 from 3 (54.5%), and 8-of-11 at the free throw line (72.7%). The Red dominated the glass (plus-10 at 27-17) and turnovers [plus-6 at 13-7, including plus-7 in steals at 10-3). The White team shot 26-of-47 from the field (55.3%), including 8-of-17 from 3 (47.1%), and 10-of-15 from the foul line (66.7%). It seemed unlikely that Brazile would play given what Musselman told the media following practice on Thursday, Sept. 28, which was Brazile (he’s completing recovery on his injured knee that ended his season nearly a year ago in early December 2022) would likely begin competing in live, full-contact scrimmaging in “two-and-a-half weeks.” Indeed, Brazile was not included on either roster for the Red/White tilt. Musselman updated Brazile’s status following the Red/White game. “With TB, we’re being — like, I want TB in March,” Musselman said. “I mean, we want him to get his rhythm and all that. He’s done an awesome job. He’s been cleared. He’s been with his rehab guy. They’ve done all the testing. Everything is great. Probably could’ve played tonight, three minutes a half, but why? “We want him to go a little more three-on-three. He’s been going three-on-three live after we’re done with practice. So, he’ll go three-on-three live one more time this week at some point. But he’s been jumping into all of our drills. Offensively, when a player is coming back from an injury like that, that’s not really an issue. The issue is, ‘I’m guarding you or you or you and I got to react.’ And so that’s why we want to take our time. No real timeline other than we certainly — with the way it’s going now, he’s playing opening night.” Junior guard Khalif Battle went through early pre-game warmups, but left the court appearing to favor his right foot. When he returned to the court, he was in street clothes and on crutches with his foot in a walking boot. Musselman also addressed Battle’s injury status after the game. “He practiced today,” Musselman said of Battle. “I walked over and got in the gym and he said his foot was really sore. They took him for a preliminary look over at the football facility. At that point, nothing, there was no determination there was anything, no break or anything. But I know that they’re going to look at it again tomorrow with some different X-rays or whatever. “As of now, no update, nothing other than the fact he felt uncomfortable. Not in the same spot where he had a break earlier. Same foot, but not really related as of now. But we did have more than one doctor look at him over at football. Then we had a couple more doctors in our locker room. So right now, nothing unless whatever tests they run, something comes up.” My midnight in Fayetteville takeaways (2 parts) following Arkansas' Red/White Showcase on Wed @ Barnhill Arena -Rain falling outside, Hogs raining 3's inside -Players who stood out -Injury updates -Key recruiting updates, incl '24 Hog target announcing on Thurs More Arkansas Razorbacks R/W gm highlights from Barnhill -Makhi Mitchell drives left for window finish (reel 1) -Jeremiah Davenport drives paint for runner (reel 2) -Joseph Pinion dials up his 3rd triple (reel 3) -Davenport w/lightning-fast release on C&S corner 3 (reel 4) More Arkansas Razorbacks R/W gm highlights from Barnhill Arena on Wed … -Chandler Lawson wing middy (reel 1) -El Ellis drains corner Jnin transition (reel 2) -Devo & Lawson w/brilliant give-&-go in transition (reel 3) -Denijay Harris smash-cashes in 1 of his 5 stls (reel 4) One of the strengths of senior big man Makhi Mitchell's game is his roll to the cup after setting a pick … nice 2-man game here as sophomore G Keyon Menifield, Jr. fitted in a dime to set up Khi's finish … from R/W game @ Barnhill Arena on Wed … Arkansas senior forward Chandler Lawson was solid, finishing w/dbl-dbl (13p, 10r, 2b, 1s) in the Red win … Lawson's length, instincts tracking down rbs & battling for 50/50-balls in the paint, & competent face-up shooting look top-rotation worthy … Arkansas guard Devo Davis was givin' junior wing Tramon Mark the business on D … until … well, Mark hit the gas & snow-coned the finish off the window for the White team … This … is … Arkansas sophomore wing … JOSEPH PINION !!! Bustin' up rims & breakin' hearts … hello Layden Blocker !!! Arkansas freshman guard Layden Blocker dimes out to senior wing Jeremiah Davenport who splashes the first of his two made deep triples as the White team leads the Red, 6-2, early … Pre-game intros & warm-ups (incl sophomore forward Trevon Brazile , who was DNP) just prior to Arkansas' annual Red/White game on Wed @ Barnhill Arena in Fayetteville … ( sponsor Parkway Automotive) Red & White squads getting up shots inside Barnhill Arena in Fayetteville as we're about an hour from tipoff of Arkansas' annual intra-squad scrimmage … Arkansas backcourt trio of (L to R) Joseph Pinion Jeremiah Davenport & El Ellis are fielding media Q's following Red/White Showcase on Wed @ Barnhill Arena … Our gives his thoughts on the first half of the Red-White game. Next up for Arkansas is the first of two exhibition games as the Hoop Hogs will host Division II Texas-Tyler on Friday, Oct. 20, at Bud Walton Arena. The event marked the fourth Red/White game under Musselman as he enters his fifth season at Arkansas (the program did not have a Red/White game in the covid-shortened 2020-21 season). The intra-squad scrimmage was free to the public, and the doors were opened at 5:30 p.m. to allow fans to enter Barnhill. Tickets were not required for the event and seating was general admission on a first-come, first-served basis. Copyright 2023 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.",
    "pubDate": "2023-10-05 09:14:47",
    "image_url": "https://www.nwahomepage.com/wp-content/uploads/sites/90/2023/10/PLAYERS-PRESSER.00_09_19_12.Still001.jpg?w=900",
    "source_id": "nwahomepage",
    "source_priority": 21820,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "de1b31cd"
  },
  {
    "article_id": "0bf88ac3be0fd7a211e069db1c721234",
    "title": "Darren Kellenschwiler: My BSV blockchain journey",
    "link": "https://coingeek.com/darren-kellenschwiler-my-bsv-blockchain-journey-video/",
    "keywords": [
      "Interviews",
      "Baemail",
      "Bitcoin wallet",
      "BSV blockchain",
      "BSV Blockchain Association",
      "CoinGeek Conversations",
      "CoinGeek podcast",
      "Darren Kellenschwiler",
      "micropayments"
    ],
    "creator": [
      "Claire Celdran"
    ],
    "video_url": null,
    "description": "On this week’s CoinGeek Conversations, Darren Kellenschwiler takes a trip down memory lane on his long BSV blockchain history—which runs from the tumultuous days of the BCH-BSV split to his current role as a technical lead at the BSV Blockchain Association. [...] Read More... The post Darren Kellenschwiler: My BSV blockchain journey appeared first on CoinGeek.",
    "content": "Darren Kellenschwiler’s long BSV blockchain history runs from the tumultuous days of the BCH-BSV split to his current role as a technical lead at the . On this week’s , Darren takes a trip down memory lane with Charles Miller, recalling the end of 2018 when he hosted Bitcoin meetups in London. It was during this period that the BCH and BSV split occurred, resulting in heated debates and ideological divisions within the community. Darren recalled the atmosphere, when “everything was a little tumultuous, and people were taking different ideological stances. There were very strong arguments—over a beer! That’s the sort of atmosphere at that time. It was the hash wars era.” Darren was on the BSV blockchain side of the divide, firmly believing in Dr. Craig Wright as the inventor of . As he explained, “I had made my mind up years before that this chap, Dr Wright is the inventor of Bitcoin. So I didn’t really waste my time with the crowd that were somehow rebelling against him.” As BSV blockchain emerged, Darren took “a leap of faith” despite the ongoing debates about Dr. Craig Wright. As he says, “There wasn’t a lot of public detail with respect to the evidence for Dr. Craig Wright having invented Bitcoin.” This period also marked the birth of the “Bitcoin protocol is set in stone” campaign. One of Darren’s notable contributions to the BSV blockchain community was , an email application integrated with micropayments. He explained his motivation behind it: “I don’t like spam. I hate reading emails that are not relevant to me. So I thought, attach some value to it. We’ll create ‘inbox economics,’ where the highest in the inbox is the person who paid you the most for you to read it.” While Baemail gained quick adoption within the BSV blockchain community, it faced challenges in achieving widespread usage due to limitations in BSV wallet adoption. Darren’s journey continued when he met Brendan Lee from at a conference in London. Brendan bought Baemail and hired Darren, making him a co-founder of the company. Together, they delved into building Metanet applications and experimenting with hosting entire websites on the Metanet, a concept that was both groundbreaking and esoteric at the time. Today, Darren serves as the technical lead of the utilization value stream at the BSV Blockchain Association. He described his role as multifaceted, involving contributions to various aspects of the BSV blockchain ecosystem. He also emphasized the Association’s responsibility to ensure that the user experience and businesses built on BSV blockchain remain intact and thrive. Darren also highlighted his passion for tackling complex challenges and his role in documenting, analyzing, and improving wallet architectures within the BSV blockchain ecosystem. He mentioned the importance of effective communication and collaboration with developers, including discussions with Dr. Craig Wright, to advance the ecosystem’s growth and development. Darren Kellenschwiler’s journey in the BSV blockchain ecosystem exemplifies the resilience and dedication of individuals committed to the vision of a stable, scalable, and innovative blockchain. As BSV blockchain continues to evolve, Darren and others like him play a pivotal role in shaping its future.",
    "pubDate": "2023-10-05 09:00:47",
    "image_url": "https://coingeek.com/coingeek.com/wp-content/uploads/2023/10/Darren-Kellenschwiler-680x354.webp",
    "source_id": "coingeek",
    "source_priority": 123655,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "400b670a"
  },
  {
    "article_id": "cd17951cb8a8c77527ae127ffed214b1",
    "title": "Kevin McCarthy’s Downfall Is the Culmination of the Tea Party",
    "link": "https://www.politico.com/news/magazine/2023/10/05/mcarthy-tea-party-theda-skocpol-00120009",
    "keywords": null,
    "creator": [
      "By Ian Ward"
    ],
    "video_url": null,
    "description": "Political scientist Theda Skocpol on how tea party politics laid the foundation for the GOP’s current troubles.",
    "content": "In the hours after the House of Representatives’ historic vote to oust Kevin McCarthy from the speakership, a photo began circulating online of the cover of Young Guns , the splashy policy treatise authored by then-Reps. Eric Cantor, Paul Ryan and Kevin McCarthy in 2010. The irony of the photo was clear enough: The book, which featured a gleaming group portrait of the three self-declared standard-bearers of the Republican Party, was intended to introduce the rising stars of the GOP to the American people — but now, just 13 years after its publication, the book had become a visual obituary for the party’s past. When I called Theda Skocpol — a political scientist at Harvard University who’s written extensively about the rise of the tea party and the transformation of the Republican Party — shortly after the House kicked McCarthy out of the speakership, she was staring at this same photo. “I’m sitting here looking at a picture on my iPad of the three ‘Young Guns’ from that iconic cover of their book,” she said. “All three of them were felled in succession by the popular anger of the tea party base.” The tea party that Skocpol was referring to no longer formally exists as a faction in Congress, its erstwhile allies having been subsumed into the far-right Freedom Caucus or into the generic “America First” wing of the GOP. But according to Skocpol, the history of the tea party remains essential to understanding the forces that ultimately led to McCarthy’s political demise. “It represents the culmination of [the tea party movement],” said Skocpol. “All the research that I and other political scientists have done on the movement shows that by the 2010s — just before Donald Trump emerges — the tea party had taken the shape of a just-say-no, blow-it-all-up, don’t-cooperate, do-politics-on-Twitter faction — and this is the perfect expression of it. This is where it leads.” In some respects, Skocpol’s argument is counterintuitive. In the late 2000s and early 2010s, McCarthy and the other Young Guns rose to power by harnessing the grassroots power of the tea party movement, promising to slash government spending, constrain federal power and foil the Obama administration’s policy goals. But though McCarthy and the other Young Guns rose to prominence by allying themselves with the tea party movement, Skocpol said, their banishment from the GOP doesn’t mark a break with the movement’s legacy. Instead, it shows that the Young Guns never really understood the forces that they helped unleash. “The fact that McCarthy and the other Young Guns were once called tea party people because they dallied with the movement,” Skocpol said, “does not mean that the tiger wasn’t going to consume them in the end.” The following has been edited for clarity and concision. Ian Ward: You’ve written extensively about the history of the tea party movement and its aftereffects for the Republican Party. How does the vote to oust Speaker McCarthy fit into that history? Theda Skocpol: Shortly into Barack Obama’s presidency, we saw this explosion of tea party demonstrations and a remarkable degree of grassroots organizing — a couple thousand local tea parties, according to our research. There was a lot of writing at the time claiming that this organization was motivated by the same thing that people now claim drives the Republican Party when they shut down the government — cutting the deficit. But it was never about cutting the deficit. The popular side of the tea party was about anger and fear of a changing country in which a guy with ‘Hussein’ as his middle name and black skin could be elected president. The tea party — especially at the grassroots — was trying to pressure the Republican Party and its elected leaders not to compromise with a changing country or with Democratic Party politicians in Washington. Ward: How did the Young Guns fit into that mobilization? Skocpol: The tea party mobilization made a big difference electorally in 2010 in installing a Republican Congress, and probably even more importantly in installing Republican-dominated state legislatures. But it was especially potent after that in undoing any effort at compromise over immigration. Our research shows that polarization over immigration between the two major parties has played out recently and piled on top of the polarization over the civil rights revolution of the 1960s. By the time you get to the period at the end of Barack Obama’s presidency, he’s trying to find a way to incorporate long-present immigrants from Mexico and Central America and give them a path to citizenship — and that effort falls apart in 2013 and 2014. Remember that election in which David Brat in central Virginia shockingly felled Eric Cantor, who at that time was seen as the kind of rising golden boy on the Republican right? It was anger over the potential of immigration reform that played a big role in that. And then you have Paul Ryan, who inherited a Congress where the Republican caucus was increasingly riven by the rise of this angry, just-say-no style that the tea party always favored. They wanted to make sure that people were angry about changes in the country and wanted to make sure Republicans were not compromising about those. Paul Ryan was [from] Mr. Koch’s network. I think that House Republicans thought that by making him their leader, they would cement their right-wing Republican credentials— and it did with the elites around the Republican Party at the time. But among the populist right — who make up more than half of Republican base voters and the most loyal primary voters —they never liked what he had to offer. So he was gone before long. And now finally, we get to Kevin McCarthy, who is just an example of the final transmogrification of the tea party anger, which was given a national focus and much more potency by Donald Trump. Donald Trump didn’t create all this. He’s just been very good, ever since 2015, at giving it permission and focus. Ward: McCarthy and the other Young Guns who rose to power during that tea party moment in the late 2000s and early 2010s gave voice to one interpretation of the tea party movement that you mentioned, which is that it was all about fiscal conservatism and small government. Why do you think they so dramatically misunderstood the energies behind the movement? Skocpol: We have to understand the radicalization of the Republican Party as a process that has been underway since 2000. Act 1 of that radicalization was the rise of the Koch network, which was itself motivated by displeasure with what the Republicans under Bush junior and senior had been doing — for example, passing Medicare expenditures. The Koch network outflanked the Republican Party, and they put a lot of pressure on candidates and officeholders to hew the line on cutting taxes, cutting regulations and disabling public sector unions. These Young Guns were initially in tune with that — and why wouldn’t they be? They thought that’s where the money came from and where the business community had gone. But that wasn’t satisfactory to a lot of base voters around the Republican Party, who were much angrier about social changes in the country and much more upset about immigration. So I think the Republican Party was first hollowed out at the top, and then the tea party crystallized when Barack Obama was elected president and then it ended up being given further expression during the immigration reform battles and the rise of Donald Trump. I call it the bottom-up radicalization of the Republican Party, and I think it caught a lot of these Koch network darlings, including all three of these Young Guns, by surprise — although in McCarthy’s case, I think he has done his best to ride the tiger. He’s tried to have it both ways. Ward: Why do you think McCarthy was able to ride that tiger for longer than the other two? Skocpol: He’s a shapeshifter, and that’s given him staying power — up until the moment he had Democratic votes to keep the government open and then went on TV over the weekend and trashed the Democrats. The shape shifting is both a strength and a weakness. It’s a strength in that, a little bit more effectively than Paul Ryan before him, he’s been able to have it both ways — to condemn Donald Trump and then embrace him, to say he’s about cutting the deficit and he’s about cracking down on the border. If the Republican Party really had wings — and I don’t think it does at this point — he might have been able to bridge them. But by the end, he got to the point where nobody trusted him. I don’t think anybody in the Republican Party trusted his word, and Democrats definitely couldn’t. Ward: Given the fact that McCarthy rose to power during the tea party moment, is there any sense in which his ouster represents a repudiation of the tea party legacy? Skocpol: No — it represents the culmination of it. I think most people in the in the media thought the tea party was about cutting the federal budget deficit because that’s what a few elite spokesmen on TV said it was about. But our research always showed that at the grassroots, it was about popular anger over a changing country and fury at a Republican Party that was not responding to that desire. All the research that I and other political scientists have done on the movement shows that by the 2010s, just before Donald Trump emerges, the tea party had taken the shape of a just-say-no, blow-it-all-up, don’t-cooperate, do-politics-on-Twitter faction — and this is the perfect expression of it. This is where it leads. The fact that McCarthy and the other Young Guns were once called tea party people because they dallied with the movement does not mean that the tiger wasn’t going to consume them in the end. Ward: The conflict between the tea party and the Obama-era Republican Party reflected some real ideological differences between those two factions, especially on issues like immigration. Do you think the conflict between the far-right, anti-McCarthy wing of the party and McCarthy’s backers reflects a similarly robust ideological fissure? Or does it just boil down to rank obstructionism? Skocpol : I think it’s post-ideological. One of the things that Trump’s presidency accomplished was to give national expression to populist ethno-nationalism and anger at “business as usual” in Washington, D.C, and you get to a certain point where there aren’t many moderates at all in the Republican House caucus. There certainly are some people who are cross pressured because they come from Biden districts, but most of them have been enthusiastic supporters of the same kinds of issues that Matt Gaetz is speaking to. This is a disagreement over whether you should ever settle for less than 100 percent of what you want, even when you’re in a position where you don’t control more than one chamber. Ward: So if the conflict is essentially about tactics and the real energies behind the far right are cultural, why do people like Gaetz still lean so heavily on the language of fiscal conservatism? After all, this most recent incident was partly set off by McCarthy’s unwillingness or inability to slash spending levels. Skocpol: You’re not going to like the answer I’m going to give you. Ward: Try me. Skocpol: It sells with the Washington press corps. Why anybody believes this is beyond me. Did you see what Donald Trump did when he was office? Did you see what Republicans did when they controlled the entire Congress? They don’t cut anything, except taxes. And that keeps a certain number of billionaires — and even Charles Koch himself — happy. There are two strands that have played out in the Republican Party during recent years. One of them I call “McConnellism.” McConnellism is clever. It’s about using every lever of power to make sure Republicans get the federal judiciary full of judges who are going to disempower Democratic initiatives, and it’s about doing everything you can to shape the electorate, both by encouraging your own voters and discouraging the other guys’ voters. It’s at the edge of what’s legally and constitutionally legitimate. Then there’s Trumpism, which at this point has gone from bullying and threatening to actual calls for violence. One of them is very powerful in the House, and the other is very powerful in the Senate. But it’s a tactical difference. It’s not as if there’s a huge difference of policy. I think there might be some differences in policy over immigration, but those don’t really come up because nobody’s talking about legislating on immigration. Ward: So what does all this mean for the future of the Republican Party? What are the ramifications of the argument that you’re making — that there’s a fundamental continuity between the tea party movement and the MAGA movement? Skocpol: Well, everything depends on whether Donald Trump is reelected president, and I don’t think that’s impossible. I really don’t. As for the House of Representatives, I really do not know how they’re going to find a new Kevin McCarthy who can promise enough because the promises that are being demanded are impossible to fulfill. Ward: Based on the traditional tea party playbook, though, what do you think the endgame here is for the far-right faction in the House? Skocpol: Well, I think Matt Gaetz himself wants to get on TV, raise a lot of money and run for another office. That’s true of a number of the people who make up this very small group of people who were in a position to pull the hook on the grenade. But I don’t think we know how this is going to come out. If you’ve got people in power who are backed by a large number of voters who are angry, fearful, limited in the information they get about what’s going on and thinking that it would be better to blow America up than to save it — I think you’re in uncharted territory. We are in uncharted territory.",
    "pubDate": "2023-10-05 09:00:00",
    "image_url": "https://static.politico.com/c4/72/1c93ab96410ab4ba28b30f239d27/obama-silicon-valley.JPEG",
    "source_id": "politico",
    "source_priority": 388,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "eca6f47"
  }
]
