[
  {
    "title": "Solana NFT Protocol Metaplex Announces Layoffs in Wake of FTX Collapse",
    "link": "https://decrypt.co/115002/solana-nft-protocol-metaplex-announces-layoffs-ftx-collapse",
    "keywords": [
      "NFTs"
    ],
    "creator": [
      "Sander Lutz"
    ],
    "video_url": null,
    "description": "While it had no financial exposure to the fallen exchange, Metaplex appears to be suffering from reputational damage spreading to Solana.",
    "content": null,
    "pubDate": "2022-11-18 02:01:59",
    "image_url": "https://cdn.decrypt.co/resize/1024/height/512/wp-content/uploads/2022/09/metaplex-logo-gID_6.png",
    "source_id": "decrypt",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "California Democratic Rep. Porter Reelected After Tough Race",
    "link": "https://www.usnews.com/news/us/articles/2022-11-17/california-democratic-rep-porter-reelected-after-tough-race",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 01:57:26",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Nancy Pelosi Reflects On the Not-Quite-End of An Era",
    "link": "https://time.com/6234982/nancy-pelosi-interview-legacy/",
    "keywords": [
      "Uncategorized",
      "Congress",
      "democrats",
      "uspoliticspolicy"
    ],
    "creator": [
      "Molly Ball"
    ],
    "video_url": null,
    "description": "An interview with the outgoing House Speaker",
    "content": "Ever since the election, Nancy Pelosi says, congressional Democrats have been begging her to remain as their leader. Of course, she knew what they were really doing: currying favor, just in case. “Our members were just exploding my phone to stay,” she says, “which is a nice thing, because if I don’t stay, then they’ve gotten the points for saying ’stay,’ and if I do—“ she trailed off, laughing. No matter what she decided, they knew it would be in their interest to be on her good side going forward. For two decades, it has been in every congressional Democrat’s interest to stay in Pelosi’s good graces. Since winning her first leadership position in 2001, she has ruled the House Democratic caucus with an iron fist and a velvet glove, keeping her fractious party in near-lockstep during historically tumultuous times. From the Iraq War to the financial crisis, through health-care reform and government shutdowns, through two presidential impeachments, a pandemic and an insurrection attempt, she has been a constant force and consummate operator. No national politician of her era can match her combination of legislative prowess, vote-counting savvy, negotiating skill, and fundraising ability. [time-brightcove not-tgx=”true”] On Thursday, it was finally time to move on—sort of. Shortly after noon, she gave a brief speech on the House floor, announcing that she would not seek re-election as leader of the House Democrats. It was time, she said, “for a new generation to lead the Democratic caucus that I so deeply respect.” Yet she couldn’t bring herself to step away completely: she owed it to her constituents in San Francisco, she said, to stay on as a rank-and-file member of Congress and finish her two-year term. Like the man who fakes his own death and then sneaks into the funeral, she would stick around to see how her people tried to get along without her. Chip Somodevilla—Getty ImagesNancy Pelosi waves to colleagues while being nominated as the next Speaker of the House during a swearing in ceremony for the 110th Congress in the House Chamber of the U.S. Capitol in Washington, DC., on Jan. 4, 2007. Just after her speech, the 82-year-old House Speaker sat at a white-clothed table in a small, ornate room off the House floor known as the Board of Education, a hidden chamber where former Democratic Speaker Sam Rayburn used to hole up and relax. Then-vice president Harry Truman was playing cards with Rayburn here in 1945 when he learned that FDR had died and he would become President. One wall Rayburn had painted with a Texas seal; on two others, Pelosi recently added her own touches: a painting of the Golden Gate Bridge, and a tribute to women’s suffrage. Pelosi was contemplating the not-quite-end of the era and struggling to unwrap a package of chocolate-chip cookies. “What was important to me was how we did in the election, because we were on a bad path,” she told a small group of reporters. “Storming the Capitol, really? And the reaction of Republicans, not taking a stand? And I knew we could win.” Her party had just lost the House, weeks after a crazed intruder broke into her California home and bludgeoned her husband with a hammer. But it hardly felt as if Pelosi was giving up in defeat. In an election that history and many forecasters predicted would deliver a Republican wave, Democrats surprisingly held their own. The resulting GOP majority will be a narrow one, with the Senate remaining in Democrats’ hands. The Oct. 28 attack on Paul Pelosi, the Speaker’s husband of 59 years, influenced her decision to remain in Congress, but not in the way many people thought. “It was not, ‘Oh, well, since they did that, I can’t even think of something else,’” she says. “No, it had the opposite effect. I couldn’t give them that satisfaction.” Read More: Nancy Pelosi Doesn’t Care What You Think Of Her. This steely tenaciousness, this refusal to let others decide her path, is a running theme of my biography of Pelosi. It has been the hallmark of her political career, from forcing her way into the male-dominated ranks of congressional leadership to standing up to former President Donald Trump. As the youngest child and only daughter of three-term Baltimore mayor Thomas D’Alessandro, politics was in Pelosi’s blood; she first set foot on the House floor as a young child, when her father was serving in Congress. But when she finally ran for office herself at the age of 47—after raising five children and serving for decades as a political fundraiser, strategist and volunteer—it was from a different coast, under a different name, with a political identity all her own. Deanne Fitzmaurice—San Francisco Chronicle/Getty ImagesNancy Pelosi at election headquarters on primary election night, on April 7, 1987. Ask Pelosi about her legacy, and the first thing she’ll mention is the Affordable Care Act. However flawed and incomplete the 2010 law’s guarantee of universal access to health care may have proven, it represented the fulfillment of a century of liberal aspirations, and the pinnacle of Pelosi’s legislative craft. She moved mountains to get it through the House, at one point nearly breaking down in tears as she begged a group of liberal feminists to swallow an unsavory compromise on abortion funding. Then, after a special election robbed Democrats of their supermajority in the Senate, she urged then-President Obama not to give up on the historic legislation. “If the gate’s closed, you go over the fence,” she said at the time. “If the fence is too high, we’ll pole-vault in. If that doesn’t work, we’ll parachute in. But we’re going to get health-care reform passed for the American people.” Though most of the drama around the bill’s passage revolved around the Senate, it never could have happened without Pelosi’s determination and drive. Win McNamee—Getty ImagesSpeaker of the House Nancy Pelosi stands behind President Barack Obama as he signs the Affordable Health Care for America Act during a ceremony with fellow Democrats in the East Room of the White House on March 23, 2010. She did it knowing there might be a political cost, and indeed there was. Republicans gained 63 seats in the House in the 2010 midterm elections, an election in which Pelosi was a central figure. Republicans made her the subject of millions of dollars’ worth of attack ads across the country, capitalizing on their base’s visceral loathing of her and giving Peosi unusual prominence for a congressional leader. But Pelosi believed in gaining power not for its own sake but in order to do something with it. Obamacare is part of a legacy that includes two decades of liberal policy victories, from allowing gay people to serve openly in the military to the historic climate investments of this year’s Inflation Reduction Act. “This is a very difficult job,” she told us. “You have to really know how to be a legislator.” These legislative successes were all the more remarkable for the era in which they came. Faced with unrelenting Republican opposition, she held together the diverse Democratic caucus and drove a hard bargain in negotiations across the aisle. After Donald Trump became president, she led her party back to power, becoming Speaker for the second time in 2019 in the middle of a government shutdown over border-wall funding. Pelosi refused to budge, and Trump soon capitulated. She would go on to impeach him twice while simultaneously negotiating with his Administration to secure trillions in COVID-19 relief funding. Read More: Why Nancy Pelosi Is Going All In Against Trump. Pelosi rejects the notion that she bears any blame for the toxic state of politics. “I don’t take any responsibility for what the Republicans have done to the Congress. This is not about gridlock,” she says. “This isn’t about some sort of equivalence between Democrats and Republicans. They are anti-science, anti-government, and that’s where they are.” The GOP’s lack of decency was apparent in many Republicans’ reaction to her husband’s attack, Pelosi says. “Just think if your spouse were in that situation and people would make a joke of it, like it was funny,” she added. “Collecting money for bail for the perpetrator, putting out a conspiracy theory about what it was about. It’s so horrible to think that the Republican Party has come down to this.” This attitude, she says, was part of what voters recoiled from the midterms. Mark Wilson—Getty Images (2); Chip Somodevilla—Getty Images; Jim Watson—Pool/AFP/Getty Images Pelosi never groomed a successor, something for which she was often criticized. Ambitious Democrats languished for decades waiting for an opening in House leadership. She has often expressed the view that power is never given but must be taken by those who seek it. “I didn’t think that was the right approach, to anoint somebody,” she told us Thursday. “It’s really important for people to have the legitimacy that they were chosen by the members.” A free-for-all appears unlikely. Pelosi’s longtime deputy Steny Hoyer, a fellow Marylander who has known her since they worked for the same Senator in 1963, announced Thursday that he would also stay in Congress but not in leadership. Rep. Hakeem Jeffries of New York, the 52-year-old chair of the Democratic caucus, appears almost certain to win the minority leader position in the Democratic leadership elections scheduled for Nov. 30, becoming the first Black man to lead a party in Congress. The first woman Speaker, in passing the torch, will make history once again. Pelosi intends to spend the next two years in valedictory mode. “My life ahead is full of thank-yous,” she says, to her constituents and all the others who have supported her over the years. She does not plan to serve on any committees and she does not want to serve as a sort of shadow speaker from the sidelines. “Thanksgiving is coming,” she says. “I have no intention of being the mother-in-law in the kitchen saying, ‘My son doesn’t like the stuffing that way, this is the way we make it in our family.’ They will have their vision. They will have their plan. It’s up to the caucus to decide which way they want to go.”",
    "pubDate": "2022-11-18 01:56:26",
    "image_url": null,
    "source_id": "timenextadvisor",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Rodgers, NFL Players Urge League to Nix Turf, Go With Grass",
    "link": "https://www.usnews.com/news/sports/articles/2022-11-17/rodgers-nfl-players-urge-league-to-nix-turf-go-with-grass",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 01:54:52",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Seoul: North Korea Fires Suspected Long-Range Missile",
    "link": "https://www.usnews.com/news/world/articles/2022-11-17/seoul-n-korea-fires-another-ballistic-missile-toward-sea",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 01:54:02",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Judge Wins AL MVP in Runaway; Goldschmidt Takes NL Prize",
    "link": "https://www.usnews.com/news/sports/articles/2022-11-17/cardinals-slugger-paul-goldschmidt-wins-nl-mvp-award",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 01:53:53",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Lengthy Vote Counts Frustrate, but Don't Signal Problems",
    "link": "https://www.usnews.com/news/politics/articles/2022-11-17/lengthy-vote-counts-frustrate-but-dont-signal-problems",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 01:47:46",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Blackstone Files for Nexus Mall REIT IPO at $3 Billion Value",
    "link": "https://www.bloomberg.com/news/articles/2022-11-18/blackstone-files-for-nexus-mall-reit-ipo-at-3-billion-value",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 01:44:58",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "John Stamos wants you to give Lori Loughlin a break, ok?",
    "link": "https://www.avclub.com/john-stamos-wants-you-to-give-lori-loughlin-a-break-ok-1849799325",
    "keywords": null,
    "creator": [
      "Peter Scobel"
    ],
    "video_url": null,
    "description": "Read more...",
    "content": null,
    "pubDate": "2022-11-18 01:22:00",
    "image_url": null,
    "source_id": "avclub",
    "country": [
      "united states of america"
    ],
    "category": [
      "entertainment"
    ],
    "language": "english"
  },
  {
    "title": "Bismarck Legacy stages furious comeback to top West Fargo and advance to Class A volleyball semifinals",
    "link": "https://www.inforum.com/sports/prep/bismarck-legacy-stages-furious-comeback-to-top-west-fargo-and-advance-to-class-a-volleyball-semifinals",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "After falling into a 2-0 hole, the Sabers clawed all the way back to top the Packers in five sets on Thursday.",
    "content": null,
    "pubDate": "2022-11-18 01:18:05",
    "image_url": null,
    "source_id": "inforum",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "How are Bitcoin Long-Term Holders Responding to the BTC Price Crash?",
    "link": "https://coinpedia.org/bitcoin/how-are-bitcoin-long-term-holders-responding-to-the-btc-price-crash/",
    "keywords": [
      "Bitcoin",
      "Bitcoin Price",
      "Crypto news",
      "Cryptocurrency",
      "Price Analysis"
    ],
    "creator": [
      "Elena R"
    ],
    "video_url": null,
    "description": "The post How are Bitcoin Long-Term Holders Responding to the BTC Price Crash? appeared first on Coinpedia Fintech News The Bitcoin price has continued to shrink in 2022 since Terra Luna initiated a significant crypto crash in Q1. The FTX and Alameda meltdown has stirred fresh selling pressure, which analysts expect to push through 2023. Moreover, confidence in centralized crypto exchanges has significantly slumped, which may push some to the insolvency route. According to …",
    "content": "The post How are Bitcoin Long-Term Holders Responding to the BTC Price Crash? appeared first on Coinpedia Fintech News The Bitcoin price has continued to shrink in 2022 since Terra Luna initiated a significant crypto crash in Q1. The FTX and Alameda meltdown has stirred fresh selling pressure, which analysts expect to push through 2023. Moreover, confidence in centralized crypto exchanges has significantly slumped, which may push some to the insolvency route. According to our latest crypto price oracles, Bitcoin is trading around $16,500, up from the recent lows of $15,900. The digital asset is trading 76 percent down from its ATH, $69k, set approximately a year ago. Long-term Bitcoin critic Peter Schiff thinks Bitcoin price is yet to bottom per the current sentiments. Shiff highlighted a scenario where long-term Bitcoin holders sell their bags to sustain themselves—adding that sooner than later, only long-term holders with sustainable paychecks will survive the shakeout. It didn't take long for this forecast to come true. The lion's share of the selling has not even started yet. #Bitcoin still has a long way to fall. https://t.co/dvNtGMIQHq— Peter Schiff (@PeterSchiff) November 17, 2022 Nonetheless, long-term Bitcoin holders are optimistic about the overall Btc market, which has significant adoption worldwide. Per on-chain data, long-term Bitcoin holders perceive the current bear market as similar to 2018 one. Glassnode explained: “Bitcoin Long-Term Holders are currently experiencing acute financial stress, holding an average of -33% in unrealized losses. This is comparable to the lows of the 2018 bear market, which saw a peak unrealized loss of -36% on average.” Notably, Glassnode data shows that crypto exchanges recorded a sharp uptick in withdrawals toward non-custodial platforms. Reportedly, cryptocurrency exchanges have seen one of the most significant net declines in aggregate BTC balance in history, falling by 72.9k BTC in 7 days. Glassnode Further Notes on Bitcoin Market Outlook Bitcoin (BTC) is a legal tender to two countries -El Salvador and the African Central Republic – and is regulated as a digital asset in many other jurisdictions. With a hard cap of 21 million Bitcoins and a halving to reduce the overall supply over time, market strategists are optimistic about its long-term success.  Nevertheless, global geopolitics and the prevailing macroeconomics continue to push Bitcoin prices to higher volatility. For instance, the ongoing war between Russia and Ukraine has significantly divided international regulators on using Bitcoin and other crypto assets.  Furthermore, western governments argue that Russia has used Bitcoin and other crypto assets to manoeuvre the set sanctions.  However, with the rising global inflation rate, which has significantly reduced fiat currencies’ purchasing power, Bitcoin and other digital assets are expected to record significant cash inflows.",
    "pubDate": "2022-11-18 06:28:00",
    "image_url": null,
    "source_id": "coinpedia",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Gokhshtein Says He’s Still Unofficial Leader of Shiba Inu",
    "link": "https://thecryptobasic.com/2022/11/18/gokhshtein-says-hes-still-unofficial-leader-of-shiba-inu/?utm_source=rss&utm_medium=rss&utm_campaign=gokhshtein-says-hes-still-unofficial-leader-of-shiba-inu",
    "keywords": [
      "Market",
      "Altcoins",
      "David Gokhshtein",
      "Shiba Inu"
    ],
    "creator": [
      "Lele Jima"
    ],
    "video_url": null,
    "description": "Gokhshtein insists he’s the unofficial leader of Shiba Inu. Prominent cryptocurrency influencer David Gokhshtein has reiterated again that he is the unofficial leader of Shiba Inu (SHIB). Gokhshtein’s recent claim comes less than two weeks after he declared himself as the unofficial Shiba Inu leader. In a tweet today, Gokhshtein said: “I’m still the unofficial leader […] The post Gokhshtein Says He’s Still Unofficial Leader of Shiba Inu first appeared on The Crypto Basic.",
    "content": null,
    "pubDate": "2022-11-18 06:25:05",
    "image_url": null,
    "source_id": "thecryptobasic",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Telefonica Plans Broad Spanish Price Hikes in Effort to Boost Sales",
    "link": "https://www.bloomberg.com/news/articles/2022-11-17/telefonica-plans-broad-spanish-price-hikes-in-bid-to-boost-sales",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 06:24:42",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "APT Price Soars 10% – Time To Buy APT?",
    "link": "https://insidebitcoins.com/news/apt-price-soars-10-time-to-buy-apt",
    "keywords": [
      "Cryptocurrency"
    ],
    "creator": [
      "Prateek Arora"
    ],
    "video_url": null,
    "description": "As we come across new stories and find how deep the FTX-debacle rabbit hole goes, we are also witnessing the values of crypto assets sinking [...]",
    "content": "As we come across new stories and find how deep the FTX-debacle rabbit hole goes, we are also witnessing the values of crypto assets sinking [...]",
    "pubDate": "2022-11-18 06:13:07",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Metaverse ‘explosion’ will be driven by B2B, not retail consumers: KPMG partner",
    "link": "https://cointelegraph.com/news/metaverse-explosion-will-be-driven-by-b2b-not-retail-consumers-kpmg-partner",
    "keywords": [
      "James Mabbott",
      "Alysse Sue",
      "KPMG Futures",
      "KPMG Origin",
      "Business Model",
      "Google Meet",
      "Microsoft Teams",
      "Zoom",
      "User Activity",
      "User Experience"
    ],
    "creator": [
      "Cointelegraph By    Brayden Lindrea"
    ],
    "video_url": null,
    "description": "KPMG's incoming Head of Metaverse Futures Alyse Sue said the objective is to build a multi-million dollar business opportunity for the firm by 2025.",
    "content": null,
    "pubDate": "2022-11-18 06:09:37",
    "image_url": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTEvNDg2ZjU3MWQtOTFhMi00OTJiLTllYmQtODdkMTM1MTI3MjU4LmpwZw==.jpg",
    "source_id": "cointelegraph",
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "title": "$250,000 per Bitcoin? Tim Draper Explains Why He Still Stands by His Bullish Prediction",
    "link": "https://u.today/250000-per-bitcoin-tim-draper-explains-why-he-still-stands-by-his-bullish-prediction",
    "keywords": null,
    "creator": [
      "Alex Dovbnya"
    ],
    "video_url": null,
    "description": "Prominent venture capitalist Tim Draper continues to stand by his uber-bullish Bitcoin price prediction",
    "content": null,
    "pubDate": "2022-11-18 06:08:21",
    "image_url": null,
    "source_id": "utoday",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Toon Finance DogeCoin Shiba Inu Coin Moon After Elon Musk Seals Twitter Purchase",
    "link": "https://coinpedia.org/press-release/toon-finance-dogecoin-shiba-inu-coin-moon-after-elon-musk-seals-twitter-purchase/",
    "keywords": [
      "PRESS RELEASE"
    ],
    "creator": [
      "Coinpedia"
    ],
    "video_url": null,
    "description": "The post Toon Finance DogeCoin Shiba Inu Coin Moon After Elon Musk Seals Twitter Purchase appeared first on Coinpedia Fintech News In the past few months, there has been a great deal of discussion over so-called “meme coins” like DOGE, of which Elon Musk claims to be a large admirer. Since his controversial purchase of Twitter, it has rocketed in popularity. What is a meme coin? A cryptocurrency that is based on or gets its inspiration …",
    "content": "The post Toon Finance DogeCoin Shiba Inu Coin Moon After Elon Musk Seals Twitter Purchase appeared first on Coinpedia Fintech News In the past few months, there has been a great deal of discussion over so-called “meme coins” like DOGE, of which Elon Musk claims to be a large admirer. Since his controversial purchase of Twitter, it has rocketed in popularity. What is a meme coin? A cryptocurrency that is based on or gets its inspiration from an online meme is called a meme coin. The most well-known example of a currency based on a meme is the DOGE, which was designed after the viral image of a Shiba Inu dog known as the “Doge” meme. Other examples of meme coins are UBQ and COIN, both of which are based on popular memes such as “Ubiquiti” and “Bitcoin,” respectively. The realm of virtual currencies is perpetually undergoing change, with new concepts and technology being presented on a consistent basis. The proliferation of meme coins is a relatively recent phenomenon in this sector.  The Support of DOGEcoin by Elon Musk and What It Means for Investors in Cryptocurrencies Elon Musk, CEO of both Tesla and SpaceX, has been a prominent booster of DOGEcoin, which has led to a significant increase in the price of the cryptocurrency. It is possible that there is more to Musk’s backing than meets the eye, despite the fact that some people assume he is just trying to capitalise on the current wave of excitement. In this article, we will discuss some of the reasons that Musk may have endorsed DOGEcoin, as well as what this support may represent for those who have invested in cryptocurrencies. There are a few different hypotheses to consider on the reasons why Elon Musk is such a vocal supporter of DOGEcoin. To begin, it is possible that he just really likes the coin, or that he has faith in its potential in the long run. Second, it is possible that he is trying to raise people’s knowledge about cryptocurrencies in general and the potential that they have as an investment. The third possibility is that he is attempting to create a buzz in order to artificially inflate the price of DOGEcoin (and make a profit in the process). It is important to note that Musk is not the only celebrity to endorse DOGEcoin; other celebrities, such as Snoop Dogg and Gene Simmons, have also shown their support for the cryptocurrency. It is possible that the price of DOGEcoin is being driven even higher by the increased attention it is receiving from high-profile personalities. It is impossible to overlook Elon Musk’s impact on the cryptocurrency market, regardless of whether you are an investor in cryptocurrencies or just someone who is inquisitive about the world of digital currencies. The price of the cryptocurrency has skyrocketed as a direct result of his public promotion of DOGEcoin.  Some people assume that he is simply trying to capitalise on the buzz around the cryptocurrency; however, there may be more to his endorsement than meets the eye. The impact that Musk’s continuous support will have on DOGEcoin and the cryptocurrency industry as a whole is something that can only be determined with the passage of time; nevertheless, one thing is certain: he is most certainly someone to keep an eye on. Toon Finance Decnetalized coins are beginning to attract media attention from all over the world as more and more celebrities from across the world enter the field of decentralised finance. Toon Finance is a brand new DEX platform that operates similarly to pancake swaps and will include support for the ERC20 blockchain. Toon Finance is a forward-thinking piece of software that has produced a sizable community of seasoned users, and anyone who is interested in joining the team can do so at no cost. Simply joining their Telegram channel and introducing yourself is all that is required of you at this point. Already having raised more than 2 million dollars in USD during the first week of their presale, Toon Finance is poised to become the Meme token of the year. After many months of planning and preparation, the long-delayed project can now be accessed by the general public. The following is a list of the distinguishing characteristics that set Toon Finance apart from other meme coins, such as Tamadoge and Shiba Inu: Uses the DEX Operating System as its base. The primary feature of the Toon Finance Protocol is that it is a decentralized exchange (DEX) platform. This is a unique characteristic because other meme coins on the market operate on centralized platforms. Toon Finance operates on the DEX to offer investors more security and peace of mind. One of the biggest advantages of the DEX system is that it does not have a central failure point that hackers can attack to harm the users. This is why investors can rest assured that their finances are safer. Another advantage of DEX is that it eliminates the need for a third party to act as a middleman in the transactions. Toon Finance / TFT Twitter / Toon Finance Telegram Disclaimer: This is a press release post. Coinpedia does not endorse or is responsible for any content, accuracy, quality, advertising, products, or other materials on this page. Readers should do their own research before taking any actions related to the company.",
    "pubDate": "2022-11-18 06:07:04",
    "image_url": null,
    "source_id": "coinpedia",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "8 things to do this weekend in Portland | Nov. 18-20",
    "link": "https://www.kgw.com/article/entertainment/events/portland-things-to-do/things-to-do-this-weekend-portland/283-24e02b89-ab21-4af2-b41f-c238284b8eaa",
    "keywords": [
      "portland-things-to-do",
      "entertainment",
      "events",
      "home"
    ],
    "creator": null,
    "video_url": null,
    "description": "The holiday spirit is definitely in the air. This weekend kicks off a few Christmas theme events, along with food and gift festivals.",
    "content": null,
    "pubDate": "2022-11-18 05:55:06",
    "image_url": "https://media.tegna-media.com/assets/KGW/images/f015c192-326b-448c-b30e-ff707d65ffdf/f015c192-326b-448c-b30e-ff707d65ffdf_750x422.jpg",
    "source_id": "kgw",
    "country": [
      "united states of america"
    ],
    "category": [
      "entertainment"
    ],
    "language": "english"
  },
  {
    "title": "Zerlina Zeng on China's Property Crisis (Radio)",
    "link": "https://www.bloomberg.com/news/audio/2022-11-18/zerlina-zeng-on-china-s-property-crisis-radio",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 05:54:34",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Bitcoin Price Prediction for Today, November 17: BTC Price Risks Further Decline as It Faces Rejection at $17K",
    "link": "https://insidebitcoins.com/news/bitcoin-price-prediction-for-today-november-17-btc-price-risks-further-decline-as-it-faces-rejection-at-17k",
    "keywords": [
      "analysis",
      "Bitcoin",
      "Opinion",
      "btc",
      "BTC/USD",
      "Price Analysis"
    ],
    "creator": [
      "Azeez Mustapha"
    ],
    "video_url": null,
    "description": "Bitcoin Trades Marginally as It Faces Rejection at $17K – November 17, 2022 Bitcoin’s (BTC) price has been moving sideways since its price drop on [...]",
    "content": "Bitcoin Trades Marginally as It Faces Rejection at $17K – November 17, 2022 Bitcoin’s (BTC) price has been moving sideways since its price drop on [...]",
    "pubDate": "2022-11-18 05:52:02",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Sunny & Cold Today and through the Weekend – Mark",
    "link": "https://www.kxly.com/sunny-cold-today-and-through-the-weekend-mark/",
    "keywords": [
      "Forecast",
      "Top Stories",
      "Weather",
      "bitter",
      "cold",
      "ski",
      "sun",
      "thanksgiving",
      "warm",
      "weekend",
      "winds"
    ],
    "creator": [
      "Mark Peterson"
    ],
    "video_url": null,
    "description": "Our current high pressure will keep us cloud-free and very cold with Arctic Air hanging out until the start of next week. Clouds and slow warming into Thanksgiving with the best chance of showers Tuesday.",
    "content": "What we’re tracking Our current high pressure will keep us cloud-free and very cold with Arctic Air hanging out until the start of next week. Clouds and slow warming into Thanksgiving with the best chance of showers Tuesday. Plan your day Morning starts with bitter cold conditions and a clear sky. Dress in layers and grab your shades. Spokane and Coeur d’Alene forecast Teens begin the day and we won’t hit the freezing mark so Cold all day. High of 31 with a normal high around 41. COPYRIGHT 2022 BY KXLY. ALL RIGHTS RESERVED. THIS MATERIAL MAY NOT BE PUBLISHED, BROADCAST, REWRITTEN OR REDISTRIBUTED.",
    "pubDate": "2022-11-18 12:46:37",
    "image_url": null,
    "source_id": "kxly",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Here’s How FTX Collapse Could Be A Domino Effect Of Terra Collapse",
    "link": "https://www.tronweekly.com/ftx-collapse-be-domino-effect-of-terra-collapse/",
    "keywords": [
      "News",
      "World",
      "Almeda",
      "ftx",
      "terra"
    ],
    "creator": [
      "Aishwarya shashikumar"
    ],
    "video_url": null,
    "description": "Numerous projects like FTX went under in the world of cryptocurrencies. Prominent cryptocurrency platforms were observed declaring bankruptcy one after another. The biggest fall was undoubtedly SBF’s firm collapse. While many were busy accusing Sam Bankman-Fried (SBF) of fraud and poor management, a new study showed how Terra might have precipitated the SBF’s empire’s precipitous […]",
    "content": null,
    "pubDate": "2022-11-18 12:37:29",
    "image_url": null,
    "source_id": "tronweekly",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Bloomberg UK Politics: Hunting for Positives (Podcast)",
    "link": "https://www.bloomberg.com/news/audio/2022-11-18/bloomberg-uk-politics-hunting-for-positives-podcast",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 12:36:16",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Ethereum to develop climate platform for the world – Will it drive ETH price to $2,000?",
    "link": "https://www.crypto-news-flash.com/ethereum-to-develop-climate-platform-for-the-world-will-it-drive-eth-price-to-2000/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-to-develop-climate-platform-for-the-world-will-it-drive-eth-price-to-2000",
    "keywords": [
      "News",
      "climate change",
      "ConsenSys",
      "Ethereum",
      "Proof of Work",
      "Proof-of-Stake",
      "tech"
    ],
    "creator": [
      "Paul Ade"
    ],
    "video_url": null,
    "description": "ConsenSys, in collaboration with several crypto companies, is co-launching a climate platform for the world built on the Ethereum PoS consensus protocol. Regulatory authorities have constantly expressed their worries over the effects of crypto mining on the environment. The Ethereum-based software firm, ConsenSys, which played a crucial role in the completion of the much-publicized Merge, [...] Der Beitrag Ethereum to develop climate platform for the world – Will it drive ETH price to $2,000? erschien zuerst auf Crypto News Flash.",
    "content": "ConsenSys, in collaboration with several crypto companies, is co-launching a climate platform for the world built on the Ethereum PoS consensus protocol. Regulatory authorities have constantly expressed their worries over the effects of crypto mining on the environment. The Ethereum-based software firm, ConsenSys, which played a crucial role in the completion of the much-publicized Merge, has teamed up with many other crypto firms to co-launch the Ethereum Climate Platform (ECP) during the ongoing global climate conference, dubbed COP27. The COP27 is a United Nations Climate Change Global Innovation Hub in Sharm el-Sheikh, Egypt, from November 6–18. The climate platform is developed for the Ethereum network and aims to reduce the ecosystem’s excess energy demand, which was the norm before the Merge two months ago. According to Joseph Lubin, co-founder of ConsenSys and a developer of the Ethereum blockchain, the motive is to raise some capital and invest it in high-impact technologies. Lubin stated that the team is expected to find funding for new projects that have technological significance and determine how impactful they will become. Upon the completion of the Merge, Ethereum discontinued its use of the energy-intensive proof-of-work (PoW) to the more energy-efficient proof-of-stake (PoS) consensus protocol. Ethereum, during the PoW stage, was powered by miners who completed several challenging puzzles to add more transactions to the ledger. With the PoS, Ethereum utilizes validators to facilitate transactions on the blockchain while using less energy. After the Merge, the network has drastically reduced its energy use by 99.9%. Part of Lubin’s statement read: “The Ethereum Merge has raised the bar for reducing climate change across the broader sectors of the global economy. It shows that with a collective drive, technological innovations are possible without increasing carbon emissions.” Rising Concerns about Crypto Mining Even before Ethereum’s transition from the PoW to the PoS, digital asset mining has been the subject of increasing backlash from regulators and environmental activists. Accordingly, the European Commission revealed in October that it plans to ban crypto mining if the region faces a severe energy crisis in the coming winter. As expected, regulatory agencies like the European Union (EU) are proposing ways to reduce PoW activities within the bloc. In October, the European Commission told its member states to be ready to stop crypto mining. In addition, the commission proposes load shedding in the region’s electricity supply as winter approaches. China has since taken a more extreme stance by banning Bitcoin mining and other crypto trading activities in 2021. Other PoW protocols, like Dogecoin and Zcash, also consider switching to PoS due to energy concerns. Ethereum has experienced a significant surge in its price after the Merge, with the network seeing close to a 10% increase. However, the gains were short-lived as ETH could not continue its upward trend 24 hours after the historic transition. ETH currently trades at $1,214 at the time of writing, per our data. However, the token is yet to respond to the latest development as the community hopes for a price increase towards the $2,000 level before the year ends. Der Beitrag Ethereum to develop climate platform for the world – Will it drive ETH price to $2,000? erschien zuerst auf Crypto News Flash.",
    "pubDate": "2022-11-18 12:34:51",
    "image_url": null,
    "source_id": "cryptonewsflash",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Use Safety Check to instantly wipe toxic apps (and people) from your iPhone",
    "link": "https://www.tomsguide.com/how-to/how-to-use-safety-check-on-iphone",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "Safety Check on iOS allows users to instantly shut down any information sharing on their iPhone, extinguishing privacy threats in one fell swoop. Here's how.",
    "content": null,
    "pubDate": "2022-11-18 12:32:08",
    "image_url": "http://cdn.mos.cms.futurecdn.net/PANBZRFKz9DApoSgwJaus9.jpg",
    "source_id": "tomsguide",
    "country": [
      "united states of america"
    ],
    "category": [
      "technology"
    ],
    "language": "english"
  },
  {
    "title": "SHIB Now Gaining Traction as Safe Haven, Certik Statistics Imply",
    "link": "https://u.today/shib-now-gaining-traction-as-safe-haven-certik-statistics-imply",
    "keywords": null,
    "creator": [
      "Tomiwabold Olajide"
    ],
    "video_url": null,
    "description": "SHIB's historic social sentiment remains positive for blockchain",
    "content": null,
    "pubDate": "2022-11-18 12:28:00",
    "image_url": null,
    "source_id": "utoday",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "iPhone 15 vs. iPhone 15 Pro: What we know so far",
    "link": "https://www.tomsguide.com/news/iphone-15-vs-iphone-15-pro",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "The iPhone 15 vs iPhone 15 Pro differences could be huge. Here's the rumors and leaks so far.",
    "content": null,
    "pubDate": "2022-11-18 12:17:05",
    "image_url": "http://cdn.mos.cms.futurecdn.net/HzWJ3MENAJNeQFGEiRAyfe.jpg",
    "source_id": "tomsguide",
    "country": [
      "united states of america"
    ],
    "category": [
      "technology"
    ],
    "language": "english"
  },
  {
    "title": "Crypto Marketing 2022: How Big Eyes Coin Overtook The Meme Coin Moment",
    "link": "https://coincheckup.com/blog/crypto-marketing-2022-how-big-eyes-coin-overtook-the-meme-coin-moment/",
    "keywords": [
      "Sponsored",
      "BIG",
      "Big Eyes",
      "FLOKI",
      "Floki Inu",
      "SHIB",
      "Shiba Inu"
    ],
    "creator": [
      "External Team"
    ],
    "video_url": null,
    "description": "It’s 2022, and everywhere are distractions. In your pocket right now is a machine capable of delivering to you nearly any sort of entertainment you could ever wish for. When you turn on your television, you’re able to pause, skip, or fast-forward through ads for products of all varieties. Whether you’re listening to the radio, watching a video on an online platform, or even reading a book through a digital reader, it’s impossible to avoid marketing.",
    "content": null,
    "pubDate": "2022-11-18 12:16:33",
    "image_url": null,
    "source_id": "coincheckup",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Chris Rock returns to site of infamous Will Smith slap",
    "link": "https://nypost.com/2022/11/18/chris-rock-returns-to-site-of-will-smith-slap-at-dolby-theatre/",
    "keywords": null,
    "creator": [
      "Richard Pollina",
      " Marjorie Hernandez"
    ],
    "video_url": null,
    "description": "Rock seemed determined to show that he had shifted the energy in the room by claiming he was not the victim then and he would never play one on stage.",
    "content": "Rock seemed determined to show that he had shifted the energy in the room by claiming he was not the victim then and he would never play one on stage.",
    "pubDate": "2022-11-18 12:15:40",
    "image_url": "https://nypost.com/wp-content/uploads/sites/2/2022/11/newspress-collage-24703785-1668772054630.jpg?quality=90&strip=all&1668754111",
    "source_id": "nypost",
    "country": [
      "united states of america"
    ],
    "category": [
      "entertainment"
    ],
    "language": "english"
  },
  {
    "title": "BC.GAME’s World Cup Carnival Offers $2.1M and a Tesla in Prizes",
    "link": "https://www.crypto-news-flash.com/bc-games-world-cup-carnival-offers-2-1m-and-a-tesla-in-prizes/?utm_source=rss&utm_medium=rss&utm_campaign=bc-games-world-cup-carnival-offers-2-1m-and-a-tesla-in-prizes",
    "keywords": [
      "News",
      "Press release"
    ],
    "creator": [
      "chainwire"
    ],
    "video_url": null,
    "description": "Willemstad, Curaçao, 18th November, 2022, Chainwire To mark the FIFA World Cup 2022, online gaming platform BC.GAME is offering multi-million dollar prizes via its Coco’s Carnival portal. Crypto Casino BC.GAME is a major World Cup advocate thanks to its sponsorship of the Argentine Football Association. Throughout 2022, BC.GAME has been offering an ever-growing number of [...] Der Beitrag BC.GAME’s World Cup Carnival Offers $2.1M and a Tesla in Prizes erschien zuerst auf Crypto News Flash.",
    "content": "Willemstad, Curaçao, 18th November, 2022, Chainwire To mark the FIFA World Cup 2022, online gaming platform BC.GAME is offering multi-million dollar prizes via its Coco’s Carnival portal. Crypto Casino BC.GAME is a major World Cup advocate thanks to its sponsorship of the Argentine Football Association. Throughout 2022, BC.GAME has been offering an ever-growing number of prizes, culminating in a grand promotion that coincides with the World Cup. This gives players a chance to win up to $2.1M or a Tesla car from Coco’s Carnival, a separate page created by BC.GAME dedicated to fans and sports bettors of the World Cup. BC.GAME offers a $100,000 prize pool for those who submit their World Cup predictions before November 26, 2022. Sports bettors are to place their predictions on the winners of each group. From the winners of the knockout rounds, players must predict who will be this year’s world champion. Players with VIP 4 and above can participate for free and finalize their predictions by 26/11/2022 00:00 AM UTC. In the event that more than one player makes the same prediction, the prize pool will be divided equally, and only one player per household is allowed to join the game. As part of BC.GAME’s policy, multiple claims or players with combo bets will be disqualified from the promotion. Further details of the promotions offering a $2,100,000 prize pool and a Tesla will be released soon. BC.GAME’s partnership with the Argentine Football Association will focus not only on the World Cup but also on the upcoming leagues in which the AFA is participating. AFA and BC.GAME are seeking engagements with Argentine team members and crypto casino players. About BC.GAME BC.GAME is a crypto gambling platform that offers various online casino games, live casinos, and sports betting. With its integration of cryptocurrency and blockchain technology, BC.GAME enables players to access the benefits provided by both technologies. Sportsbetting is included in its gaming portfolio, supporting wagers on major leagues, including the upcoming World Cup. Contact PRIssay DomingoBC.GAMElarswriter@bcgame.com Der Beitrag BC.GAME’s World Cup Carnival Offers $2.1M and a Tesla in Prizes erschien zuerst auf Crypto News Flash.",
    "pubDate": "2022-11-18 12:15:07",
    "image_url": null,
    "source_id": "cryptonewsflash",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Binance and Cristiano Ronaldo First Exclusive NFT Drops",
    "link": "https://www.tronweekly.com/binance-cristiano-ronaldo-exclusive-nft-drops/",
    "keywords": [
      "Industry",
      "News",
      "Binance",
      "Cristiano Ronaldo",
      "NFT"
    ],
    "creator": [
      "Vignesh Karunanidhi"
    ],
    "video_url": null,
    "description": "The captain of the Portuguese national football team, Cristiano Ronaldo, has partnered with Binance to launch his first NFT collection. The international cryptocurrency exchange Binance and the football player have entered into an exclusive multi-year partnership. The launch is scheduled just before the 2022 FIFA World Cup in Qatar, which gets underway on November 20. Ronaldo plans […]",
    "content": null,
    "pubDate": "2022-11-18 18:05:43",
    "image_url": null,
    "source_id": "tronweekly",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "FCA Opts for Public Censure of Sonali Bank UK ex-CEO for AML Failure",
    "link": "https://www.financemagnates.com//fintech/fca-opts-for-public-censure-for-sonali-bank-uk-ex-ceos-aml-failure/",
    "keywords": [
      "FinTech",
      "News"
    ],
    "creator": [
      "Solomon Oladipupo",
      "www.financemagnates.com"
    ],
    "video_url": null,
    "description": "<p>The United Kingdom Financial Conduct Authority (FCA) has publicly censured Mohammad Prodhan, the former Chief Executive Officer of Sonali Bank UK (SBUK), for failing to establish and maintain effective anti-money laundering (AML) systems and controls at the bank. </p><p>The financial markets regulator, which <a href=\"https://www.financemagnates.com/institutional-forex/regulation/sonali-bank-uk-ceo-fined-76400-for-money-laundering/\">fined Prodhan £76,400 in 2018</a>, is now opting to several disapprove the ex-CEO as a result of “exceptional circumstances in this case.”</p><p>These situations include \"Mr Prodhan returning to Bangladesh and no longer having income or assets in the UK; the fact he is no longer in employment in Bangladesh; ongoing personal conditions which limit his ability to travel to the UK for the Upper Tribunal; and the length of time since his misconduct which has been impacted by Covid-delays to the litigation,” <a href=\"https://www.financemagnates.com/tag/financial-conduct-authority/\" target=\"_blank\">FCA</a> explained in a statement <a href=\"https://www.fca.org.uk/news/press-releases/fca-issues-final-notice-former-ceo-anti-money-laundering-failings\">released</a> on Friday.</p><p>Furthermore, the financial watchdog noted the Bank of England’s Prudential Regulation Authority has canceled the bank’s authorization. The institution has also been renamed to Sonali Bangladesh (UK) Limited, it said. </p><p>SBUK was founded in 2001 to serve the Bangladeshi community in the United Kingdom. The bank is the product of a partnership between the Bangladesh government and Sonali Bank, a state-owned commercial bank in Bangladesh.</p><p>Prodhan's Offence</p><p>In 2018, the FCA penalized Prodhan for failing to take charge of his AML duties at the SBUK, leading to “systemic failures in SBUK’s AML systems and controls throughout the business.” However, the CEO referred the case to the Upper Tribunal, a UK superior appellate court, where the case was delayed. </p><p>“While a financial penalty was appropriate in this case, prolonged litigation to enforce a penalty that is unlikely to be paid against a person who may not be able to travel to the UK to explain himself in person to the Upper Tribunal is neither practical nor fair,\" noted Mark Steward, Executive Director of Enforcement and Market Oversight at the FCA. \"In these exceptional circumstances, a public censure is an appropriate resolution of the case,” Steward added.</p><p>Meanwhile, in 2016, <a href=\"https://www.financemagnates.com/tag/bangladesh/\">Bangladesh</a> appointed Pradhan as the Managing Director of Rupali Bank, a state-owned commercial bank. In 2019, the executive was also selected as the MD of Sonali Bank in Bangladesh. However, FCA in the latest statement said Prodhan is no longer in employment in Bangladesh.</p> This article was written by Solomon Oladipupo at www.financemagnates.com.",
    "content": null,
    "pubDate": "2022-11-18 17:58:43",
    "image_url": null,
    "source_id": "financemagnates",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Solana Loses $1 Billion in USDT to Ethereum in Tether Chain Swap",
    "link": "https://decrypt.co/115028/tether-usdt-1-billion-solana-ethereum",
    "keywords": [
      "solana",
      "tether",
      "Business"
    ],
    "creator": [
      "Mathew Di Salvo"
    ],
    "video_url": null,
    "description": "The chain swap announcement comes as Solana faces difficulties.",
    "content": null,
    "pubDate": "2022-11-18 17:49:27",
    "image_url": "https://cdn.decrypt.co/resize/1024/height/512/wp-content/uploads/2022/04/Tether-dollars-gID_6.jpeg",
    "source_id": "decrypt",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "BTC Price Prediction – How Long Can the Crypto Ranging Go On?",
    "link": "https://insidebitcoins.com/news/btc-price-prediction-how-long-can-the-crypto-ranging-go-on",
    "keywords": [
      "Bitcoin",
      "Cryptocurrency"
    ],
    "creator": [
      "Jimmy Aki"
    ],
    "video_url": null,
    "description": "Bitcoin has yet to enjoy a smooth sailing year. Macroeconomic events and industry incidents have largely hampered its growth since its November 2021 record high [...]",
    "content": "Bitcoin has yet to enjoy a smooth sailing year. Macroeconomic events and industry incidents have largely hampered its growth since its November 2021 record high [...]",
    "pubDate": "2022-11-18 17:45:41",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Russian bill would legalize crypto mining, sales under ‘experimental legal regime’",
    "link": "https://cointelegraph.com/news/russian-bill-would-legalize-crypto-mining-sales-under-experimental-legal-regime",
    "keywords": [
      "Russia",
      "Mining",
      "Cryptocurrency Exchange",
      "Digital Asset"
    ],
    "creator": [
      "Cointelegraph By   Derek Andersen"
    ],
    "video_url": null,
    "description": "The bill provides a legal definition of mining and mining pools and would create a domestic cryptocurrency market in Russia’s latest step to integrate digital assets into its economy.",
    "content": null,
    "pubDate": "2022-11-18 17:45:00",
    "image_url": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTEvOTg5YmVkYmUtNDA2NS00ZjFmLTk5MmEtNGJiNjg4ODBjOGJhLmpwZw==.jpg",
    "source_id": "cointelegraph",
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "title": "Thunderbird Entertainment Sees Proxy Fight With Activist Investor Heat Up",
    "link": "https://www.hollywoodreporter.com/business/business-news/thunderbird-entertainment-sees-proxy-fight-with-activist-investor-heat-up-1235265152/",
    "keywords": [
      "Business",
      "Business News",
      "thunderbird entertainment"
    ],
    "creator": [
      "Etan Vlessing"
    ],
    "video_url": null,
    "description": "Producer Thunderbird Entertainment, which backs multiple projects filming Vancouver for U.S. studios and streamers, has dismissed a proxy fight heating up with activist investor Voss Capital. “Thunderbird believes this proxy fight is a waste of time, energy and resources,” the company, led by CEO Jennifer Twiner McCarron, said in a statement on Thursday after delaying […]",
    "content": null,
    "pubDate": "2022-11-18 17:44:41",
    "image_url": null,
    "source_id": "hollywoodreporter",
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "title": "Taylor Swift On Ticketmaster Tech Issues: “We Were Assured” They Could Handle the Demand",
    "link": "https://www.hollywoodreporter.com/business/business-news/taylor-swift-ticketmaster-we-were-assured-they-could-handle-demand-1235265157/",
    "keywords": [
      "Business",
      "Business News",
      "Live Nation",
      "Taylor Swift",
      "Ticketmaster"
    ],
    "creator": [
      "Caitlin Huston"
    ],
    "video_url": null,
    "description": "Taylor Swift is speaking out against Ticketmaster after fans experienced problems buying tickets to her upcoming Eras tour.  Ticketmaster experienced errors and site slowdowns on Tuesday during its Taylor Swift pre-sale for verified fans. The site sold two million tickets during the pre-sale, a record for a single artist in a day but continued to […]",
    "content": null,
    "pubDate": "2022-11-18 17:42:56",
    "image_url": null,
    "source_id": "hollywoodreporter",
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "title": "Here’s What Binance’s CZ Has To Say About SBF",
    "link": "https://www.tronweekly.com/heres-what-binances-cz-has-to-say-about-sbf/",
    "keywords": [
      "News",
      "World",
      "Binance",
      "Changpeng Zhao",
      "CZ",
      "Sam Bankman-Fried",
      "SBF"
    ],
    "creator": [
      "Aishwarya shashikumar"
    ],
    "video_url": null,
    "description": "The bankruptcy of reputable cryptocurrency exchange FTX has caused complete turmoil in the industry. Binance agreed to make a non-binding contribution to the troubled business earlier this month. Then, though, it quickly changed its mind and said that it was powerless to do anything about the problems. Changpeng Zhao, the co-founder and CEO of Binance, […]",
    "content": null,
    "pubDate": "2022-11-18 17:41:22",
    "image_url": null,
    "source_id": "tronweekly",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Carvana to Cut 1,500 Jobs as Online Auto Dealer’s Troubles Mount",
    "link": "https://www.bloomberg.com/news/articles/2022-11-18/carvana-says-it-will-cut-1-500-jobs-as-company-s-troubles-mount",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 17:39:49",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Candace Cameron Bure says faith helped through 'difficult year': 'Grateful for God's protection'",
    "link": "https://www.yahoo.com/entertainment/candace-cameron-bure-faith-bob-saget-god-173948625.html",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 17:39:48",
    "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2021-11/72dde980-4ed1-11ec-a7f7-a95569e3320e",
    "source_id": "yahoo",
    "country": [
      "united states of america"
    ],
    "category": [
      "entertainment"
    ],
    "language": "english"
  },
  {
    "title": "Attorney General appoints special counsel to oversee Trump criminal investigations",
    "link": "https://www.cbsnews.com/sanfrancisco/video/attorney-general-appoints-special-counsel-to-oversee-trump-criminal-investigations/",
    "keywords": [
      "News",
      "Crime",
      "Politics",
      "National News",
      "Spoken Word KPIXTV"
    ],
    "creator": null,
    "video_url": null,
    "description": "Attorney General Merrick Garland has named a special counsel to oversee the entirety of the Justice Department's criminal investigation of former president Donald Trump. Skyler Henry reports. (11-19-22)",
    "content": null,
    "pubDate": "2022-11-19 01:18:00",
    "image_url": "https://assets3.cbsnewsstatic.com/hub/i/r/2022/11/19/dc75f10d-3fc8-493f-871a-5e35e5e61370/thumbnail/1024x576/2b3276fecfe559038b37370cbc9676a0/1cd94f5691514e517b555d939433c972.jpg",
    "source_id": "sanfranciscocbslocal",
    "country": [
      "united states of america"
    ],
    "category": [
      "politics"
    ],
    "language": "english"
  },
  {
    "title": "Trump 2024 Rivals Court His Donors at Big Las Vegas Meeting",
    "link": "https://www.usnews.com/news/politics/articles/2022-11-18/trumps-rivals-court-his-donors-as-24-primary-season-begins",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-19 01:11:56",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Musk Starts Twitter Poll on Reinstating Former President Trump",
    "link": "https://www.bloomberg.com/news/articles/2022-11-19/musk-starts-twitter-poll-on-reinstating-former-president-trump",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-19 01:10:47",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Summers Warns Very Risky for US to Aim at ‘Tearing China Down’",
    "link": "https://www.bloomberg.com/news/articles/2022-11-19/summers-warns-very-risky-for-us-to-aim-at-tearing-china-down",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-19 01:06:21",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Homer Library Board Delays Decision on Moving LGBTQ+ Books",
    "link": "https://www.usnews.com/news/best-states/alaska/articles/2022-11-18/homer-library-board-delays-decision-on-moving-lgbtq-books",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-19 01:03:41",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Closing arguments begin in Oath Keepers trial",
    "link": "https://www.cbsnews.com/news/prosecutors-say-storming-capitol-was-means-for-oath-keepers-to-keep-biden-from-becoming-president/",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "Closing arguments began in the Jan. 6 trial for five members and affiliates of the far-right Oath Keepers accused of seditious conspiracy.",
    "content": null,
    "pubDate": "2022-11-19 01:02:18",
    "image_url": "https://assets3.cbsnewsstatic.com/hub/i/r/2022/10/19/1a55a968-3d92-4d80-b943-f9f05a6f675b/thumbnail/60x60/02b493c5a5f3b4a7f44b9560989c3b21/ap22285736875213-1.jpg",
    "source_id": "cbsnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "politics"
    ],
    "language": "english"
  },
  {
    "title": "Having married himself to earn $10 million, Dennis Rodman once claimed how s*x the night before games ruined his performance",
    "link": "https://thesportsrush.com/nba-news-having-married-himself-to-earn-10-million-dennis-rodman-once-claimed-how-sx-the-night-before-games-ruined-his-performance/",
    "keywords": [
      "Basketball"
    ],
    "creator": [
      "Ashish Priyadarshi"
    ],
    "video_url": null,
    "description": "Dennis Rodman is one of the raunchiest men in NBA history, but even his experiences didn’t work all the time. Especially not the nights before NBA games. The Bulls legend made a name in the NBA for various reasons. He was notably known as the rebounding king of his time. It’s why he earned the… The post Having married himself to earn $10 million, Dennis Rodman once claimed how s*x the night before games ruined his performance appeared first on The SportsRush.",
    "content": "Dennis Rodman is one of the raunchiest men in NBA history, but even his experiences didn’t work all the time. Especially not the nights before NBA games. The Bulls legend made a name in the NBA for various reasons. He was notably known as the rebounding king of his time. It’s why he earned the nickname, ‘The Worm.’ His tough brand of defense and hustle stemmed from his time with the Detroit Pistons, known as the ‘Bad Boy Pistons.’ He helped the Bulls win three straight championships from 1995 to 1998 after Jordan recruited him. Jordan regularly played the Pistons during their peak, so he knew exactly what he would be getting with Rodman on the team. The Pistons routinely harassed Jordan to the point where they coined the ‘Jordan rules’, a physical style of play meant to neutralize the greatest player in NBA history. “The Last Dance” turned to Dennis Rodman, the “Bad Boys” Pistons of the late 1980s, the Jordan Rules and the continued turbulence early in the 1997-98 Bulls’ campaign.https://t.co/TJcC04CAYr — Sun-Times Sports (@suntimes_sports) April 27, 2020 Also Read: “LeBron James just mocked his own LeLiar personality”: Lakers star makes fun of his pathological lying while discussing LeRoy Butler’s Lambeau Leap Dennis Rodman discussed how scandalous experiments before games never worked for him Rodman’s career is defined more by his adventures outside the court than those on it, however. He was a wild man. Rodman loved partying, and he loved to have fun with women. However, for all his crazy stories, Rodman found his breaking point. Even the legendary Rodman had his limits. It was surprising for him, but in the end, he did come to a decision. He was talking to Mike Tyson on his show ‘Hotboxin’, when he said, “I’ve done this twice in my life playing sports and I never knew that this s**t will f**k with you when you’re playing the game.” What exactly was he referring to? “I’m trying to have s*x all night before the game. Doesn’t f****ng work out too well.” The routine affected his gameplay and his coach even had to talk to him to sort out the issues. “Why don’t you take a night off? I know what you did last night. You got weak knees right?” Rodman recalled his coach saying. Rodman married himself and earned a cool $10 million Dennis Rodman is a generally wild character, but there are some lengths he’ll go to that will amaze people. Once he even married himself, and the entire stunt netted him a massive profit. Dennis Rodman has a net worth of $500,000 right now, and he once tried to increase that immensely. In 1996, Rodman appeared at his book signing for ‘Bad as I wanna be’ in a bridal gown and a horse-drawn carriage. The whole thing was done to promote his book, and it worked. The book was a bestseller for several months, and in the end Rodman revealed that he earned $10 million from the entire thing. What a way to earn money, but of course, it’s only Rodman who could do something like this. Also Read: Charles Barkley, Who Lost $25,000 In A Golf Bet, Was Lambasted By Shaquille O’Neal For Lying To Barack Obama The post Having married himself to earn $10 million, Dennis Rodman once claimed how s*x the night before games ruined his performance appeared first on The SportsRush.",
    "pubDate": "2022-11-19 01:00:46",
    "image_url": null,
    "source_id": "thesportsrush",
    "country": [
      "united states of america",
      "united kingdom",
      "india",
      "australia"
    ],
    "category": [
      "sports"
    ],
    "language": "english"
  },
  {
    "title": "Nevada Dems: Midterms Show Why Nevada Should Start Primary",
    "link": "https://www.usnews.com/news/politics/articles/2022-11-18/nevada-dems-midterms-show-why-nevada-should-start-primary",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-19 00:58:14",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Ringleaders in Massive COVID Fraud Extradited to US",
    "link": "https://www.usnews.com/news/us/articles/2022-11-18/ringleaders-in-massive-covid-fraud-extradited-to-us",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-19 00:55:46",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "At CPAC Mexico, 'Orphaned' Right Tries to Build Home as Region Tacks Left",
    "link": "https://www.usnews.com/news/world/articles/2022-11-18/at-cpac-mexico-orphaned-right-tries-to-build-home-as-region-tacks-left",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-19 00:55:35",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Top 5 Altcoins Which May Undergo a 10x Rally in 2023!",
    "link": "https://coinpedia.org/altcoin/top-5-altcoins-which-may-undergo-a-10x-rally-in-2023/",
    "keywords": [
      "Altcoins",
      "Bitcoin",
      "Bitcoin Price",
      "Crypto news",
      "Cryptocurrency",
      "Price Analysis"
    ],
    "creator": [
      "Sahana Vibhute"
    ],
    "video_url": null,
    "description": "The post Top 5 Altcoins Which May Undergo a 10x Rally in 2023! appeared first on Coinpedia Fintech News Bitcoin price appears to be in hot waters right now as it has lost a significant amount of investor base and also the trust. The resulting volatility has compelled the investors to move out of the platform, which has caused a significant financial loss in recent times. Hence, market participants are now hunting for potential …",
    "content": "The post Top 5 Altcoins Which May Undergo a 10x Rally in 2023! appeared first on Coinpedia Fintech News Bitcoin price appears to be in hot waters right now as it has lost a significant amount of investor base and also the trust. The resulting volatility has compelled the investors to move out of the platform, which has caused a significant financial loss in recent times. Hence, market participants are now hunting for potential altcoins that may undergo a 10x rally. Below mentioned are the potential altcoins for 2023: Ethereum Ethereum is the second largest asset after Bitcoin, sharing a significant market cap with the crypto space. With the launch of ETH 2.0, the asset displayed enough strength to remain above the crucial support zones in times of bear markets. However, the current market conditions have driven the ETH price down, but with a slight change in the bearish market sentiments, the price may rebound nicely to revive the bullish trend. XRP XRP price had begun to gain traction within the market as the analysts and the influencers believed the crypto’s victory against the SEC could be imminent. Moreover, the asset’s value has been extensively bearish or stagnant for a prolonged period and hence is believed to rebound well when the lawsuit settles down. Therefore, the year 2023 could bring decent returns for the asset that may trigger many other cryptos. Binance Coin Binance Coin is the third largest cryptocurrency after Bitcoin & Ethereum, excluding stablecoins, which have maintained a decent rally from the beginning. The asset rose to new heights without any noise and currently manifests huge strength. Therefore, the BNB price is assumed to rise significantly in the coming days and lay down a firm upswing since the beginning of 2023. Dogecoin Dogecoin, despite losing a huge user base due to the unfamous market crash in 2021, maintained its dominance. Hence is trading within the top 10 cryptos according to the market capitalization. The asset is believed to rebound finely as the market conditions stabalize and quickly reclaim the lost levels. In 2023, the DOGE price is expected to maintain a significant upswing and rise higher. Polygon Polygon’s price has been incremental despite the bearish market sentiments and displays enough strength. The price presently appears to be strong and may resume with a firm upswing in the coming days. Once the MATIC price settles above $1, it may be easy for the asset to maintain a notable upswing in the coming days.",
    "pubDate": "2022-11-19 06:10:24",
    "image_url": null,
    "source_id": "coinpedia",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "How FTX acquired its position as the “most regulated” cryptocurrency exchange",
    "link": "https://insidebitcoins.com/news/how-ftx-acquired-its-position-as-the-most-regulated-cryptocurrency-exchange",
    "keywords": [
      "Cryptocurrency"
    ],
    "creator": [
      "Victor Alexander"
    ],
    "video_url": null,
    "description": "Before it failed this month, FTX distinguished itself from a number of competitors in the highly unregulated crypto business by claiming to be the “most [...]",
    "content": "Before it failed this month, FTX distinguished itself from a number of competitors in the highly unregulated crypto business by claiming to be the “most [...]",
    "pubDate": "2022-11-19 06:09:28",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Big Eyes Coin Falls Short Toon Finance Slaughters ICO Presale Stage One 2.75 MIL",
    "link": "https://coinpedia.org/press-release/big-eyes-coin-falls-short-toon-finance-slaughters-ico-presale-stage-one-2-75-mil/",
    "keywords": [
      "PRESS RELEASE"
    ],
    "creator": [
      "Coinpedia"
    ],
    "video_url": null,
    "description": "The post Big Eyes Coin Falls Short Toon Finance Slaughters ICO Presale Stage One 2.75 MIL appeared first on Coinpedia Fintech News ICO Presale Fun Toonie Takeover It has been an extremely busy year in the world of cryptocurrency. Over 300 million people now trade cryptocurrencies while daily transactions now easily surpass the $100bn mark. Unsurprisingly, a glut of new digital tokens has entered the market, taking the total number of unique cryptocurrencies to over 20,000 and …",
    "content": "The post Big Eyes Coin Falls Short Toon Finance Slaughters ICO Presale Stage One 2.75 MIL appeared first on Coinpedia Fintech News ICO Presale Fun Toonie Takeover It has been an extremely busy year in the world of cryptocurrency. Over 300 million people now trade cryptocurrencies while daily transactions now easily surpass the $100bn mark. Unsurprisingly, a glut of new digital tokens has entered the market, taking the total number of unique cryptocurrencies to over 20,000 and counting in 2022. However, some perform better than others. While investors in any environment would gladly take a slice of good fortune, the digital assets that perform well are not determined by luck alone. Far from it. Right now, Big Eyes Coin is at real risk of being one of the year’s big losers while Toon Finance has emerged as one of the top assets to hold in 2023. Here’s why. Big Eyes Coin falls short Toon Finance leads With its cute kitty-based token, Big Eyes launched its pre-sale phase with high hopes of matching the success of DogeCoin and other popular meme coins but with almost instant results at launch. While the platform has yet to officially launch its BIG coin, signs of potential shortcomings have already emerged. At a glance, Big Eyes is doing fine. With 3589.74 BIG tokens equating to $1, the company has successfully raised over $9.7m of its $10,700,000.00 presale ICO target. Meanwhile, the token can be purchased through USD payments or popular digital currencies like ETH and BNB. Confirmation that it will be available on Uniswap is another positive development. Big Eyes is a DeFi economy that is powered by the Ethereum blockchain and delivers safe, fast, and decentralized transactions in an accessible, user-friendly, and innovative fashion. On the act of things, the opportunity to embrace a cute meme coin from launch stands out as an ideal introduction to crypto investments for new investors as well as a low-risk portfolio booster for experienced investors. However, when you scratch beneath the surface, Big Eyes Coin has already underperformed by failing to sell out its pre-sale allocation while even its $250 competition has yet to transform the fortunes of the token.  Big Eyes has brought some intrigue to the industry while the fluffy, cartoon images are equally as impressive as those used by the dog-related meme coins. However, a difficult year for DOGE and Shiba Inu – which has fallen from $0.000079 in late October 2021 to under $0.00001 – will undoubtedly cause concern regarding the long-term prospects of any meme coin. The market is recovering from the crash but global economic difficulties will inevitably cause hesitation from investors when it comes to acting purely on speculation. In a world where information is available at our fingertips, people rightly want to scrutinize investments to validate their choices. Furthermore, many analysts predict that a repeat of those exponential bull runs of 2021 simply cannot be repeated by coins that rely on novelty alone.  Ultimately, the potential of Big Eyes to spark some interest is clear, but the big question is “then what?”. The answer is, sadly, “nothing”. Aside from the fact that investments will contribute to the platform’s 5% charity donation, the BIG token is just a fun digital asset with no real purpose. There lies the problem. Toon Finance is set to combine novelty with function The ability of meme coins to attract investors and take crypto into the public consciousness has been a driving force in the new era of cryptocurrency investments. While the ship for novelty alone may have passed – especially when looking at the forecasts for BIG before it has even launched – it has shown the demand for accessibility as the appeal of investments continues to expand beyond blockchain supporters to a wide range of demographics. Another upcoming token currency in its pre-sale phase is Toon Finance. And by combining the novelty aspects with genuine long-term function, it looks set to enjoy a phenomenal 2023 with many analysts forecasting a major bull run shortly after its official launch on January, 1. Having only launched its pre-sale phase in the second week of October, Toon Finance has sold an impressive $2.75m worth of its native TFI coin. Moreover, its ICO has been included on CoinMarketCap, Crypto.com, and KuCoin. Interest in the digital token is further highlighted by the fact that it has become the most searched-for asset on CoinMarketCap. The fun cartoon mascots certainly capture the attention but the early success and long-term prospects of Toon Fi is primarily attributed to its function within the context of the Toon Finance metaverse. The P2E platform is geared towards gamers with the Space Battle Grounds arena allowing players to compete against other members of the growing community through a range of games. Lotteries and other fun initiatives ensure that the digital space will be a truly immersive experience for members. Toon Finance is technically a meme coin as it was named after a meme. However, the platform has a serious application and is about far more than its native token, but its success will surely open the door to significant growth. Having already outperformed Big Cat and TAMAdodge, which also had a positive start before losing some momentum, TFI is the hottest token due for an imminent release. New digital assets are the way to go in 2023 After a difficult 2022 for the crypto industry – as well as real-world investments – 2023 promises to be far more pleasing. Embracing ICOs and early launch investments could signal the perfect opportunity for investors to reach their short and long-term financial objectives. Not least because there is a chance to build a diverse portfolio thanks to the low purchase prices involved.  The landscape is changing as the top new digital tokens will combine the best features of meme coins with those of utility coins to provide genuine function. Whether ToonFi or other new tokens can emulate the boom of 2021 remains to be seen, but it is clear that there is a potential for huge ROIs. After seeing how quickly things can change, though, early investments will be the key to maximized returns. Once a prime candidate has been found, now is the time to join the party. The ICO Presale – What is it and should you participate? An ICO presale is a period of time before the main ICO event when a project sells tokens to strategic investors at a discounted price. This is usually done in order to raise funds to finance the main ICO event. If you’re thinking of participating in an ICO presale, there are a few things you should know. In this blog post, we’ll cover what an ICO presale is, how it works, and whether or not you should participate in one.  What is an ICO Presale?  An ICO presale (also sometimes called a private sale or pre-ICO) is a period of time before the main ICO event when a project sells tokens to strategic investors at a discounted price. This is usually done in order to raise funds to finance the main ICO event.  During an ICO presale, a project will offer tokens at a significantly lower price than they will during the main ICO event. For example, if the main ICO event price for 1 token is $1, the project might offer tokens during the presale at $0.50 each. The aim of this is to attract larger investors who are willing to commit more money upfront in exchange for a discount.  It’s important to note that not all projects hold an ICO presale – some only have a main ICO event. And not all projects that do have an ICO presale make it open to the public. In some cases, the presale may be invitation-only and only available to accredited investors.  How Does an ICO Presale Work?  If you’re interested in participating in an ICO presale, there are usually two ways you can go about it. The first is through an exchange and the second is directly through the project’s website.  If you choose to participate through an exchange, you’ll need to create an account and deposit funds into it. Once you’ve done that, you’ll be able to buy tokens during the ICO presale at the specified price.  Should You Participate in anICO Presale? Whether or not you should participate in anICO presale depends on a few factors. Firstly, do your research on the project and make sure you believe in its long-term viability. Secondly, consider whether or not you’re comfortable with taking on more risk – remember that as with any investment, there’s always a chance you could lose your money entirely. And finally, make sure you understand how much money you’re willing to invest and stick to that budget – don’t get caught up in FOMO (fear of missing out) and end up investing more than you can afford to lose!  Toon Finance / TFT Twitter / Toon Finance Telegram Disclaimer: This is a press release post. Coinpedia does not endorse or is responsible for any content, accuracy, quality, advertising, products, or other materials on this page. Readers should do their own research before taking any actions related to the company.",
    "pubDate": "2022-11-19 06:07:51",
    "image_url": null,
    "source_id": "coinpedia",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Monero: Shame On Cardano IOG For Launching Privacy Blockchain",
    "link": "https://thecryptobasic.com/2022/11/19/monero-shame-on-cardano-iog-for-launching-privacy-blockchain/?utm_source=rss&utm_medium=rss&utm_campaign=monero-shame-on-cardano-iog-for-launching-privacy-blockchain",
    "keywords": [
      "Market",
      "ADA",
      "Altcoins",
      "Cardano",
      "Monero"
    ],
    "creator": [
      "Mark Brennan"
    ],
    "video_url": null,
    "description": "Monero Slams IOG’s Data Privacy Blockchain. Monero has slammed Input Output Global’s data protection blockchain, deriding the idea that it has a backdoor for regulators, in a tweet today. “Use Cardano Midnight if you want to use a ‘privacy’ blockchain with a backdoor,” Monero wrote. It asserts that Monero remains the preferred option for users […] The post Monero: Shame On Cardano IOG For Launching Privacy Blockchain first appeared on The Crypto Basic.",
    "content": null,
    "pubDate": "2022-11-19 05:58:23",
    "image_url": null,
    "source_id": "thecryptobasic",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Bitcoin (BTC) Price Stuck in Rut: Here’s What Traders Can Expect This Weekend",
    "link": "https://coinpedia.org/bitcoin/bitcoin-btc-price-stuck-in-rut-heres-what-traders-can-expect-this-weekend/",
    "keywords": [
      "Bitcoin",
      "Bitcoin Price",
      "Crypto news",
      "Cryptocurrency",
      "Price Analysis"
    ],
    "creator": [
      "Delma Wilson"
    ],
    "video_url": null,
    "description": "The post Bitcoin (BTC) Price Stuck in Rut: Here’s What Traders Can Expect This Weekend appeared first on Coinpedia Fintech News The bankruptcy filing by the crypto exchange giant FTX has created a black hole in the crypto space as the market has lost billions of dollars due to the FTX crash. However, it may mark the birth of a fresh bullish start for the crypto market by Q1 of 2023 as it sets a new …",
    "content": "The post Bitcoin (BTC) Price Stuck in Rut: Here’s What Traders Can Expect This Weekend appeared first on Coinpedia Fintech News The bankruptcy filing by the crypto exchange giant FTX has created a black hole in the crypto space as the market has lost billions of dollars due to the FTX crash. However, it may mark the birth of a fresh bullish start for the crypto market by Q1 of 2023 as it sets a new goal for leading assets to bounce back to unexpected price levels. As the macro conditions of the traditional market improve, Bitcoin tends to fade its bottom levels by skyrocketing to a bullish territory.  Bitcoin To Ignore Its Consolidated Zone Soon! The crypto sector, which once promised the community and investors decentralization and trust, now has turned out to be a joke, ending up with authoritarianism after FTX’s demise. However, Bitcoin seems to continue its legacy and lead the market to the North as it aims to initiate an upward rally by next week. Trading View A well-known crypto analyst, Matthew Dixon, the CEO of Evai, predicts that Bitcoin may extend its current consolidation trend for the next few days. According to him, Bitcoin may break its ongoing consolidated price range if it exceeds the price level of $17K. He further predicts that BTC may form an upward triangle pattern in the price chart with two tops between the price range of $17.6K and $17.4K. Bitcoin may project itself with a smooth run to $19.5K if it surpasses its resistance at $17.6K by the next week. What Lies Ahead For Bitcoin? The FTX’s downfall is similar to previous bearish events like Mt Gox in 2014, and it may raise concerns about centralization and centralized exchanges. Hence, Bitcoin has a high chance of standing out as it works in a decentralized nature, forcing users to trust self-custodian wallets rather than centralized exchanges. Looking at the daily price chart, the Bitcoin market has reached a short-term consolidation range as the BTC price has been hovering around the $16K-$17K range from the last week. Bitcoin currently trades at $16.5K after it faced rejection again at $17K today.  The RSI-14 indicator has no sign of improvement as it continues to trend in an overselling zone of the 36-level. However, the MACD line seems to change its mood as it starts trading parallelly with the current trend without dropping further below its signal line. Bitcoin price is currently building a short-term momentum which may test an immediate support level at $16,350. If BTC fails to hold its price near $16K, it can soon aim for a breakout below its 23.6% Fib retracement, plunging hard to $14.5K. However, an upward retracement is expected if BTC makes a bullish reversal after testing the $16,350 support level. A breakout above its Bollinger band’s upper limit, which is near the EMA-20 trend line at $17.9K, may spark fresh surges in the price chart, and Bitcoin can next make an attempt to break its strong resistance at $20K.   ",
    "pubDate": "2022-11-19 05:53:56",
    "image_url": null,
    "source_id": "coinpedia",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Birmingham advances to City Open Division football final with rout of Banning",
    "link": "https://www.latimes.com/sports/highschool/story/2022-11-18/birmingham-advances-city-football-open-division-final-routing-banning",
    "keywords": null,
    "creator": [
      "Eric Sondheimer"
    ],
    "video_url": null,
    "description": "Peyton Waters leads the Patriots to a victory over the Pilots with two early touchdowns as Birmingham runs City Section winning streak to 33 games.",
    "content": "Peyton Waters leads the Patriots to a victory over the Pilots with two early touchdowns as Birmingham runs City Section winning streak to 33 games.",
    "pubDate": "2022-11-19 05:32:30",
    "image_url": "https://ca-times.brightspotcdn.com/dims4/default/dbf3401/2147483647/strip/true/crop/4800x3370+0+0/resize/1500x1053!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F40%2Ff1%2F59e3b6c04d70a62446759f36beaa%2F1216906-sp-birmingham-banning-football002-ls.jpg",
    "source_id": "latimes",
    "country": [
      "united states of america"
    ],
    "category": [
      "sports"
    ],
    "language": "english"
  },
  {
    "title": "'We caved': UCLA fails miserably in first test of season, losing to Illinois",
    "link": "https://www.latimes.com/sports/ucla/story/2022-11-18/ucla-loses-illinois-college-basketball",
    "keywords": null,
    "creator": [
      "Ben Bolch"
    ],
    "video_url": null,
    "description": "After starting slow, No. 8 UCLA takes the lead before No. 9 Illinois surges to erase a 15-point deficit, delivering the Bruins their first loss of the season.",
    "content": "After starting slow, No. 8 UCLA takes the lead before No. 9 Illinois surges to erase a 15-point deficit, delivering the Bruins their first loss of the season.",
    "pubDate": "2022-11-19 05:26:38",
    "image_url": "https://ca-times.brightspotcdn.com/dims4/default/78de128/2147483647/strip/true/crop/4000x2667+0+0/resize/1500x1000!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbd%2Fd8%2F0623569040c7b8368643dbf74847%2Fucla-illinois-basketball-79703.jpg",
    "source_id": "latimes",
    "country": [
      "united states of america"
    ],
    "category": [
      "sports"
    ],
    "language": "english"
  },
  {
    "title": "China's COVID-19 Restrictions Hit Historic Beijing Theater",
    "link": "https://www.usnews.com/news/health-news/articles/2022-11-18/chinas-covid-19-restrictions-hit-historic-beijing-theater",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-19 04:57:33",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Joel Embiid, Short-Handed 76ers Rally to Beat Bucks 110-102",
    "link": "https://www.usnews.com/news/sports/articles/2022-11-18/joel-embiid-short-handed-76ers-rally-to-beat-bucks-110-102",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-19 04:49:45",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "South Korea seizes $104M from Terra co-founder suspecting unfair profits",
    "link": "https://cointelegraph.com/news/south-korea-seizes-104m-from-terra-co-founder-suspecting-unfair-profits",
    "keywords": [
      "Terra",
      "Court",
      "Investigation",
      "Tokens"
    ],
    "creator": [
      "Cointelegraph By  Arijit Sarkar"
    ],
    "video_url": null,
    "description": "The decision to freeze Shin’s asset worth over $104 million was approved by the Seoul Southern District Court, which was based on a request from the prosecutors.",
    "content": "While crypto exchange FTX stole the limelight from other fallen ecosystems, South Korean authorities continue their efforts to bring closure to the victims of the year’s first crypto crash — Terraform Labs. Nearly six months after the Terra (LUNA) blockchain was officially halted , South Korean authorities froze approximately $104.4 million (140 billion won) from co-founder Shin Hyun-seong based on suspicion of unfair profits. The decision to freeze Shin’s asset worth over $104 million was approved by the Seoul Southern District Court, which was based on a request from the prosecutors. The claim related to Shin’s involvement in selling pre-issued Terra ( LUNA ) tokens to unwary investors. Based on suspicion of profiting from unwarranted LUNA sales, the district court froze the allegedly stolen funds until further investigations are underway, reported local news media YTN. “Reports that CEO Shin Hyun-seong sold Luna at a high point and realized profits or that he made profits through other illegal methods are not true,” Cointelegraph previously quoted Shin’s attorney . The preindictment preservation of the funds is a way of preventing bad actors from disposing of stolen funds and causing more financial damage or losses for the investors. Shin is currently being investigated by South Korean authorities on two charges — making unfair profits from issuing in-house tokens LUNA and TerraUSD (UST) and leaking customer transaction information of Chai — a Korean payment app linked to Terra — to Terraform Labs. On November 14, the South Korean prosecutors requested the accused co-founder appear in court as part of an investigation into the firm's collapse. Related: Terra Labs, Luna Guard commission audit to defend against allegations of misusing funds In the first week of November, the prosecutors accused Terra co-founder Do Kwon of manipulating Terra’s price. \"It's highly disappointing to see the Korean prosecutors continue to try to contort the Capital Markets Act to fit their agenda and push baseless claims. Prior judicial decisions and statements by the Korean financial authorities, including the FSC, establish that cryptocurrency tokens are not investment contract securities,\" said Terraform Labs spokesperson in a written statement to Cointelegraph.",
    "pubDate": "2022-11-19 04:45:00",
    "image_url": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTEvNDI0Y2RhM2YtMThjMi00NmRjLTgwNGQtYzQ5Y2I2OWY0NmE5LmpwZw==.jpg",
    "source_id": "cointelegraph",
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "title": "LTC Price Prediction – LTC Is Just Above $62, Will We See $64 Before Thanksgiving?",
    "link": "https://insidebitcoins.com/news/ltc-price-prediction-ltc-is-just-above-62-will-we-see-64-before-thanksgiving",
    "keywords": [
      "Cryptocurrency"
    ],
    "creator": [
      "Patrick Jennings"
    ],
    "video_url": null,
    "description": "Litecoin has increased 0.70% in the previous hour and is steadily climbing to $63.51. The value of Litecoin has climbed by 23.85% during the past [...]",
    "content": "Litecoin has increased 0.70% in the previous hour and is steadily climbing to $63.51. The value of Litecoin has climbed by 23.85% during the past [...]",
    "pubDate": "2022-11-19 12:49:37",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Former FTX CEO, Sam Bankman-Fried Cashed Out $300M to Buy Rival Binance’s Stake!",
    "link": "https://coinpedia.org/news/former-ftx-ceo-sam-bankman-fried-cashed-out-300m-to-buy-rival-binances-stake/",
    "keywords": [
      "News",
      "Altcoins",
      "Bitcoin",
      "Crypto news",
      "Cryptocurrency"
    ],
    "creator": [
      "Sahana Vibhute"
    ],
    "video_url": null,
    "description": "The post Former FTX CEO, Sam Bankman-Fried Cashed Out $300M to Buy Rival Binance’s Stake! appeared first on Coinpedia Fintech News Ever since the FTX series has been playing within the crypto space, the participants are witnessing fresh new episodes every day. Recently, the exchange was reportedly “hacked” and more than $600 million in funds were squeezed out. Meanwhile, many believed it was the job of an insider as the stolen funds were quickly converted into …",
    "content": "The post Former FTX CEO, Sam Bankman-Fried Cashed Out $300M to Buy Rival Binance’s Stake! appeared first on Coinpedia Fintech News Ever since the FTX series has been playing within the crypto space, the participants are witnessing fresh new episodes every day. Recently, the exchange was reportedly “hacked” and more than $600 million in funds were squeezed out. Meanwhile, many believed it was the job of an insider as the stolen funds were quickly converted into Ethereum & stablecoins. In a fresh update, SBF has reportedly received a portion of $420 million in funds into his personal account. FTX raised $420 million in funding in October last year to improve the user experience and be more in line with regulators. Interestingly, nearly 75% of the total amount was sent to SBF. The October 2021 funding round valued FTX exchange at $25 billion and raised money from investors like BlackRock, Tiger Global, and Singapore’s sovereign wealth fund Temasek & Sequoia Capital. Later, after a couple of months, some of these investors helped raise $400 million for FTX’s subsidiary at an $8 billion valuation. During the time funds were raised, the crypto markets were booming and the Alameda was highly profitable. While it is still unclear what SBF did with the $300 million, whether it was poured back to FTX or kept separate, Meanwhile, FTX’s 2021 audited financial statements said the money was being reserved by the company for ‘operational expediency’ on behalf of the related party.",
    "pubDate": "2022-11-19 12:43:27",
    "image_url": null,
    "source_id": "coinpedia",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "US Financial Industry Plans To Investigate Crypto Firms’ Communications",
    "link": "https://insidebitcoins.com/news/us-financial-industry-plans-to-investigate-crypto-firms-communications",
    "keywords": [
      "Cryptocurrency"
    ],
    "creator": [
      "Patrick Jennings"
    ],
    "video_url": null,
    "description": "To say that the finance market has been put inside the shredder over the past few days would be an understatement. Bitcoin barely stands on [...]",
    "content": "To say that the finance market has been put inside the shredder over the past few days would be an understatement. Bitcoin barely stands on [...]",
    "pubDate": "2022-11-19 12:38:00",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Your Weekend Reading: The ‘Unprecedented’ Failure of FTX",
    "link": "https://www.bloomberg.com/news/newsletters/2022-11-19/bloomberg-weekend-reading-the-unprecedented-failure-of-ftx",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-19 12:30:06",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "CHZ Chiliz Price Soars 11% – Time To Buy CHZ Before the World Cup Kicks Off?",
    "link": "https://insidebitcoins.com/news/chz-chiliz-price-soars-11-time-to-buy-chz-before-the-world-cup-kicks-off",
    "keywords": [
      "Cryptocurrency"
    ],
    "creator": [
      "Prateek Arora"
    ],
    "video_url": null,
    "description": "There are two significant events simultaneously happening in the world. On the one hand, the entire cryptocurrency market is down, and on the other hand, [...]",
    "content": "There are two significant events simultaneously happening in the world. On the one hand, the entire cryptocurrency market is down, and on the other hand, [...]",
    "pubDate": "2022-11-19 12:29:17",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Ethereum (ETH) Price Analysis for November 19",
    "link": "https://u.today/ethereum-eth-price-analysis-for-november-19",
    "keywords": null,
    "creator": [
      "Denys Serhiichuk"
    ],
    "video_url": null,
    "description": "Has Ethereum (ETH) found local support level yet?",
    "content": null,
    "pubDate": "2022-11-19 12:25:00",
    "image_url": null,
    "source_id": "utoday",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Sam Bankman-Fried’s Lawyer, Paul Weiss, Dropped Him As A Client",
    "link": "https://crypto-academy.org/paul-weiss-dropped-sbf-as-a-client/",
    "keywords": [
      "News"
    ],
    "creator": [
      "Rea K."
    ],
    "video_url": null,
    "description": "Paul Weiss, Sam Bankman-Fried’s lawyer, said on Friday that is has ceased representing SBF, the beleaguered cryptocurrency magnate, due to conflicts of interest. Former CEO of the insolvent cryptocurrency exchange FTX, Bankman-Fried, is losing the firm’s support because, according to the platform’s US attorneys, he is interfering with restructuring efforts by “incessant and disruptive tweeting.” […] The post Sam Bankman-Fried’s Lawyer, Paul Weiss, Dropped Him As A Client appeared first on Crypto Academy.",
    "content": "Paul Weiss, Sam Bankman-Fried’s lawyer, said on Friday that is has ceased representing SBF, the beleaguered cryptocurrency magnate, due to conflicts of interest. Former CEO of the insolvent cryptocurrency exchange FTX, Bankman-Fried, is losing the firm’s support because, according to the platform’s US attorneys, he is interfering with restructuring efforts by “incessant and disruptive tweeting.” “We informed Mr. Bankman-Fried several days ago, after filing the FTX bankruptcy, that conflicts have arisen that precluded us from representing him,” said Paul Weiss.  Regulators from the United States and other countries are now looking into FTX after its value fell last week. On November 11, the platform filed for Chapter 11 bankruptcy. Paul Weiss no longer represents Bankman-Fried.  The day before FTX filed for Chapter 11 bankruptcy, SBF resigned as CEO of the company. John J. Ray, a restructuring attorney, is leading the company. He previously managed the liquidation of Enron Corp. Sullivan & Cromwell, a Wall Street law firm, has been hired by FTX as outside legal assistance in bankruptcy proceedings and criminal investigations.  The exchange contacted the legal firm as its liquidity problem grew “increasingly grave,” according to court documents. According to FTX and its extensive network of affiliated businesses, which includes trading firm Alameda Research, its assets and liabilities are between $10 billion and $50 billion.  Bankman-Fried’s assets, which were previously valued at $16 billion, have been destroyed.  A class action lawsuit against Bankman-Fried and numerous famous exchange promoters was also filed on Thursday, accusing them of engaging in fraud against “unsophisticated investors.”  On behalf of investors, the Moskowitz Law Firm and Boies Schiller filed a case alleging that Bankman-Fried violated U.S. securities laws and caused approximately $11 billion in damages. Bankman-Fried’s legal representation has not yet filed an appearance in that Miami federal court case. The post Sam Bankman-Fried’s Lawyer, Paul Weiss, Dropped Him As A Client appeared first on Crypto Academy.",
    "pubDate": "2022-11-19 12:12:20",
    "image_url": null,
    "source_id": "cryptoacademy",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Ripple Sets it Sights on Ireland Amid Ongoing SEC Battle",
    "link": "https://cryptodaily.co.uk/2022/11/ripple-sets-it-sights-on-ireland-amid-ongoing-sec-battle",
    "keywords": null,
    "creator": [
      "Jana Serfontein"
    ],
    "video_url": null,
    "description": "Amid its ongoing battle with the United States Securities and Exchange Commission (SEC), Ripple has announced that it is seeking to expand its presence in the European Union (EU). In an interview with CNBC earlier this week, Stuart Alderoty, General Counsel for Ripple, said that “effectively, Ripple is operating outside of the U.S.” as it stands due to its ongoing legal woes with the SEC. He added: Essentially, its customers and its revenue are all driven outside of the U.S., even though we still have a lot of employees inside of the U.S. Whilst it patiently awaits the outcome of its lawsuit, Ripple is planning to expand its presence in Europe. The firm already has two employees working on the ground in the Republic of Ireland and is seeking a virtual asset service provider (VASP) license from the Irish Central Bank so that it can “passport” its offerings throughout the EU via an entity based there. The company also plans to file an application for an electronic money license in the country “shortly.” Alderoty said that he expects a ruling on the case against Ripple which has been going on since 2020 very soon, adding that “we are at the beginning of the end of the process in our case.”. The SEC filed a lawsuit against the company alleging that the firm and its executives illegally sold XRP tokens, a cryptocurrency created in 2012 by the firm’s founders, to investors without first registering the token as a security. The company denies claims that XRP is a security, arguing that the token should not be considered an investment contract and is used in its business to facilitate cross-border transactions between banks and financial institutions. Ripple Plans to Expand in Anticipation of MiCA Ripple’s plans to expand into the EU are driven by anticipation of the zone’s Markets in Crypto Assets (MiCA) regulations coming into effect within a few years. The regulatory framework was passed by EU lawmakers earlier in the year and seeks to align rules regarding crypto assets across the region. Beyond the EU, Ripple has also made the United Kingdom a priority by releasing a white paper with a set of guidelines outlining how it thinks Britain should regulate cryptocurrencies. Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.",
    "content": "Amid its ongoing battle with the United States Securities and Exchange Commission (SEC), Ripple has announced that it is seeking to expand its presence in the European Union (EU). In an interview with CNBC earlier this week, Stuart Alderoty, General Counsel for Ripple, said that “effectively, Ripple is operating outside of the U.S.” as it stands due to its ongoing legal woes with the SEC. He added: Essentially, its customers and its revenue are all driven outside of the U.S., even though we still have a lot of employees inside of the U.S. Whilst it patiently awaits the outcome of its lawsuit, Ripple is planning to expand its presence in Europe. The firm already has two employees working on the ground in the Republic of Ireland and is seeking a virtual asset service provider (VASP) license from the Irish Central Bank so that it can “passport” its offerings throughout the EU via an entity based there. The company also plans to file an application for an electronic money license in the country “shortly.” Alderoty said that he expects a ruling on the case against Ripple which has been going on since 2020 very soon, adding that “we are at the beginning of the end of the process in our case.”. The SEC filed a lawsuit against the company alleging that the firm and its executives illegally sold XRP tokens, a cryptocurrency created in 2012 by the firm’s founders, to investors without first registering the token as a security. The company denies claims that XRP is a security, arguing that the token should not be considered an investment contract and is used in its business to facilitate cross-border transactions between banks and financial institutions. Ripple Plans to Expand in Anticipation of MiCA Ripple’s plans to expand into the EU are driven by anticipation of the zone’s Markets in Crypto Assets (MiCA) regulations coming into effect within a few years. The regulatory framework was passed by EU lawmakers earlier in the year and seeks to align rules regarding crypto assets across the region. Beyond the EU, Ripple has also made the United Kingdom a priority by releasing a white paper with a set of guidelines outlining how it thinks Britain should regulate cryptocurrencies. Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.",
    "pubDate": "2022-11-19 12:10:09",
    "image_url": "http://cryptodailycdn.ams3.cdn.digitaloceanspaces.com/ripple-sec-1450-1.jpg",
    "source_id": "cryptodaily",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "What to know about Sam Bankman-Fried, FTX's embattled founder",
    "link": "https://abcnews.go.com/Business/sam-bankman-fried-ftxs-embattled-founder/story?id=93499631",
    "keywords": [
      "Business"
    ],
    "creator": null,
    "video_url": null,
    "description": "The crypto star Sam Bankman-Fried faces scrutiny after the collapse of his $32 billion company.",
    "content": null,
    "pubDate": "2022-11-19 12:09:27",
    "image_url": "https://s.abcnews.com/images/Business/sam-bankman-fried-file-gty-jef-221118_1668808116954_hpMain_16x9_992.jpg",
    "source_id": "abcnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Good morning, Thunder Bay!",
    "link": "https://www.tbnewswatch.com/good-morning-thunder-bay/good-morning-thunder-bay-6125613",
    "keywords": null,
    "creator": [
      "TBnewsWatch.com Staff"
    ],
    "video_url": null,
    "description": "Here's a look at the current local weather and gas prices.",
    "content": null,
    "pubDate": "2022-11-19 12:00:00",
    "image_url": "https://www.vmcdn.ca/f/files/tbnewswatch/images/goodmorning/november-2022/salminen2211152.jpg;w=960",
    "source_id": "tbnewswatch",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "1,100,000 Ethers (ETH) Withdrawn From Exchanges Since Nov. 12",
    "link": "https://u.today/1100000-ethers-eth-withdrawn-from-exchanges-since-nov-12",
    "keywords": null,
    "creator": [
      "Vladislav Sopov"
    ],
    "video_url": null,
    "description": "Nansen analysts shared list of exchanges that witnessed positive net inflow of crypto since FTX/Alameda drama",
    "content": null,
    "pubDate": "2022-11-19 18:30:00",
    "image_url": null,
    "source_id": "utoday",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "FIFA Boss Gives The World More Reason To Ignore Soccer In Qatar",
    "link": "https://time.com/6235332/infantino-fifa-qatar-world-cup/",
    "keywords": [
      "Uncategorized"
    ],
    "creator": [
      "Sean Gregory"
    ],
    "video_url": null,
    "description": "FIFA president Gianni Infantino lashed out at Western critics of the Qatar World Cup—sparking more controversy on the eve of the event",
    "content": "On the eve of signature sporting events, athletic administrators often address the media, as a sort of “state-of-the-union” affair to address a league’s accomplishments and concerns. Before the Super Bowl and NBA Finals, for example, commissioners of the NFL and NBA speak to the press, take some questions from reporters, and either offer direct answers or spin as they see fit. It’s an almost ceremonial exercise. The goal: mollify the media before everyone moves onto the big games. On Saturday in Doha, FIFA president Gianni Infantino offered a new twist on this ritual. Instead of ushering in the Qatar World Cup, which begins on Sunday, Infantino gave an extraordinary speech, full of grievances about media examinations of the host country’s human rights record, whataboutism, and what can best be described as an awkward attempt to compare his personal backstory to disenfranchised populations across the globe. (At worst, his remarks were highly offensive). [time-brightcove not-tgx=”true”] Infantino badly conflated examination with provocation. CNN labeled the speech an “explosive tirade.” If anything, the immediate negative response to Infantino’s press conference shined further light on the problems surrounding this 2022 World Cup, and undercut his own plea to keep the focus on football, to stick to sports. Infantino scored a spectacular own-goal for his own World Cup. Near the beginning of his sprawling hour-long address, Infantino said, “Today I feel Qatari. Today I feel Arabic. Today I feel African. Today I feel gay. Today I feel disabled. Today I feel (like) a migrant worker. “Of course I am not Qatari, I am not an Arab, I am not African, I am not gay, I am not disabled. But I feel like it, because I know what it means to be discriminated, to be bullied, as a foreigner in a foreign country. As a child I was bullied – because I had red hair and freckles, plus I was Italian so imagine.” Infantino grew up in Switzerland. He said he feels like a migrant worker. Infantino made a $3.2 million in 2019. “What do you do then?” Infantino said. “You try to engage, make friends. Don’t start accusing, fighting, insulting, you start engaging. And this is what we should be doing.” (READ MORE: Meet The 22-Year-Old Star Who Could Make Team USA A World Cup Contender) Summoning the familiar whatabout deflection to which we’ve become all too accustomed in political discourse, Infantino suggested that Western countries were in no position to criticize Qatar, given the human rights shortcomings in Europe and elsewhere. “We have told many, many lessons from some Europeans, from the western world,” Infantino said. “I think for what we Europeans have been doing the last 3,000 years we should be apologizing for next 3,000 years before starting to give moral lessons to people.” True, every nation is far from perfect. But Infantino seemed to forget that he leads an organization that was embroiled in a bribery scandal when it awarded the World Cup to Qatar in 2010. (Though Infantino was not head of FIFA at the time). That thousands of migrant workers have died in Qatar over the past decade, many because of poor working conditions made more perilous by excessive heat. That FIFA made a conscious decision to hold a World Cup in Qatar. Questions are more than fair game. For Infantino to suggest criticism of Qatar is “just hypocrisy” could not be more hypocritical. Infantino also looked to the disabled population to make his case for media hypocrisy. “I was at an event a few days ago when we explained what we’re doing at this World Cup for disabled people,” Infantino said. He noted that there were around 400 journalists at his press conference on Saturday, but just four at that event. ‘There [are] one billion disabled people in the world,” he said. “One billion disabled people. Nobody cares.” Infantino summoned some self-pity for FIFA, an organization that has earned none. “It’s not easy, everyday and everyday to read all these critics,” he said. He also lectured the press on how they should do their job going forward. “If you need to criticize somebody, don’t criticize the players,” Infantino said. “Don’t put pressure on the players, don’t put pressure on the coaches. Let them concentrate on making their fans happy.” His words were met with swift condemnation. Nicholas McGeehan, director of FairSquare, a non-profit human rights organization, called Infantino’s speech “crass.” “In brushing aside legitimate human rights criticisms, Gianni Infantino is dismissing the enormous price paid by migrant workers to make his flagship tournament possible – as well as FIFA’s responsibility for it,” Steve Cockburn, Amnesty International’s Head of Economic and Social Justice, said in a statement. “Demands for equality, dignity and compensation cannot be treated as some sort of culture war – they are universal human rights that FIFA has committed to respect in its own statutes.” Infantino did announce that FIFA would start a legacy fund to follow this World Cup. “This cannot be mere window dressing, however,” said Cockburn. “If FIFA is to salvage anything from this tournament, it must announce that it will invest a significant part of the $6 billion the organization will make from this tournament and make sure this fund is used to compensate workers and their families directly.” Let’s hope Infantino’s actions after the World Cup rank better than his performance before it. (READ MORE: Your Complete Guide To The US National Team At The 2022 World Cup In Qatar)",
    "pubDate": "2022-11-19 18:14:16",
    "image_url": null,
    "source_id": "timenextadvisor",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Florence + The Machine postpone touring after Florence Welch breaks her foot",
    "link": "https://www.avclub.com/florence-the-machine-postpone-tour-after-florence-wel-1849805150",
    "keywords": null,
    "creator": [
      "William Hughes"
    ],
    "video_url": null,
    "description": "An ongoing tour in the U.K. by Florence + The Machine has been postponed this morning, after lead singer Florence Welch revealed that she’d spent much of a concert in London last night dancing on a broken foot.Read more...",
    "content": null,
    "pubDate": "2022-11-19 18:08:00",
    "image_url": null,
    "source_id": "avclub",
    "country": [
      "united states of america"
    ],
    "category": [
      "entertainment"
    ],
    "language": "english"
  },
  {
    "title": "Ethereum Price Prediction for Today, November 19: ETH Hovers at $1,250",
    "link": "https://insidebitcoins.com/news/ethereum-price-prediction-for-today-november-19-eth-hovers-at-1250",
    "keywords": [
      "analysis",
      "Cryptocurrency",
      "ETH",
      "Ethereum",
      "Trading",
      "ETH/BTC",
      "ETH/USD",
      "Technical Analysis"
    ],
    "creator": [
      "Azeez Mustapha"
    ],
    "video_url": null,
    "description": "ETH Hovers at $1,250– November 19 Reactions of the ETH/USD trade sellers have led to an outlook that the crypto market hovers at the $1,250 [...]",
    "content": "ETH Hovers at $1,250– November 19 Reactions of the ETH/USD trade sellers have led to an outlook that the crypto market hovers at the $1,250 [...]",
    "pubDate": "2022-11-19 18:07:31",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "COP27 Climate Talks In Jeopardy As EU Ministers Threaten Walkout Over Weak Deal",
    "link": "https://www.benzinga.com/news/22/11/29795029/cop27-climate-talks-in-jeopardy-as-eu-ministers-threaten-walkout-over-weak-deal",
    "keywords": [
      "Climate Talks",
      "COP27",
      "Europe",
      "News",
      "Top Stories",
      "News",
      "Top Stories",
      "Benzinga"
    ],
    "creator": null,
    "video_url": null,
    "description": "World leaders have gathered for the 27th session of the Conference of the Parties (COP27) in Egypt to discuss the planet's future. read more",
    "content": null,
    "pubDate": "2022-11-19 18:01:03",
    "image_url": null,
    "source_id": "benzinga",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "PancakeSwap Will List ORY In December – Is Oryen Listing On WazirX, Binance, Or KuCoin After Its Presale?",
    "link": "https://coinpedia.org/press-release/pancakeswap-will-list-ory-in-december-is-oryen-listing-on-wazirx-binance-or-kucoin-after-its-presale/",
    "keywords": [
      "PRESS RELEASE"
    ],
    "creator": [
      "Coinpedia"
    ],
    "video_url": null,
    "description": "The post PancakeSwap Will List ORY In December – Is Oryen Listing On WazirX, Binance, Or KuCoin After Its Presale? appeared first on Coinpedia Fintech News Many cryptocurrency projects have recently struggled to raise prices to more desirable levels. However, Oryen (ORY), a new cryptocurrency with an ongoing presale, is breaking the trend. The project has commenced phase four of the presale with new records of 120% returns for early investors. At this rate, Oryen might become one of the market’s …",
    "content": "The post PancakeSwap Will List ORY In December – Is Oryen Listing On WazirX, Binance, Or KuCoin After Its Presale? appeared first on Coinpedia Fintech News Many cryptocurrency projects have recently struggled to raise prices to more desirable levels. However, Oryen (ORY), a new cryptocurrency with an ongoing presale, is breaking the trend. The project has commenced phase four of the presale with new records of 120% returns for early investors. At this rate, Oryen might become one of the market’s top cryptocurrencies once it lists on PancakeSwap, WazirX, Binance, and KuCoin, as rumored after the presale phase. Oryen (ORY) Oryen, the most intriguing cryptocurrency project on Binance Smart Chain, is currently in presale. Investing in this project allows token holders to get the most steady passive income. A fixed annual percentage yield (APY) of 90% is offered by Oryen, which is higher than the APYs of other staking protocols and remains constant regardless of market conditions. Oryen aims to automate and simplify staking while providing its users with high yields. Thus, it uses the Oryen Autostaking Technic (OAT), which enables immediate and secure auto-staking. Holders of ORY have nothing else to do than wait for their hourly rewards to land directly into their wallets. In addition, the project uses Risk-Free Value (RFV), a separate wallet that ensures the stability of the ORY price. It has a reserve to support and maintain constant reward payouts during challenging market periods. PancakeSwap PancakeSwap is one of the biggest decentralized exchanges and a household name on the Binance Smart Chain. It will be Oryen’s first step to list on the DEX on the 30th of December before it potentially lists on any centralized exchange afterward. WazirX (WRX) WazirX is the largest and fastest-growing cryptocurrency exchange in India. Under the umbrella of Binance, it offers INR trading pairs for more than 200 crypto assets. Reportedly, Oryen’s team is currently approaching the exchange in anticipation of its launch in late December. This move would open ORY to a vast market of more than 100 million Indian investors. The Bottom Line Oryen is surpassing investors’ expectations with an astonishing 120% price increase since the presale started. Moreover, the rumored exchange listings might give the staking platform the powder it needs to enter the realm of the top 100 cryptocurrencies. Learn More Here Join Presale: https://presale.oryennetwork.io/registerWebsite: https://oryennetwork.io/ Disclaimer: This is a press release post. Coinpedia does not endorse or is responsible for any content, accuracy, quality, advertising, products, or other materials on this page. Readers should do their own research before taking any actions related to the company.",
    "pubDate": "2022-11-19 18:00:48",
    "image_url": null,
    "source_id": "coinpedia",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "President Biden’s Granddaughter Naomi Ties the Knot in White House Wedding",
    "link": "https://time.com/6235352/naomi-biden-wedding-granddaughter/",
    "keywords": [
      "Uncategorized"
    ],
    "creator": [
      "DARLENE SUPERVILLE / AP"
    ],
    "video_url": null,
    "description": "Naomi Biden and Neal exchanged “I do's” during a nippy late-morning ceremony",
    "content": "WASHINGTON — President Joe Biden ‘s granddaughter Naomi Biden and her fiance, Peter Neal, were married Saturday in just the 19th wedding in the history of the White House. Naomi Biden and Neal exchanged “I do’s” during a nippy late-morning ceremony — temperatures were in the low 40s — on the South Lawn, which was turned into a wedding venue for the very first time. It’s the first White House wedding with a president’s granddaughter as the bride. Scores of white folding chairs dotted a portion of the South Lawn, and the South Portico of the White House, facing the lawn and the Washington Monument in the distance, was decorated with wreaths and garland bearing white flowers. There was no tent. Guests began arriving hours before the ceremony, with some women opting for open-toed shoes despite the chill. [time-brightcove not-tgx=”true”] The public is seeing none of the festivities, unlike some past White House weddings. The bride and groom decided to keep journalists out, although the ceremony was outdoors on the grounds of what the president and first lady call the “people’s house.” Naomi Biden, 28, is a lawyer in Washington. Her parents are Hunter Biden, the son of the president and first lady Jill Biden, and Kathleen Buhle, Hunter’s first wife. Neal, 25, of Jackson Hole, Wyoming, recently graduated from the University of Pennsylvania law school. He works at Georgetown University Law Center in Washington. His parents are Drs. Mary C. and William “Bill” C. Neal of Jackson Hole. The couple, who have been living at the White House, was set up by a mutual friend about four years ago in New York City and have been together ever since, the White House said. Neal proposed in September 2021 near his childhood home in Jackson Hole with a ring that repurposed the band of his grandmother’s engagement ring, according to the White House. After the 20-somethings officially became husband and wife, their families and the wedding party were getting out of the cold and heading back inside the White House for lunch, which is to be followed in the evening by a dessert-and-dancing reception, according to a person familiar with the planning who was not authorized to publicly discuss the wedding schedule. Few other details were released before the ceremony. To accommodate public interest, the president and first lady planned to issue a statement and release photos after the first of their six grandchildren tied the knot, the White House said. President Biden and the first lady were among those who attended the wedding rehearsal dinner Friday at the Renwick Gallery steps from the White House. Neal’s parents hosted. The Biden family will pay for all wedding activities, White House officials have said. “The wedding of Naomi Biden and Peter is a private one,” Karine Jean-Pierre, the president’s chief spokesperson, said Friday. “It’s a family event and Naomi and Peter have asked that their wedding be closed to the media and we are respecting their wishes.” There have been 18 documented weddings in the 200-plus-year history of the White House. Nine involved a president’s daughter, most recently Richard Nixon’s daughter Tricia in 1971 and Lyndon Johnson’s daughter Lynda in 1967. But nieces, a grandniece, a son and first ladies’ siblings have also gotten married there. One president, Grover Cleveland, tied the knot at the White House, too, while in office. Some of the weddings were open to coverage by the news media, while others weren’t at all. Journalists were allowed into Tricia Nixon’s wedding to Ed Cox, the first wedding held in the Rose Garden. Her wedding planner — a three-ring black binder in the offices of the White House Historical Association — includes extensive notes on the media plan. But the May 1994 wedding of a brother of then-first lady Hillary Clinton and the daughter of then-U.S. Sen. Barbara Boxer — the first since Tricia Nixon’s marriage — was closed to the press. Clinton’s spokesperson commented afterward and the White House released a photo. It was the same for the October 2013 wedding of Pete Souza, President Barack Obama’s official photographer, and his longtime partner, Patti Lease. The White House announced the wedding in a statement following the small, private wedding in the Rose Garden. The White House Correspondents Association, which advocates for press access to the White House and the president, said it was “deeply disappointed” that the White House declined its request for press coverage of Naomi Biden’s wedding. “White House weddings have been covered by the press throughout history and the first family’s wish for privacy must be balanced against the public’s interest in an event occurring at the People’s House with the president as a participant,” the WHCA board said in a statement. Stewart McLaurin, president of the White House Historical Association, said it’s important to remember that first families are families first and foremost. “Their privacy should be respected, their wishes should be respected,” he said. The wedding is just one half of a big weekend for the Biden family. The president’s 80th birthday is Sunday and family members in town will celebrate him at a brunch hosted by the first lady.",
    "pubDate": "2022-11-19 17:55:18",
    "image_url": null,
    "source_id": "timenextadvisor",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "FTX's Sam Bankman-Fried Gave New Meaning To '420-69,' Taking Home $300M: Where Is It Now?",
    "link": "https://www.benzinga.com/markets/cryptocurrency/22/11/29791056/ftxs-sam-bankman-fried-gave-new-meaning-to-420-69-taking-home-300m-where-is-it-now",
    "keywords": [
      "Binance",
      "Changpeng Zhao",
      "Cryptocurrency",
      "Entertainment",
      "FTX",
      "Sam Bankman-Fried",
      "Topics",
      "Markets",
      "General",
      "Cryptocurrency",
      "Entertainment",
      "Topics",
      "Markets",
      "General",
      "Benzinga"
    ],
    "creator": null,
    "video_url": null,
    "description": "The shocking and appalling details of FTX’s collapse are still being uncovered, but new information issued by The Wall Street Journal shows that Sam Bankman-Fried cashed out 71.31% of a top-up to a series B funding round in 2021, taking home $300 million. read more",
    "content": null,
    "pubDate": "2022-11-19 17:34:10",
    "image_url": null,
    "source_id": "benzinga",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Body Language Expert Notices ‘Submissive’ Gestures Kate Middleton Displays With Actions Reminiscent of Princess Diana",
    "link": "https://www.cheatsheet.com/entertainment/body-language-expert-notices-submissive-gestures-kate-middleton-displays-actions-reminiscent-princess-diana.html/",
    "keywords": [
      "Entertainment",
      "Royal family",
      "Kate Middleton",
      "royal family"
    ],
    "creator": [
      "Michelle Kapusta"
    ],
    "video_url": null,
    "description": "Find out what a body language expert says Catherine, Princess of Wales does during outings that is \"reminiscent\" of what her mother-in-law Diana, Princess of Wales used to do.",
    "content": "<p>The new <a href=\"https://www.cheatsheet.com/entertainment/body-language-expert-explains-heckler-tried-make-kate-middleton-feel-helpless-refused-intimidated.html/\">Princess of Wales</a> (formerly <a href=\"https://www.cheatsheet.com/entertainment/shocking-video-kate-middleton-cursed-paparazzi-resurfaces-online.html/\">Kate Middleton</a>) made a solo visit recently to a Ukrainian Community Center where she spent time with refugees displaced by the war. And now her actions and mannerisms during that outing are being compared to her late <a href=\"https://www.cheatsheet.com/entertainment/the-heartbreaking-reason-kate-middleton-had-to-watch-princess-diana-videos-before-joining-the-royal-family.html/\">mother-in-law</a>‘s. </p> <p>Here’s what a body language expert had to say about Kate’s “submissive” gestures and what she does that is “reminiscent” of what <a href=\"https://www.cheatsheet.com/entertainment/rare-photos-of-princess-diana-with-long-hair.html/\">Princess Diana</a> used to do. </p> <figure class=\"wp-block-image size-full\"><img width=\"1200\" height=\"849\" src=\"https://www.cheatsheet.com/wp-content/uploads/2022/11/Photo-composite-image-a-comparison-of-Kate-Middleton-at-Sandurst-Military-Academy-and-Princess-Diana-a-Sandirngham-on-Christmas-Day.jpg\" alt=\"Photo composite image comparison of Kate Middleton at Sandhurst Military Academy and Princess Diana a Sandringham on Christmas Day\" class=\"wp-image-3265116\" srcset=\"https://www.cheatsheet.com/wp-content/uploads/2022/11/Photo-composite-image-a-comparison-of-Kate-Middleton-at-Sandurst-Military-Academy-and-Princess-Diana-a-Sandirngham-on-Christmas-Day.jpg 1200w, https://www.cheatsheet.com/wp-content/uploads/2022/11/Photo-composite-image-a-comparison-of-Kate-Middleton-at-Sandurst-Military-Academy-and-Princess-Diana-a-Sandirngham-on-Christmas-Day.jpg?w=640&h=453 640w, https://www.cheatsheet.com/wp-content/uploads/2022/11/Photo-composite-image-a-comparison-of-Kate-Middleton-at-Sandurst-Military-Academy-and-Princess-Diana-a-Sandirngham-on-Christmas-Day.jpg?w=768&h=543 768w, https://www.cheatsheet.com/wp-content/uploads/2022/11/Photo-composite-image-a-comparison-of-Kate-Middleton-at-Sandurst-Military-Academy-and-Princess-Diana-a-Sandirngham-on-Christmas-Day.jpg?w=1024&h=724 1024w, https://www.cheatsheet.com/wp-content/uploads/2022/11/Photo-composite-image-a-comparison-of-Kate-Middleton-at-Sandurst-Military-Academy-and-Princess-Diana-a-Sandirngham-on-Christmas-Day.jpg?w=85&h=60 85w, https://www.cheatsheet.com/wp-content/uploads/2022/11/Photo-composite-image-a-comparison-of-Kate-Middleton-at-Sandurst-Military-Academy-and-Princess-Diana-a-Sandirngham-on-Christmas-Day.jpg?w=150&h=106 150w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" /><figcaption>Photo composite image comparison of Kate Middleton at Sandhurst Military Academy and Princess Diana a Sandringham on Christmas Day | Tim Graham Photo Library via Getty Images</figcaption></figure> <h2 id=\"h-the-princess-demonstrated-submissive-gestures-during-visit\">The princess demonstrated ‘submissive’ gestures during visit</h2> <p>Prince William’s wife visited the Ukrainian Community Centre in Reading, England, on Nov. 17 to show her support for those displaced by the devastating war. The current Princess of Wales chatted with several families who had to flee their homeland following Russia’s invasion of Ukraine. </p> <p>Body language expert Darren Stanton analyzed footage from Kate’s visit and said she displayed several “submissive” gestures which indicated that she had a genuine interest in being there and supporting the Ukrainian families. </p> <p>Speaking on behalf of <a href=\"http://www.slingo.com/\" target=\"_blank\" rel=\"noreferrer noopener\">Slingo</a>, Stanton observed: “We saw Kate interacting with children by sitting at the table where they were coloring in leaning forward and lowering her height in a submissive gesture. It’s designed to build rapport with children because when someone is at their height they’re more inclined to think ‘this is someone like me’ as opposed to someone standing over them. </p> <p>“She also unconsciously raises her hand to a chin, this is what we call evaluation or analysis so it shows that she is deeply interested in what those she is interacting with are doing and saying, and also the fact she is authentic, it is not a contrived or deliberate action. The body language denotes she really wants to be there and she’s happy.”</p> <figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\"> <blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">The inspirational work of the Reading Ukrainian Community Centre is non-stop, and it’s changing lives!<br> <br>Providing practical advice on employment and housing, delivering educational classes for children and building social connections, the centre is at the heart of the community. <a href=\"https://t.co/tn1Vrk846L\">pic.twitter.com/tn1Vrk846L</a></p>— The Prince and Princess of Wales (@KensingtonRoyal) <a href=\"https://twitter.com/KensingtonRoyal/status/1593250839401230337?ref_src=twsrc%5Etfw\">November 17, 2022</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script> </div></figure> <p>Stanton added: “When she spoke to an older gentleman at the center, he had his hands behind his back in an authoritative gesture and she placed her hands in front of her. Once again this is a submissive gesture meaning she does not put herself above everyone else, she’s genuinely interested in participating, supporting, and assisting in any way she can.”</p> <h2>Expert says Kate’s body language is ‘reminiscent’ of Princess Diana’s</h2> <p>The expert also pointed out that the new Princess of Wales’ body language is “reminiscent” to that of the Princess of Wales before her. </p> <p>“The most poignant and significant part of Kate‘s body language is the fact that she is reminiscent of Princess Diana who would think nothing of hugging and sitting children on her knee, which is what Kate did on the visit. This again is not so much against Royal protocol but clearly the protocols have been relaxed and potentially revised. We would’ve never seen the Queen or Prince Philip sitting down with subjects and hugging children so again denoting the kind of monarchs William and Kate are going to be.”</p> <figure class=\"wp-block-image size-full\"><img loading=\"lazy\" width=\"1200\" height=\"852\" src=\"https://www.cheatsheet.com/wp-content/uploads/2022/11/Composite-image-comparison-between-Princess-Diana-in-Pakistan-and-Kate-Middleton-in-Malaysia-1.jpg\" alt=\"Composite image comparison between Princess Diana in Pakistan and Kate Middleton, who an expert says displays some of the same body language reminiscent of her mother-in-law, in Malaysia\" class=\"wp-image-3265093\" srcset=\"https://www.cheatsheet.com/wp-content/uploads/2022/11/Composite-image-comparison-between-Princess-Diana-in-Pakistan-and-Kate-Middleton-in-Malaysia-1.jpg 1200w, https://www.cheatsheet.com/wp-content/uploads/2022/11/Composite-image-comparison-between-Princess-Diana-in-Pakistan-and-Kate-Middleton-in-Malaysia-1.jpg?w=640&h=454 640w, https://www.cheatsheet.com/wp-content/uploads/2022/11/Composite-image-comparison-between-Princess-Diana-in-Pakistan-and-Kate-Middleton-in-Malaysia-1.jpg?w=768&h=545 768w, https://www.cheatsheet.com/wp-content/uploads/2022/11/Composite-image-comparison-between-Princess-Diana-in-Pakistan-and-Kate-Middleton-in-Malaysia-1.jpg?w=1024&h=727 1024w, https://www.cheatsheet.com/wp-content/uploads/2022/11/Composite-image-comparison-between-Princess-Diana-in-Pakistan-and-Kate-Middleton-in-Malaysia-1.jpg?w=85&h=60 85w, https://www.cheatsheet.com/wp-content/uploads/2022/11/Composite-image-comparison-between-Princess-Diana-in-Pakistan-and-Kate-Middleton-in-Malaysia-1.jpg?w=150&h=107 150w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" /><figcaption>Composite image comparison between Princess Diana in Pakistan and Kate Middleton in Malaysia | Tim Graham Photo Library via Getty Images, Chris Jackson/Getty Images</figcaption></figure> <p><strong>RELATED: <a href=\"https://www.cheatsheet.com/entertainment/kate-middleton-made-change-famous-engagement-ring-belonged-princess-diana.html/\">Kate Middleton Made a Change to Her Famous Engagement Ring That Belonged to Princess Diana</a></strong></p> <h2>Another expert also compared Kate’s body language to her mother-in-law’s</h2> <p>Another body language expert also noticed many similarities between the two women, especially around children.</p> <p>“Both women bend to the lowest crouch to greet small children, sitting on their own heels and offering total attention signals to make the children feel important and to create good connections,” Judi James told <a href=\"https://www.express.co.uk/life-style/life/1592334/princess-diana-kate-middleton-royal-tours-body-language-comparison\" target=\"_blank\" rel=\"noreferrer noopener\">Express</a>. “Both often use touch or hand-holding to retain the child’s attention while also offering reassurance. They both use facial expressions of concerned listening when necessary and can convert to a more playful, happy smile when appropriate.”</p> <p>While at the community center Kate held a 5-year-old girl on her lap who gave the princess a drawing that read: “Kate I love you.”</p>",
    "pubDate": "2022-11-19 17:32:00",
    "image_url": null,
    "source_id": "cheatsheet",
    "country": [
      "united states of america"
    ],
    "category": [
      "entertainment"
    ],
    "language": "english"
  },
  {
    "title": "USMNT stars of old recall first World Cup memories",
    "link": "https://www.espn.com/soccer/united-states-usa/story/4804991/usmnt-stars-of-old-recall-their-first-world-cup-memories?device=featurephone",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "With just one member of the USMNT having played in a World Cup before, ESPN asked players of the past to recall their first time in the tournament.",
    "content": null,
    "pubDate": "2022-11-19 17:28:38",
    "image_url": null,
    "source_id": "espn",
    "country": [
      "united states of america",
      "united kingdom",
      "india",
      "australia",
      "singapore",
      "canada"
    ],
    "category": [
      "sports"
    ],
    "language": "english"
  },
  {
    "title": "An official from the election commission works to set up a voting booth at the polling station a day ahead of the general elections, in Bhaktapur, Nepal November 19, 2022. REUTERS/Navesh Chitrakar",
    "link": "https://www.reuters.com/world/asia-pacific/nepalis-vote-amid-looming-inflation-political-stability-concerns-2022-11-20/",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-20 01:51:24",
    "image_url": null,
    "source_id": "reuters",
    "country": [
      "united states of america",
      "united kingdom",
      "india",
      "australia",
      "singapore",
      "saudi arabia",
      "canada"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Elon Musk reinstates Trump's Twitter account",
    "link": "https://www.cbsnews.com/news/elon-musk-says-donald-trump-reinstated-twitter/",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "Musk made the announcement after holding a poll that asked Twitter users to click \"yes\" or \"no\" on whether Trump's account should be reinstated.",
    "content": null,
    "pubDate": "2022-11-20 01:42:00",
    "image_url": "https://assets2.cbsnewsstatic.com/hub/i/r/2022/11/20/8cdfd578-4f94-4f8b-b727-c01f0265592d/thumbnail/60x60/dd7edcb76ce3d31cafec0e2ea9ce957e/gettyimages-1441801365.jpg",
    "source_id": "cbsnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "politics"
    ],
    "language": "english"
  },
  {
    "title": "Crypto Ponzi Scheme: Ohio Man Arrested For $10 Million Worth Of Scam",
    "link": "https://www.tronweekly.com/crypto-ponzi-scheme-ohio-man-arrested-for-10-m/",
    "keywords": [
      "Crypto Scam",
      "crypto scams",
      "DoJ",
      "Ponzi Scheme"
    ],
    "creator": [
      "Mishal Ali"
    ],
    "video_url": null,
    "description": "An Ohio man was arrested for allegedly running a Crypto Ponzi scheme, from which he raised at least $10 million from investors, according to a press release by the Department of Justice published on November 18th. As the allegations state, Rathnakishore Giri has been accused of deceiving investors by lying to them about his experience […]",
    "content": null,
    "pubDate": "2022-11-20 01:39:12",
    "image_url": null,
    "source_id": "tronweekly",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Japan's Minister for Internal Affairs and Communications Minoru Terada arrives at Prime Minister Fumio Kishida's official residence in Tokyo, Japan August 10, 2022.  REUTERS/Issei Kato/File Photo",
    "link": "https://www.reuters.com/world/asia-pacific/japan-pm-kishida-plans-sack-internal-affairs-minister-terada-yomiuri-2022-11-20/",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-20 01:25:18",
    "image_url": null,
    "source_id": "reuters",
    "country": [
      "united states of america",
      "united kingdom",
      "india",
      "australia",
      "singapore",
      "saudi arabia",
      "canada"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Elon Musk reinstates former President Donald Trump’s Twitter account",
    "link": "https://www.nbcnews.com/tech/tech-news/elon-musk-says-will-reinstate-former-president-donald-trumps-twitter-a-rcna54243",
    "keywords": null,
    "creator": [
      "David Ingram and Dennis Romero"
    ],
    "video_url": null,
    "description": "Twitter’s new owner, Elon Musk, announced Saturday that former President Donald Trump will be allowed to return to the social media platform, nearly two years",
    "content": null,
    "pubDate": "2022-11-20 01:19:44",
    "image_url": "https://media-cldnry.s-nbcnews.com/image/upload/rockcms/2022-10/221027-donald-trump-elon-musk-twitter-cs-0b8909.jpg",
    "source_id": "nbcnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "title": "Tamadoge Price Prediction for the 19th of November: TAMA Bulls Regroup At $0.0225",
    "link": "https://insidebitcoins.com/news/tamadoge-price-prediction-for-the-19th-of-november-tama-bulls-regroup-at-0-0225",
    "keywords": [
      "Altcoins",
      "analysis",
      "Blockchain",
      "Cryptocurrency",
      "DeFi",
      "Guides",
      "Opinion",
      "TAMA",
      "Tamadoge",
      "TAMAUSD"
    ],
    "creator": [
      "Azeez Mustapha"
    ],
    "video_url": null,
    "description": "Tamadoge buyers fail to withstand the massive pressure on the $0.023 support price. This makes them shift ground to the next lower support level. The regrouping [...]",
    "content": "buyers fail to withstand the massive pressure on the $0.023 support price. This makes them shift ground to the next lower support level. The regrouping of the bulls at $0.022 will give them the advantage to reclaim their ground in the market. pressure in the early part of today’s trading session, there were reactions on both the upper band and the lower band of the Bollinger indicator. This means bulls are still strong to drive the price upward. They are holding firmly to their new support price level. Now at around the latest trading sessions, we noticed the contraction of the upper and lower band of the indicator. This signals a bullish breakout as both the forces of demand and the forces of supply get evenly matched From this point of view, we can see that support level remains a strong brick wall. The bearish price continues to be rejected as several attempts were made to bring the price lower than this level. With such a strong support price level like this one, the price of TAMA is expected to have a strong bullish price breakout. The price is expected soon to hit $0.0024. Tamadoge has a fully transparent 10-year plan, and to achieve its goals, They have employed a seasoned development team to make sure they deliver on all its promises.",
    "pubDate": "2022-11-20 01:07:41",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Elon Musk weighs letting Trump return to Twitter - Axios",
    "link": "https://news.google.com/__i/rss/rd/articles/CBMiTmh0dHBzOi8vd3d3LmF4aW9zLmNvbS8yMDIyLzExLzE5L2Vsb24tbXVzay1kb25hbGQtdHJ1bXAtcmV0dXJuLXRvLXR3aXR0ZXItcG9sbNIBAA?oc=5",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "Elon Musk weighs letting Trump return to Twitter  AxiosElon Musk polls users on whether Donald Trump should be allowed to return to Twitter, millions swiftly respond  Fox BusinessElon Musk Reinstates Kathy Griffin On Twitter, Misspells Name; Comic Responds In Kind  DeadlineIn taking over Twitter, Elon Musk did get one thing right in bringing back balance  Gulf NewsAOC responds to Elon Musk's poll to reinstate Trump's Twitter, saying the 'last time he was here this platform was used to incite an insurrection'  msnNOWView Full Coverage on Google News",
    "content": null,
    "pubDate": "2022-11-20 01:04:18",
    "image_url": null,
    "source_id": "google",
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "title": "Chiliz Price Prediction for Today, November 19: CHZ/USD Faces November 8 Resistance",
    "link": "https://insidebitcoins.com/news/chiliz-price-prediction-for-today-november-19-chz-usd-faces-november-8-resistance",
    "keywords": [
      "Altcoins",
      "analysis",
      "Blockchain",
      "CHZ",
      "Cryptocurrency",
      "DeFi",
      "Guides",
      "Opinion",
      "Chiliz",
      "CHZUSD"
    ],
    "creator": [
      "Azeez Mustapha"
    ],
    "video_url": null,
    "description": "The Chiliz market went on a steep price dive on November 8 after the price hits $0.28. It was almost like a unanimous decision by [...]",
    "content": "The went on a steep price dive on November 8 after the price hits $0.28. It was almost like a unanimous decision by traders to take profits at the height of that price level. In two days the price decline hits $0.15. This was the support price level from where the market price began to rebound. Now as the price of the market nears the $0.28 price level, the price was rejected and in today’s market, the price goes the bullish way After a support level was secured at $0.15, the bull market faced rejection at $0.228. But because the force behind the trend is still strong, it resumed its upside journey until it came to $0.28. The bearish move in today’s market has a strong outlook. But its progress remains pegged at around the $0.25 price level. If the demand force behind the market trend remains strong as we have noticed in the previous session, the trend may continue. Today’s bearish market move is yet to cross the 20-day moving average. And the RSI line is yet to cross the signal line of the RSI indicator. Likewise in the MACD indicator, the MACD line is yet to cross the MACD signal line. There for, a bearish trend cannot be confirmed yet for the Chiliz market. We need to patiently wait to see the direction of the market in the next session. The day’s trading session opens with the failure of the buying pressure to advance the price beyond the November 8 resistance price level. A massive bearish move took place in the second trading session. But since the third session, it looks like the buyers have successfully secured a new support level at around $0.25 price level. The momentum of the selling pressure is waning at this level. Likewise (and more than the bullish performance of Chiliz) a new token still in its presale shows the prospect of much upside price performance. The collapse of FTX brings about a need for a cutting-edge trading intelligence platform, and that exactly is what offers. It is a platform that can adequately detect impending adverse issues similar to what happened to FTX and thus enabling investors and traders to pinpoint safe opportunities for good profits. The D2T token presale is ongoing and it has raised $6.5million so far.",
    "pubDate": "2022-11-20 01:03:56",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Musk to Restore Trump to Twitter After Holding Online Poll",
    "link": "https://www.usnews.com/news/business/articles/2022-11-19/musk-to-restore-trump-to-twitter-after-holding-online-poll",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-20 01:03:24",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Solana Price Prediction for November 19: SOL Falls Near $10",
    "link": "https://insidebitcoins.com/news/solana-price-prediction-for-november-19-sol-falls-near-10",
    "keywords": [
      "analysis",
      "Cryptocurrency",
      "SOL",
      "Solana",
      "Trading",
      "SOL/BTC",
      "SOL/USD",
      "Technical Analysis"
    ],
    "creator": [
      "Azeez Mustapha"
    ],
    "video_url": null,
    "description": "Solana Price Prediction – November 19 It has been that there has been a continuation in the SOL/USD market bulls’ pushing weight weaknesses as the [...]",
    "content": "It has been that there has been a continuation in the SOL/USD market bulls’ pushing weight weaknesses as the crypto coin falls near the $10 support line. The last several hours of trading have metamorphosed between $13.27 and $12.57, keeping a pace of minus 2.71 percentage rate as of the time of writing. Resistance levels: $20, $25, $30 Support levels: $10, $7.50, $5 The SOL/USD daily chart reveals the crypto market falls near the $10 support level in a range-bound style as the $20 resistance level is the upper range part. Two horizontal lines have to highlight the value lines where range motions are featured. The 14-day SMA indicator is $21.69, underneath the $30.89 value line of the 50-day SMA indicator. The Stochastic Oscillators have tightly conjoined to maintain a consolidation-moving posture in the oversold region at 13.95 and 14.15 levels, indicating there is a light myth that the former trading instrument will strive for a recovery soon. Prolongation of the market bulls’ weaknesses may potentially degenerate into giving bears more strength in the range-bound spots to push down below the $10 support level as the price falls near it. At this point, a 1-hour chart will let long-position placers detect an early stage of spotting the possibility of price making a rebound before joining the move from a baseline afterward. In terms of investment talk, this time could be the best period to add to portfolio sizes. On the downside of the technical analysis, as it is, it appears not to be the time to join an ongoing declining force in the range-bound spots of $20 and $10 of the SOL/USD market operations. A chain of lower lows has formed toward the lower range line. It does possess an ideal technical window opportunity for getting decent entries. It may as be highly psychologically inclining to exit some of the sell orders that might have executed below the $40 point or around the $30. In comparison, has deepened into lower range-bound spots below the trend lines of the SMAs. The 14-day SMA indicator is underneath the trend line of the 50-day SMA indicator. The Stochastic Oscillators are consolidating their presences in the oversold region at 12.60 and 12.28 levels to indicate that the base crypto may still witness some debase-moving pattern against the counter-trading crypto for a while. A bullish candlestick that can emerge from a lower zone will be a notification sign toward getting upswings to invalidate the continuation of the bearish trend. For now, the collapse of FTX brings about a need for a cutting-edge trading intelligence platform, and that exactly is what Dash 2 Trade offers. It is a platform that can adequately detect impending adverse issues similar to what happened to FTX, thus enabling investors and traders to pinpoint safe opportunities for good profits. The presale is ongoing and it has raised $6.5 million so far.",
    "pubDate": "2022-11-20 01:02:45",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Binance Coin Price Prediction Today, November 20, 2022: BNB/USD Struggles to Remains Above the $266 Support",
    "link": "https://insidebitcoins.com/news/binance-coin-price-prediction-today-november-20-2022-bnb-usd-struggles-to-remains-above-the-266-support",
    "keywords": [
      "BNB",
      "Cryptocurrency",
      "Trading",
      "Binance",
      "Technical Analysis"
    ],
    "creator": [
      "Azeez Mustapha"
    ],
    "video_url": null,
    "description": "Price movement in the BNB/USD market has been trading under the $290 price level for some time now. But interestingly, it has somehow stayed above [...]",
    "content": "Price movement in the BNB/USD market has been trading under the $290 price level for some time now. But interestingly, it has somehow stayed above [...]",
    "pubDate": "2022-11-20 05:35:20",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "BTC Price Prediction – Will It Break Above $17k This Weekend?",
    "link": "https://insidebitcoins.com/news/btc-price-prediction-will-it-break-above-17k-this-weekend",
    "keywords": [
      "Cryptocurrency"
    ],
    "creator": [
      "Patrick Jennings"
    ],
    "video_url": null,
    "description": "The year 2022 has been one of the most turbulent years for the global financial economy, including the crypto industry. With the crypto market already [...]",
    "content": "The year 2022 has been one of the most turbulent years for the global financial economy, including the crypto industry. With the crypto market already suffering the consequences of a severe bearish trend, things worsened further at the start of this year. As the world was recovering from the realities of the Covid industry, things worsened further with Russia’s invasion of Ukraine. All these factors significantly impacted Bitcoin’s performance in the market. It is surprising considering Bitcoin attained its all-time high value exceeding the $60k mark in just November last year. Unfortunately, the fall of FTX also resulted in adverse consequences for the token bringing its value down to a two-year low in recent times. But will BTC exceed the $17k mark this weekend? Continue reading to find out. If you have been keeping up with the developments in the crypto industry, you must have attended to the news about FTX’s collapse. The entire fiasco went on for a couple of weeks until recently, when FTX’s Sam Fried-Bankman had to file for Chapter 11 bankruptcy. As you know, FTX was one of the leading crypto exchanges operating in the market at the start of this year. The CEO of the exchange had, in fact, earned himself the reputation for being the savior of the industry. He did so by acquiring many other crypto projects that were suffering due to the bearish performance of the market. The good times for FTX went on for quite some time until a new report from CoinDesk spilled out all the beans in front of the world. The report featured a leaked balance sheet from Alameda Research, FTX’s trading company. The balance sheet brought forward many unanticipated truths that swept the crypto industry. The balance sheet highlighted that most of Alameda’s assets were FTT tokens, the native currency of the FTX exchange. This meant trouble since the CEO was using this asset holding as collateral for funding many risky projects. Following this revelation, Binance came into the picture with an announcement that it shall be liquidating all its FTT holdings. This struck fear among investors and traders, given Binance is by far one of the largest investors in the exchange. Consequently, people went into a mode of panic and started withdrawing funds from the exchange and selling all their FTT holdings. However, FTX decided to close down its withdrawal processing, which only worsened things. But things looked like they would change for good after Binance announced its plans to acquire FTX. Unfortunately, even this deal fell apart as even Binance could not handle the mess FTX had in its books. Quite a few officials from Binance even went on to call FTX’s books a black hole where one cannot make sense of almost anything. Following these developments, the FTX CEO, Sam Bankman Fried, filed for bankruptcy. Of course, Bitcoin is still the dominant player in the crypto market, and it has the potential to set trends in the crypto world. But that does not mean it is independent of all other developments in the industry. Following the collapse of FTX, almost every token in the market felt the heat, including Bitcoin. One of the primary rationales behind this is that people are now very reluctant in many ways and are somewhat wary about investing in cryptos. This evidently resulted in a huge drain of capital in the market, further deteriorating the overall aggravating situation. Hence, the collapse of FTX has had a direct or indirect impact on Bitcoin’s value. The recent developments in the crypto industry have devastatingly impacted Bitcoin’s overall valuation. Things went so bad so quickly that the token fell below the $18k mark after months and plunged into a new two-year low. However, as Bitcoin prices are picking up once again, things seem to change with each passing day. While the token has dabbled between low price ranges of $14k to 15k in the past couple of weeks, this week, Bitcoin reached over $16k after quite a long time. At the time of writing this, Bitcoin is priced at $16,665, and this has left many wondering if the token will break the $17k mark this weekend. There can be many factors fueling this rise, but the most important factor has something to do with the country of El Salvador. The president of the country, Nayib Bukele, recently announced they would be buying Bitcoins on a daily basis starting from the 17th of November. The country currently has 2,381 BTC worth a total investment of $39.4 million, down from $103 million due to recent developments. Following this, President Bukele declared the country would start buying more BTC every day starting from the 17th of November. This news came three months after the last BTC acquisition of the country. The stakeholders welcomed this move as it will put the demand and supply equation into play and change things for good. While Bitcoin started the day with a good announcement, the token’s price has remained the same. The best one can do now is wait for the weekend to be over and see if the token can break the $17k mark. The crypto world is volatile, and stakeholders are well aware of the nature of the market. Thus, it is never always possible to predict the future of a token since anything can change at any given time. But that does not mean you should stop investing in this market and go home. Instead, you must learn lessons from these developments and use these situations to your advantage. The collapse of FTX highlights the significance of more intelligent trading platforms like that will help one find the right opportunities and make the most of them. Besides that, there is with its native token, $TARO, ideal for beating the next price rise with its new $100k milestone. Also, is nearing its $2 million mark, while is nearing the staggering $13 million benchmark. This shows that the crypto industry is not short of opportunities as long as you can find the right one.",
    "pubDate": "2022-11-20 05:31:14",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "American CryptoFed registration at risk as SEC alleges filing anomalies",
    "link": "https://cointelegraph.com/news/american-cryptofed-registration-at-risk-as-sec-alleges-filing-anomalies",
    "keywords": [
      "DAO",
      "SEC",
      "United States",
      "Legislation"
    ],
    "creator": [
      "Cointelegraph By  Arijit Sarkar"
    ],
    "video_url": null,
    "description": "The SEC instituted administrative proceedings against American CryptoFed to determine the issuance of a stop order which would retract its registration and bar sales of in-house tokens, Ducat and Locke.",
    "content": "American CryptoFed DAO, the first decentralized autonomous organization (DAO) to get legal recognition in the United States, is at risk of losing its registration after the U.S. Securities and Exchange Commission (SEC) dug up anomalies in the Form S-1 registration statement dated Sept. 17, 2021. The Wyoming Secretary of State’s office recognized American CryptoFed as a legal entity in July 2021 , at a time when the organization’s CEO, Marian Orr, believed that “Wyoming is arguably the top blockchain jurisdiction in the world.” However, on Nov. 18, 2022, the SEC instituted administrative proceedings against the DAO to determine the issuance of a stop order. A stop order from the SEC would retract American CryptoFed’s registration and bar sales of in-house tokens, Ducat and Locke. According to the SEC’s Division Of Enforcement, the Form S-1 registration statement filed by American CryptoFed lacks vital information, such as audited financial statements and details about its business and management. The SEC further believed that the American CryptoFed filing contains “misleading statements and omissions” while being inconsistent in describing the tokens as securities. In this regard, David Hirsch, Chief of the Enforcement Division’s Crypto Assets and Cyber Unit stated that: Hirsch clarified that issuers must provide the required disclosure information to the SEC. However, the SEC claimed non-cooperation from American CryptoFed during its examination of its registration statement. Based on the information made available to the public, Hirsch shared SEC intent regarding the DAO: Cointelegraph found that the official Telegram channel for the DAO has been disabled. However, the deletion of the Telegram account was not yet linked to the SEC’s investigation at the time of writing. American CryptoFed has not yet responded to Cointelegraph’s request for comment. Related: US national crypto laws should look like New York’s, says state regulator The Securities Commission of the Bahamas (SCB) recently ordered the transfer of all digital assets of FTX Digital Markets (FDM) to a digital wallet owned by the commission. Securities Commission of The Bahamas Assumes Control of Assets of FTX Digital Markets Ltd. pic.twitter.com/IzW4PGZSJm The assets were seized “for safekeeping,” according to an official statement shared by the SCB.",
    "pubDate": "2022-11-20 05:31:00",
    "image_url": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTEvZWFmMjNlOTAtYTk0OS00NDQzLWIwNjctYTc5ZmMwMWUxMjZmLmpwZw==.jpg",
    "source_id": "cointelegraph",
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "title": "UNUS SED LEO Price Prediction Today, November 20, 2022: LEO/USDT Is Attracting Sellers",
    "link": "https://insidebitcoins.com/news/unus-sed-leo-price-prediction-today-november-19-2022-leo-usdt-is-attracting-sellers",
    "keywords": [
      "Altcoins",
      "Cryptocurrency",
      "Trading",
      "LEO/USDT",
      "Technical Analysis",
      "UNUS SED LEO"
    ],
    "creator": [
      "Azeez Mustapha"
    ],
    "video_url": null,
    "description": "Price activity in the LEO/USDT market has presented a successful upside retracement. Consequently, this has seen the crypto breaking above $4.157. But, unfortunately, this much [...]",
    "content": "Price activity in the LEO/USDT market has presented a successful upside retracement. Consequently, this has seen the crypto breaking above $4.157. But, unfortunately, this much success appears to be attracted selling. What can we expect in this market? Let’s take a closer look at activities and we’ll find out shortly. LEO’s current price: is $4.22 UNUS SED LEO’s market cap: $ 4.02 billion LEO circulating supply: 953.95 million LEO total supply: 985.23 million UNUS SED LEO Coinmarketcap ranking: #18 Top Level: $4.50, $4.80, $5.00 Base Levels: $4.22, $4.00, $3.90 UNUS SED LEO Price Prediction Today, November 20, 2022: LEO/USDT Stays Above 61.80 Fib Level has managed to stay above both the 9 and 21-day moving averages despite the commencement of selling in this market. The behavior of the Stochastic RSI is portraying, that the overall trend is still on. Consequently, this implies that the price may resume upside movement, going by the two technical indicators. Nevertheless, Traders will have to exercise a bit more patience to see if the price will find support at the 4.157 price level. This is because if this happens LEO’s price action may move further upwards. Progressing to the 4-hour LEO/USDT chart It could be seen that price action is battling selling pressure. This can be seen through the appearance of a tiny bearish price candles in the recent past trading sessions. However, bringing hope to the anticipated uptrend is the appearance of a green candlestick which represents the current trading period. This implies that buyers have the chance to further advance LEO’s price. Meanwhile, the RSI curves have taken to a downward path, but are still above the 70 levels. By implication, if buyers can exert a bit of pressure, fresh upside momentum may build up. Subsequently, this may see UNUS SED LEO the price move toward the $4.50 level. However, since bullish sentiment is necessary for any crypto to experience significant gains, Impact Token is one token with such characteristics. It is therefore necessary for traders to consider buying into this market. token presale is still live. This eco-friendly token is selling out quickly as it attracts more and more investors. $13 million has been raised so far in its presale. The collapse of FTX brings about a need for a cutting-edge trading intelligence platform, and that exactly is what offers. It is a platform that can adequately detect impending adverse issues similar to what happened to FTX, thus enabling investors and traders to pinpoint safe opportunities for good profits. The D2T token presale is ongoing and it has raised $6.5 million so far.",
    "pubDate": "2022-11-20 05:25:08",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Here’s Why The Top Crypto Gainers Have Held Firm for The Past 24 Hours",
    "link": "https://insidebitcoins.com/news/heres-why-the-top-crypto-gainers-have-held-firm-for-the-past-24-hours",
    "keywords": [
      "Cryptocurrency"
    ],
    "creator": [
      "Eric Dunne"
    ],
    "video_url": null,
    "description": "Less than a couple of weeks back, crypto suffered a market-wide crash where most cryptocurrencies fell massively in price, many showing a decline of over [...]",
    "content": "Less than a couple of weeks back, crypto suffered a market-wide crash where most cryptocurrencies fell massively in price, many showing a decline of over 30%. Bitcoin, for example, slipped by close to $5.5k and is barely making a recovery. Amidst the market downfall, triggered by the FTX balance sheet concerns, there were a few coins that were able to pull themselves up. Although nowhere near their price before the drop, these coins have performed certainly well in the past 24 hours. Unlike the market leader Bitcoin which has shown almost no signs of recovery in the past week. To understand how the top crypto gainers have held firm for the past 24 hours, we must examine the tokens and the sentiment around them that dictated their price. Here are a few top gainers that display some optimism in the market, along with a few cryptocurrencies that turn out to be an ideal choice for investors, given the current market condition. is a decentralized blockchain network that supports a range of applications while being a self-sustaining, secure and efficient blockchain throughout. Launched in 2019, the blockchain operates on Proof of Stake and has a native token by the ticker symbol ALGO. Following the crash that commenced on Nov 8, the token dropped from $0.40 to $0.26 and touched a low of $0.24 on Nov 14. Since the low, the ALGO token has shown an upward trend and is currently trading at $0.30, gaining close to 6% in the last 24 hours. In May, FIFA announced its partnership with Algorand making it an official blockchain platform of FIFA. This news sent a wave of excitement among investors, and as the world cup is about to start on Nov 20, investors are anticipating a positive performance from the coin. While the crypto crash imposed selling pressure on investors, the belief that Algorand’s association with reputable organizations will make it an appealing coin of choice in the long term has prevailed in the market. Owing to this, the coin continues to trace its path upwards, showing a decent increase in price in less than a day. If you’re familiar with the term metaverse, there’s very little chance that you haven’t heard about Sandbox is among the top metaverses in crypto, or in general for that matter, and is fundamentally among the most solid crypto tokens in the market. It is a decentralized NFT metaverse, where users can purchase, create and sell their virtual reality NFTs, or buy a plot of land inside the metaverse. The project has a lot of big names associated with it, with one being the popular hip-hop artist Snoop Dogg. The primary reason the coin has managed to recover from its price drop is that it’s been almost a couple of weeks since the crash took place, and the concerning sentiment across the crypto market is starting to fade off. Sandbox, being one of the best high-utility crypto projects, presents a great opportunity for new investors, more so because the token is now available at a discounted price. In addition to that, the price of the token is less than a dollar, making it highly accessible to all users. Given these characteristics, the project has attracted some attention in the last few days. Internet Computer offers a decentralized alternative to the current internet cloud providers, by allowing independent data centers to interact with each other. The platform allows users to create applications, websites and other web services. ICP has been cited as an “avoidable” crypto project when it comes to adding it to your portfolio, most because the token is down more than 99% since its launch, and has continued to trace a perpetual decline ever since. While the project has displayed a gain in the past 24 hours, mostly triggered by the daily cycle burn of its tokens- recorded to be the maximum this month. This in no way encourages investment in the project, given the long-term view isn’t as bright as it may appear to be. If you’re looking for cryptos that can offer exponential returns in the longer run, we have a few suggestions: It is clear from the FTX crash that there is a need for an advanced trading intelligence platform and is just the solution. The platform can help suggest investors’ safe choice of investments while making sure investors get above-market average returns from their investments. The platform integrates an on-chain analysis tool, and a social sentiment indicator and notifies users of new presales and launches, helping them assess potentially highly rewarding cryptocurrencies. The token for the platform D2C is currently in phase 3 of its presale and has raised over $6.6 million so far. Given such a high investment, the project comes out to be potentially one of the best rewarding crypto projects once it lists on an exchange. Blockchains are constantly criticized for their high energy usage, and the consequent environmental harm they impose. However, there’s a crypto project that aims to counteract the negative impact of crypto on the environment, by partnering with brands and helping them manage their carbon credits. When users shop with the brands associated with , they are rewarded with IMPT tokens which can be used to purchase carbon credits. Users can retire their Carbon credits in exchange for NFTs from popular artists or sell them as they see fit. As an investor, if you’re looking for a high-value crypto project, IMPT should be under your consideration. The presale for the token is currently live, and they’ve raised close to $13 million, more than halfway through their target for the presale. The play-to-earn ecosystem is said to thrive the most once crypto gaming becomes mainstream and Calvaria could potentially be among the top players ruling the industry. is a P2E game, played with NFT battle cards, where each card represents a character with a set of unique traits. With a combination of these cards, users advance in the game. Winners will be paid in RIA tokens, which can either be staked or can be used to make in-game purchases. Along with that, token holders also get the right to vote in the official DAO of the platform. The project is currently in phase 4 of its presale and has raised over 1.86 million USDT (roughly equal to the same in US dollars) so far. Investors willing to venture into the crypto play-to-earn ecosystem should consider IMPT as their choice of investment. Although all the tokens listed above have a low entry point and show a lot of potential, it’s best for investors to conduct their research before investing in a crypto project. With that being said, the coins mentioned above could potentially deliver exponential returns, as long as they follow their roadmap and receive continuous support from the community.",
    "pubDate": "2022-11-20 05:23:19",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Lucky Block V1 Price Prediction: Lucky Block V1 Found Support Above $0.0001460",
    "link": "https://insidebitcoins.com/news/lucky-block-v1-price-prediction-lucky-block-v1-found-support-above-0-0001460",
    "keywords": [
      "Cryptocurrency",
      "LuckyBlock",
      "Trading",
      "LBLOCK v1",
      "Lucky Block",
      "Technical Analysis"
    ],
    "creator": [
      "Azeez Mustapha"
    ],
    "video_url": null,
    "description": "Lucky Block V1: November 20, 2022 The bulls are remaining in control of price movements in the LBLOCK V1 Market. This can be seen as [...]",
    "content": "The bulls are remaining in control of price movements in the LBLOCK V1 Market. This can be seen as bullish price candle cues up above a key technical indicator line. Consequently, this is pointing to the fact that more upside price move. Lucky Block V1’s Price: $0.0001464 LBLOCK V1’s Market Capitalization: $5.99 Million Lucky Block V1’s Flowing Supply: 40.77 billion Lucky Block V1’s Total Supply: 99.6 billion LBLOCK’s Ranking on Coinmarketcap: #5128 Celling: $0.0001464, $0.0001500, $0.0001540 Floor: $0.0001440, $0.0001420, $0.0001400 On the market, the bulls seem to have been consistently winning for the past two trading sessions. Even this ongoing session is already in the court of the bulls, and as such price may go upwards. Likewise, the MACD continues to rise upwards from below the equilibrium point of the Moving Average Convergence Divergence indicator. Also, looking at the MACD we can see that the green histogram keeps growing above the 0.00 level. And this activity implies that bulls are gaining strength. Consequently, more upside push may soon be delivered to price action in the LBLOCK V1 market. Coming to the hourly market for , we can observe that price action in this market has encountered some downward pressure. This could be seen through the last price candle here. But, fortunately, the activities on the MACD seem to be offering upside hope to this market. Here, we can see that the lines of the MACD have crossed into the positive side of the indicator. And, despite the formation of the last price candle, these lines remain above this level. Consequently, we can project that price may continue its upward path toward $0.0001500. Also, since bullish sentiment is necessary for any crypto to experience significant gains, Impact Token is one token with such characteristics. It is therefore necessary for traders to consider buying into this market. token presale is still live. This eco-friendly token is selling out quickly as it attracts more and more investors. $13 million has been raised so far in its presale. The collapse of FTX brings about a need for a cutting-edge trading intelligence platform, and that exactly is what offers. It is a platform that can adequately detect impending adverse issues similar to what happened to FTX, thus enabling investors and traders to pinpoint safe opportunities for good profits. The D2T token presale is ongoing and it has raised $6.5 million so far. You can purchase Lucky Block here.",
    "pubDate": "2022-11-20 05:14:27",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Thunderwolves run out of gas, drop sixth straight",
    "link": "https://www.tbnewswatch.com/local-news/thunderwolves-run-out-of-gas-drop-sixth-straight-6130069",
    "keywords": null,
    "creator": [
      "Leith Dunick"
    ],
    "video_url": null,
    "description": "Lakehead took the lead in the third, only to have Laurier go on a 28-2 run to put the game out of reach.",
    "content": null,
    "pubDate": "2022-11-20 05:09:15",
    "image_url": "https://www.vmcdn.ca/f/files/tbnewswatch/images/local/thunderwolves-basketball/2022-23/women/lakehead-laurier-nov-19/julia-dunbar.jpg;w=960",
    "source_id": "tbnewswatch",
    "country": [
      "united states of america"
    ],
    "category": [
      "sports"
    ],
    "language": "english"
  },
  {
    "title": "Police Logs ― Nov. 20, 2022",
    "link": "https://news.yahoo.com/police-logs-nov-20-2022-050100493.html",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-20 05:01:00",
    "image_url": null,
    "source_id": "yahoo",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Zoe Saldaña Won’t Be Too Upset To Leave Gamora Behind",
    "link": "https://411mania.com/movies/zoe-saldana-wont-be-too-upset-to-leave-gamora-behind/",
    "keywords": [
      "Zoe Saldana"
    ],
    "creator": [
      "Jack Gregory"
    ],
    "video_url": null,
    "description": "Speaking recently to Variety, actress Zoe Saldaña talked about Guardians of the Galaxy Vol. 3 being her last portrayal of Gamora. The post Zoe Saldaña Won’t Be Too Upset To Leave Gamora Behind appeared first on 411MANIA.",
    "content": null,
    "pubDate": "2022-11-20 05:00:24",
    "image_url": null,
    "source_id": "411mania",
    "country": [
      "united states of america"
    ],
    "category": [
      "entertainment"
    ],
    "language": "english"
  },
  {
    "title": "Qatar’s Tarnished World Cup Is Too Big for Brands to Boycott",
    "link": "https://www.bloomberg.com/news/articles/2022-11-20/qatar-s-tarnished-world-cup-2022-is-too-big-for-brands-to-boycott",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-20 05:00:12",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "The FTX Sex Tape Leak: What’s Happening Now?",
    "link": "https://insidebitcoins.com/news/the-ftx-sex-tape-leak-whats-happening-now",
    "keywords": [
      "Cryptocurrency"
    ],
    "creator": [
      "Eric Dunne"
    ],
    "video_url": null,
    "description": "After a lot of buzz revolving around an alleged sex tape involving the infamous founder of FTX exchange, Sam Bankman-Fried and Alameda Research CEO Caroline [...]",
    "content": "After a lot of buzz revolving around an alleged sex tape involving the infamous founder of FTX exchange, Sam Bankman-Fried and Alameda Research CEO Caroline [...]",
    "pubDate": "2022-11-20 12:24:19",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Ripple Lawsuit: SEC Supporter Fails To File Amicus Brief, Here's Why",
    "link": "https://u.today/ripple-lawsuit-sec-supporter-fails-to-file-amicus-brief-heres-why",
    "keywords": null,
    "creator": [
      "Tomiwabold Olajide"
    ],
    "video_url": null,
    "description": "On Ripple's side, 14 formal amicus briefs were submitted",
    "content": null,
    "pubDate": "2022-11-20 12:23:00",
    "image_url": null,
    "source_id": "utoday",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Adele Las Vegas residency review: Star wows fans after 10-month delay - USA TODAY",
    "link": "https://news.google.com/__i/rss/rd/articles/CBMihwFodHRwczovL3d3dy51c2F0b2RheS5jb20vc3RvcnkvZW50ZXJ0YWlubWVudC9tdXNpYy8yMDIyLzExLzE5L2FkZWxlLWxhcy12ZWdhcy1yZXNpZGVuY3ktYmVnaW5zLWFmdGVyLTEwLW1vbnRoLWRlbGF5LXJldmlldy8xMDczNjM3MzAwMi_SAQA?oc=5",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "Adele Las Vegas residency review: Star wows fans after 10-month delay  USA TODAYAdele Thanks Fans for 'Coming Back' During Residency Opening Night  PEOPLE'I'm so scared!' Adele breaks down in tears on opening night of long-awaited Las Vegas residency  Daily MailAdele is worth the wait in majestic premiere  Las Vegas Review-JournalAdele Vanished Into Thin Air At Her Vegas Show, And My Brain Is Confused By It  BuzzFeedView Full Coverage on Google News",
    "content": null,
    "pubDate": "2022-11-20 12:11:00",
    "image_url": null,
    "source_id": "google",
    "country": [
      "united states of america"
    ],
    "category": [
      "entertainment"
    ],
    "language": "english"
  },
  {
    "title": "Integrating Blockchain Technology into the Retail Industry",
    "link": "https://thecryptobasic.com/2022/11/20/integrating-blockchain-technology-into-the-retail-industry/?utm_source=rss&utm_medium=rss&utm_campaign=integrating-blockchain-technology-into-the-retail-industry",
    "keywords": [
      "Guides",
      "Market",
      "Blockchain"
    ],
    "creator": [
      "Andrew MacGill"
    ],
    "video_url": null,
    "description": "Like it or not, the world is changing at the speed of light. Technology has evolved in such a way that there is no industry where you would not find some of its features. And among all the updates coming each day, crypto and blockchain may be the two topics bringing the most considerable amount […] The post Integrating Blockchain Technology into the Retail Industry first appeared on The Crypto Basic.",
    "content": null,
    "pubDate": "2022-11-20 12:10:00",
    "image_url": null,
    "source_id": "thecryptobasic",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Five People Dead After Gay Club Shooting in Colorado Springs",
    "link": "https://www.thedailybeast.com/colorado-springs-gay-club-shooting-leaves-five-dead?source=articles&via=rss",
    "keywords": [
      "U.S. News"
    ],
    "creator": [
      "William O’Connor"
    ],
    "video_url": null,
    "description": "KEVIN MOHATTAt least five people were killed and 18 injured in a shooting a gay nightclub in Colorado Springs that was described as a “hate attack.”Police said they were called to Club Q, in northeast of the city, at around 11:57 p.m. local time, when they received a flood of 911 calls from the club, which had been hosting a drag show.“They did locate one individual who we believe to be the suspect inside,” Colorado Springs Police Lt. Pamela Castro told the press. “At this point in time, the suspect is being treated, but is in custody.”Read more at The Daily Beast.",
    "content": null,
    "pubDate": "2022-11-20 12:09:32",
    "image_url": null,
    "source_id": "thedailybeast",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "As Biden Turns 80, Americans Ask 'What's Too Old?'",
    "link": "https://www.usnews.com/news/world/articles/2022-11-20/as-biden-turns-80-americans-ask-whats-too-old",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-20 12:08:06",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "GBTC Bitcoin discount nears 50% on FTX woes as investors stock up",
    "link": "https://cointelegraph.com/news/gbtc-bitcoin-discount-nears-50-on-ftx-woes-as-investors-stock-up",
    "keywords": [
      "Bitcoin",
      "BTC",
      "GBTC",
      "Grayscale",
      "Coinbase"
    ],
    "creator": [
      "Cointelegraph By   William Suberg"
    ],
    "video_url": null,
    "description": "GBTC shares keep getting cheaper versus Bitcoin — an ideal reason to buy for ARK Invest and Lawrence Lepard.",
    "content": "The largest Bitcoin ( BTC ) institutional investment vehicle is coming under suspicion as it trades at a record discount. The Grayscale Bitcoin Trust (GBTC) is the latest Bitcoin industry entity to feel the heat from the debacle over defunct exchange FTX . With contagion and fears over a deeper market rout everywhere in Bitcoin and altcoins at present, misgivings are impacting even the best-known — and trusted — crypto industry names. In recent days, it was the turn of GBTC, the long-embattled Bitcoin investment fund, amid problems at a related crypto firm, Genesis Trading. As Cointelegraph reported , parent company Digital Currency Group (DCG), as well as operator Grayscale itself, swiftly sought to reassure investors and the market that its flagship product was financially watertight. This did not appear enough to satisfy nerves, however, leading to additional public declarations of faith in DCG and GBTC. Among them was Coinbase Institutional, the institutional investment arm of major exchange Coinbase. “Nothing is more important than ensuring our clients' assets are safe,” it tweeted on Nov. 17. GBTC’s image has been under strain for some time. Since 2021, it has traded at a discount to the BTC spot price, a discount which is now approaching 50% . Amid a lack of demand, speculation has increased thanks to rumors that Grayscale may end up being bought should Genesis Trading fail. This change of tack could have implications for GBTC, as Grayscale notionally remains intent on converting it to an exchange-traded fund (ETF). “Though this is a difficult moment for many in crypto, I am deeply optimistic about the future of this industry, Grayscale 's business, and the opportunity for investors,” Grayscale CEO, Michael Sonnenshein, tweeted on Nov. 19. Consensus on the $10.5 billion GBTC potentially being forcibly sold remains weak. Related: Grayscale cites security concerns for withholding on-chain proof of reserves “Genesis may go under, but I find the odds of GBTC trust being liquidated to be highly unlikely just given the cash cow that it has been,” Lyle Pratt, creator of messaging platform Vida Global, reacted . The steepening discount following the FTX saga has meanwhile made GBTC a somewhat ironic “buy” for names such as ARK Invest and Lawrence Lepard, investment manager at Equity Management Associates. “Lots of questions and DM's. Lepard view on Grayscale and GBTC Spoiler alert: I own it,” he began a dedicated Twitter thread by saying over the weekend. On the topic of how bad the contagion could be for DCG and its family of firms, Leopard nonetheless acknowledged that it “is impossible to know how much distress they are in.” He continued to analyze the fallout should the worst-case scenario — bankruptcy — ensue. The views and opinions expressed here are solely those of the author and do not necessarily reflect the views of Cointelegraph.com. Every investment and trading move involves risk, you should conduct your own research when making a decision.",
    "pubDate": "2022-11-20 12:02:23",
    "image_url": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTEvOTUzMTY0NjYtYmZjMS00OTlhLWEyNWYtMzQ4OWFiZDYwY2U3LmpwZw==.jpg",
    "source_id": "cointelegraph",
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "title": "Ukraine Says Will Look Into Alleged Prisoner Shooting Video",
    "link": "https://www.usnews.com/news/world/articles/2022-11-20/ukraine-says-will-look-into-alleged-prisoner-shooting-video",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-20 12:01:45",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Intuit CEO Sasan Goodarzi Has a Window Into Our Spending Habits",
    "link": "https://time.com/6235182/interview-intuit-ceo-sasan-goodarzi/",
    "keywords": [
      "Uncategorized",
      "biztech2030",
      "The Leadership Brief"
    ],
    "creator": [
      "John Simons"
    ],
    "video_url": null,
    "description": "TIME spoke with Intuit's Sasan Goodarzi about how the slowing economy is affecting his customers and his top concerns as a CEO.",
    "content": "(To receive weekly emails of conversations with the world’s top CEOs and business decisionmakers, click here .) In Silicon Valley, a land littered with success stories, Sasan Goodarzi’s tale is anything but typical. Born in Tehran, he and his family immigrated to the U.S. to escape the Iranian Revolution. Within six months, his father died, forcing his older brothers to find a way to support the family. Coming to America as a 9-year-old, Goodarzi says he faced not just a new language and unfamiliar culture, but outright hatred and bullying in school, which stifled his love of learning and led to him graduating from high school in Orlando, Florida with a C-minus average. Goodarzi found his footing and ultimately rose to become chief executive of software stalwart, Intuit, in early 2019, after earning a master’s in business administration from the Kellogg School of Management at Northwestern University and decades of experience in the tech sector. Still, his early struggles inform his management style and worldview. When global protests over Iran’s treatment of women erupted in September, Goodarzi spoke out. “The amazing people of Iran are showing what they’re made of,” he wrote on Twitter in early September. “Huge respect for the brave women who are risking their lives to let the world know the line has been crossed and are demanding their basic human rights. As a native Iranian, I stand with you and could not be more proud.” A few weeks later, he urged his peers to get involved. “If you have a platform, make your voice count,” he tweeted. Intuit, approaching its 40th anniversary in 2023, develops and operates a collection of software products and services aimed at helping individuals and small businesses manage their finances. But Goodarzi sums up the company’s broader aims as a mission “to power the prosperity of those that we serve.” The Mountain View, Calif.-based company’s offerings include TurboTax, QuickBooks, Credit Karma, Mint and Mailchimp. Since assuming the role of chief executive, Goodarzi has not only set ambitious goals for Intuit’s growth, but has also made a bold public pledge to the company’s customers. That is, to double the household savings rate for people using Intuit’s services and to improve the success rate of small businesses on its platform by 10% over the national average—both by 2025. The average U.S. household saved about 7.9% of its disposable income in the two years before the pandemic, according to the OECD, and only half of small businesses survive beyond their fifth year. To date, Goodarzi says Intuit has surpassed that small business success rate and is over halfway to the household savings rate goal. TIME spoke with Goodarzi recently about how the slowing economy is affecting his customers. He laid out one of his top concerns as a CEO, and talked about what it takes to get hired at Intuit. This interview has been condensed and edited for clarity. ( For coverage of the future of work, visit TIME.com/charter and sign up for the free Charter newsletter. ) Intuit has a portfolio of products that help individuals and businesses organize their finances. What are you seeing right now from your customers as inflation is putting a squeeze on consumers and small businesses? We have a lot of data. So we see consumer spending on our platform. We see bank account balances, because small businesses connect to bank accounts. We actually see the number of employees and we see worker hours paid and hours worked. And I would just say in this environment, believe it or not, small businesses and consumers are generally healthy. Now, let me tell you about both sides of the coin, so I don’t mislead. The small businesses that we serve—they are growing. Their biggest issue is they can’t hire enough employees, and they’re thriving. Consumers’ unemployment is still very low. And when we look at account balances of consumers, they’re actually better than they’ve been in years. The other side of that is very real. Consumers and small businesses are paying more for rent. They’re paying more for food. They’re paying higher gasoline prices. And if you’re a small business, you’re also paying more for this very employee that you needed to hire now, versus five years ago. So that’s taking a chunk out of the pocketbook. For about two years, many people weren’t commuting to work, or going to stores and restaurants. So they saved money. But do you think something fundamentally changed during the pandemic? Are Americans being a little more cautious with their money—saving more? What we’ve experienced in the last 18 months is people were cooped up in their homes, and when they were un-cooped, people got out. They started spending money. They started traveling. That’s why airlines are reporting great earnings or bullish futures. I think what you’re starting to see now is consumers starting to pull back. They’re starting to buy cheaper brands, although they’re still spending their money. Why? Because they’re having to pay more for gas. They’re having to pay more for rent. They’re having to pay a lot more for food. Sugar is up 70%, for example. So consumers are starting to be careful about spending less in other places. But I don’t think that consumers are being smarter with their money. If they have it, they’re going to spend it. As a CEO, what are your main challenges right now? The biggest one—the thing we worry about most, that we talk about most—is speed. It’s about the velocity of innovation. It’s about moving fast, allowing our engineers to code, versus being in meetings, or being part of a decision. Speed is a leadership decision, and a company at our scale, if you can move fast and deliver for your customers, it actually becomes an advantage. The second thing is always making sure that we’re growing our employees and accessing great talent. We spend a lot of time talking about and architecting the company around speed and access to great talent. What roles are you looking to fill most at the moment? Is it programmers or something else? It’s in engineering, but it’s a couple of specific areas. The core element of our strategy is centered around data and artificial intelligence. Because it’s all about how we leverage the data and how we apply AI to accelerate our innovation. Therefore, the areas where we have added a lot of talent—and we continue to look for talent—is data scientists, data engineers, systems engineers that can think from a systems perspective, and mobile application engineers. If you’re someone who has that kind of expertise and you’re interviewing at Intuit, is there a surefire way of getting the company interested in you? Well, let’s use a data scientist as an example. We have a process that we call A for A, it’s Assessing for Awesome. That includes a one-to-one conversation. But there’s also a panel conversation of two or three people. That data scientist gets a case study, and they have to come in and present to that several-person panel, and explain how they would handle a situation. The things we look for from a data scientist is 1) Do they think about the problem from the lens of what they’re going to do for the customer and the impact they’re going to have for the customer? Because at the end of the day, our boss is the customer. And 2) Do they actually have the ability to apply their data science craft and demonstrate it, not just talk about it—demonstrate their capability around what technologies they’re familiar with, what code they’re familiar with, where they think technology is going, and how they would apply that to the customer problem. And then, of course, the third thing is interaction. How do they interact? Are they going to be able to work on a team? Because a data scientist can’t work alone. If I am hiring a data scientist executive, I’m really looking for the same things. But also asking: Can they lead at scale? Do they know how to hire great people? What track record do they have of transforming an organization? Lots of people in your position are saying it’s really difficult to hire great people with the job market still very competitive. Is Intuit doing anything differently as it relates to hiring? It’s been a challenging environment to hire the best of the best. If we’re competing with another company, once we get a candidate to visit and learn about the problems that they would solve for our customers versus somewhere else, our acceptance rate has been very, very high. They just felt like we had some hairy problems that they wanted to be a part of solving. Also, our attrition rate in the last year was five points lower than any of our peer companies. With all that said, access to talent has been hard, but we’ve been able to achieve our hiring ramp in the last couple of years. Apart from this need to tackle thorny problems, what else do you think is drawing engineers to Intuit? Well, I’ll tell you what I hear from the folks that we hire. I talk to new hires and I also spent a lot of my time doing chats with our frontline engineers at our different sites, particularly those that have been with us for one to three years. I get a firsthand feel for what they love, and also what we need to improve, which is a question I always ask them. The big thing is they like actually working on things that will impact another human being. They’re working on a project that will give you early access to your refund by five days, or instant access to your tax refund. They’re working on things that allow a customer to get paid much faster once they send an invoice. They’re working on benefit programs as part of our payroll platform. They also love it because when their code gets deployed, they can see on the other end the actual impact it had on a human being. And it’s a real impact, because it’s about money. Those are the things that really get the heartbeats of those new hires going much faster, and why they choose to join the company. When you have those conversations with them, what are some of the things they say you need to improve? The consistent themes I hear: They love how customer-centric we are. They love our culture. They love how everybody’s here to help each other collaborate and win. But they wish we would make decisions faster, and they wish they didn’t have to attend as many meetings to get their work done. In all those areas, we’re getting better, but I consistently hear the same thing. Meetings are a real thorny issue. Have you figured out a way of reducing meetings and accelerating actual work? If so, do you have any tips? First of all, we’ve improved a lot in this area. We are nowhere near where we need to be. There’s a couple of things we are doing. One is, we set no meetings in the afternoons for our engineers. One of the big things with engineers is you don’t want to distract them. They can’t code for an hour, jump into a meeting, come back and code for an hour, because they have to spend 20% of the time after they come back to figure out where they left off. So, now they always have four or five hours of uninterrupted coding time. That’s working, and we continue to monitor it. We also realize it’s not being followed everywhere in the company, so we keep working it out. That’s a good one. Any other tips? The other is the concept of two-way doors versus one-way doors. The majority of decisions we make, there are two-way doors. If you make it and you made a mistake or it wasn’t a good decision, you can come back in. A one-way door is you, once you make the decision, you can’t just turn around and say, “Oh oops.” If you pay $10 billion for an acquisition, you don’t just turn around and say, “Oops.” That’s a one way door. So what we’re working on is being clear, and it’s something we’re working on right now actually, is being clear that 95% plus of decisions are two-way doors, and to enable our teams to move without having to get into meetings. Because a lot of the meetings are two-way doors where you get into a meeting and you’re presenting to management, you don’t even need to do that, just go do it. But culturally, there is a sort of need for a manager wanting to call a meeting on something that they don’t need to. So that’s what we are working on, and we believe it will work. The other is continuing to get better at when you have a meeting, good hygiene. Why are you in the meeting? What decision are you going to make? Who are the three, four people you need in the meeting, versus 50 people in a meeting? And then it should be a decision meeting or an ideation meeting. You shouldn’t get into a meeting just to inform someone and provide an update. That can be done asynchronously. So those are the things that we’re working on. As we all emerge from the pandemic, what’s your opinion about whether work needs to be done in the office or not? When the world shut down in March of 2020, we overnight went virtual with, right now we have over 17,000 employees. We went home overnight. And the good news is we’re a technology company. We have all the tools and we could work virtually. And frankly, many things over time accelerated, because people were actually more productive and effective. So we felt like we needed to really step back and think about what we wanted to do, versus just assuming we all come back to work. What that means to us is that we announce that we’re letting mission based teams decide which days they want to come together in the office and work, and which days they want to work virtually. We did not prescribe, “You have to be in the office Monday, Tuesday, Wednesday.” We’re letting teams do it, and the reason for that is when we sent everybody home overnight, we didn’t give them instructions. Everybody just worked virtually, and then we figured out how to work in our mission based groups. So we are leveraging that learning as we’re in a hybrid environment. More Must-Reads From TIME Steven Spielberg Waited 60 Years to Tell This Story Who Should Be TIME's 2022 Person of the Year? Vote Now Donald Trump, Grover Cleveland, and the History of Trying to Win Back the White House Michelle Obama: Yes, We Still Need to ‘Go High’ When Everything Is Terrible Columns: Voters Understand the Truth About Pregnancy Decisions. What Happened in Montana Proves It Cold Weather Can Be Dangerous for the Human Body. This Winter Worries Experts How to Prepare for Travel Chaos Over the Holidays Big Tech's Implosion Could Save the Planet The Best of Culture 2022 Contact us at letters@time.com .",
    "pubDate": "2022-11-20 12:00:54",
    "image_url": null,
    "source_id": "timenextadvisor",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "What Monica Roberts Gave the Trans Community",
    "link": "https://time.com/6235325/monica-roberts-transgender-day-of-remembrance/",
    "keywords": [
      "Uncategorized",
      "freelance"
    ],
    "creator": [
      "Eliel Cruz"
    ],
    "video_url": null,
    "description": "The best way to honor her legacy is by documenting, amplifying, and paying attention to the attacks trans people are facing",
    "content": "Monica Roberts began tracking violence against the trans community in 2006, long before national organizations, governmental agencies, and, perhaps most important, the media, were paying close attention. Her award-winning blog, TransGriot , aggregated local news, police reports, and community-sourced information. Her no-frills style of reporting and her reputation as a trusted journalist and blogger in the community made her a critical resource. Tapping into a rich network of trans people on social media and tips received via email, Roberts was a go-to for trans activists across the country, particularly during a time when the media wasn’t regularly reporting on the killings of trans people or doing so in a way that honored the lives of those lost. “Monica was making sure that not only was she cataloging these murders, whenever there was an article that was written when the person was misgendered, she was able to write the article correctly,” said trans activist Dee Dee Waters, who was also a longtime friend of Monica. “It was really good to have her, as we tried to conquer a lot of this transphobic stuff.” In West African culture, a griot is a tribal storyteller who acts as an advisor to leaders and serves as a living archive. For more than a decade, Monica offered that crucial service to a community that is often overlooked and mistreated. When I worked at the New York City Anti-Violence Project (AVP) , part of my job was to track violence against LGBTQ people, and Monica’s blog was invaluable. She regularly broke stories that went beyond the violence that trans communities disproportionately face. As a growing movement and understanding for trans communities progressed in the aughts, so did her coverage, with posts about trans people in politics, music, and TV and film . As individual states act with increasing hostility to trans people— The Washington Post reported that, as of Oct. 13, more than 155 pieces of anti-trans legislation had been introduced this year alone—violence against the trans community is only going to get worse. These laws attack bodily autonomy and self-identification, as well as deny crucial medical care and have introduced harmful discussion about sexual orientation and gender identity. Which means we need people in the world—from the mainstream media to elected officials to allies of trans and nonbinary people—to sit up, pay attention, and spread the word of the ongoing violence trans people face. In the fall of 2020, Monica died at 56 years old . Her unexpected death, due to blood clots in her lungs, reverberated throughout the LGBTQ community. The Association of LGBTQ Journalists (NLGJA) lauded her groundbreaking journalism, and the National Association of Black Journalists (NABJ) posthumously inducted her to its hall of fame . Her blog now lives on as an archive , and more digital content will be produced by Transgriot LLC under the leadership of Waters, with plans to continue additional reporting on the issues facing Black trans Americans. The legacy she left is one of watching out for and taking care of her community, especially in moments when it seemed as if few outside of the community were listening or taking action. In one of Monica’s last posts on anti-trans violence , she documented the murder of Selena Reyes Hernandez, who was shot and killed by 18-year-old Orlando Perez after she disclosed that she was transgender to him. “She is the sixth Latinx transperson to die in 2020 and the 14th transperson this year, but I’m just now finding out about this May 31 murder because of misgendering of her by the Chicago medical examiner, Chicago PD and the Chicago media,” wrote Roberts on her blog. “Even her family went there in disrespecting her in death, choosing to bury her in her native Mexico under her deadname.” Monica Roberts at the GLAAD Gala in San Francisco on Sept. 8, 2016. Kimberly White—GLAAD/Getty Images In 2019, the American Medical Association (AMA) and the Human Rights Campaign (HRC) called the killings of trans Americans an epidemic following at least 28 homicides in 2018 and 25 homicides in 2019. “According to available tracking, fatal anti-transgender violence in the U.S. is on the rise and most victims were black transgender women,” said AMA board member S. Bobby Mukkamala, M.D., in a 2019 press release . “The number of victims could be even higher due to underreporting and better data collection by law enforcement is needed to create strategies that will prevent anti-transgender violence.” Since then, homicides of trans people have doubled to historic levels of violence with limited media attention or public outcry. In 2020, there were at least 44 homicides of trans and nonbinary people, and 57 in 2021, and 33 so far through this year, according to Sue Kerr, a blogger and social worker who is one of the few individuals tracking violence against trans folks. “When Kathryn Newhouse was killed in Georgia, nineteen, murdered by her father. And she’s AAPI, she’s autistic, and she has mental health issues. All these intersections, no one wrote about it,” Kerr said about a murder that happened March . “The one thing I’ve noticed that’s a big difference from when I was writing these in ‘14, ‘15, ‘16, is that people on the ground, usually the friends of the deceased, are all over the media.” This was the case for 28-year-old Brazil Johnson, who was shot and killed in Milwaukee, Wis., in June. Johnson’s family and friend’s described her to a local outlet as “kind-hearted .” The family and friends of 50 year-old Nedra Sequence Morris , who was killed in May, organized a vigil on her behalf to demand justice. The friends and community of trans people, commonly known as chosen family, now serve as unofficial media spokespersons, and become advocates for their friends, or loved ones after death. There are a handful of individuals and organizations across the country tracking the violence against trans people. The Anti-Violence Project ( AVP ) continues to lead a national coalition of organizations doing data collection on anti-LGBTQ violence. TransLashMedia , led by trans media personality Imara Jones, marks each trans individual’s death on their Instagram channel. HRC also tracks anti-trans violence and releases an annual report . Every year the constant has been an emphasis from advocates to say “at least” alongside any number about the murder of trans people—knowing that with the limited available tracking, there are names of trans people whose stories go untold. It’s important to remember that violence against marginalized communities does not begin with murder. It starts with the acceptance, both passive and deliberate, of increasingly hateful rhetoric, which fuels legislation and emboldens people to commit acts of violence. Trans people, disproportionately Black trans women, are facing violence on the streets and from intimate partners, family, or co-workers, and from legislation that aims to dehumanize and ultimately eliminate trans people from the public space. There’s a growing animus against trans people that manifests as violence in real life, and we must call it out for what it is. Every year, on Nov. 20, the LGBTQ community remembers the lives of those lost for the Transgender Day of Remembrance. This year—and every year after—Monica will be remembered as a ferocious leader who cared enough to look out for the needs of her community. She was not only taken too soon, and her absence from our movement will be felt immensely, her care and love for her community always remembered. The way to honor her legacy is for all of us to take up part of the work of documenting, amplifying, and paying attention to the attacks trans people are facing. We cannot stand by idly. We must demand justice. More Must-Reads From TIME Steven Spielberg Waited 60 Years to Tell This Story Who Should Be TIME's 2022 Person of the Year? Vote Now Donald Trump, Grover Cleveland, and the History of Trying to Win Back the White House Michelle Obama: Yes, We Still Need to ‘Go High’ When Everything Is Terrible Columns: Voters Understand the Truth About Pregnancy Decisions. What Happened in Montana Proves It Cold Weather Can Be Dangerous for the Human Body. This Winter Worries Experts How to Prepare for Travel Chaos Over the Holidays Big Tech's Implosion Could Save the Planet The Best of Culture 2022 Contact us at letters@time.com . TIME Ideas hosts the world's leading voices, providing commentary on events in news, society, and culture. We welcome outside contributions. Opinions expressed do not necessarily reflect the views of TIME editors.",
    "pubDate": "2022-11-20 12:00:28",
    "image_url": null,
    "source_id": "timenextadvisor",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Maricopa County Official Reportedly Goes Into Hiding Over Midterm Safety Fears",
    "link": "https://www.huffpost.com/entry/maricopa-bill-gates-undisclose-location-safety-concerns-arizona_n_637abef6e4b0e771d9557a24",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "Fox News reported that Maricopa County Supervisor Bill Gates was moved \"for his own safety\" after ugly attacks linked to midterm losers.",
    "content": null,
    "pubDate": "2022-11-21 01:51:35",
    "image_url": null,
    "source_id": "huffpost",
    "country": [
      "united states of america"
    ],
    "category": [
      "politics"
    ],
    "language": "english"
  },
  {
    "title": "Sacramento State earns No. 2 seed in 24-team FCS playoffs",
    "link": "https://www.kcra.com/article/sacramento-state-earns-no-2-seed-24-team-fcs-playoffs/42016769",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "South Dakota State and Sacramento State have earned the top two seeds in the Football Championship Subdivision playoffs. Neither program at the top of the seedings has ever won the national title.",
    "content": null,
    "pubDate": "2022-11-21 01:20:00",
    "image_url": "https://kubrick.htvapps.com/vidthumb/fc76fe97-527f-4454-906a-bf715b6a4d25/fc76fe97-527f-4454-906a-bf715b6a4d25_image.jpg",
    "source_id": "kcra",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Interstate 80 traffic backed up due to multi-vehicle crash involving a jackknifed trailer",
    "link": "https://www.kcra.com/article/interstate-80-multi-vehicle-crash-auburn/42017556",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "Authorities said two separate crashes happened on Interstate 80 at the Elm Avenue exit in the Auburn area, according to Caltrans.",
    "content": null,
    "pubDate": "2022-11-21 01:14:00",
    "image_url": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/traffic-delays-1647646479.png",
    "source_id": "kcra",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Getting money out of FTX could take years, if not decades",
    "link": "https://insidebitcoins.com/news/getting-money-out-of-ftx-could-take-years-if-not-decades",
    "keywords": [
      "Cryptocurrency"
    ],
    "creator": [
      "Victor Alexander"
    ],
    "video_url": null,
    "description": "While investors are eager to learn when they will be able to recover their funds from the now-defunct crypto exchange FTX, insolvency lawyers warn that [...]",
    "content": "While investors are eager to learn when they will be able to recover their funds from the now-defunct crypto exchange FTX, insolvency lawyers warn that it could take “decades.” On November 11, the crypto exchange and 130 affiliates filed for Chapter 11 bankruptcy protection in the United States. Insolvency lawyer Stephen Earel, partner at Co Cordis in Australia, stated that “realizing” the crypto assets and determining how to distribute the funds will be a “enormous exercise” in the liquidation process, which could take years, if not “decades.” He attributes this to the complexities associated with cross-border insolvency issues and competing jurisdictions. Earel stated that FTX users are in the same line as everyone else, including creditors, investors, and venture capital funders, and that those who have made “crypto to crypto trades” may not receive a distribution “for years.” Simon Dixon, founder of global investment platform BnkToTheFuture and an active participant in the Celsius bankruptcy proceedings, stated that anyone who holds funds on FTX will become creditors, and a creditors committee will be formed to represent their interests. He stated that creditors will eventually be able to access the remaining assets, depending on what remains after bankruptcy costs. According to Binance Australia CEO, these costs could be high due to the time required to recover funds, which means more legal and administrative fees that eat into customers’ returns. Meanwhile, Irina Heaver, Partner at Keystone Law in the UAE, said that users in the Middle East are also feeling the effects of the FTX collapse, as the region was the third largest FTX user base. Heaver explained that because FTX already has a license and regulatory supervision from Dubai’s newly formed Virtual Assets Authority regulator (VARA), the regulators face major complications because they already have a “huge regulatory failure” on their hands. Heaver stated that creditors’ rights will be overseen by the legal system, with courts and bankruptcy administrators involved “when and if” FTX enters Chapter 11 bankruptcy procedures. Heaver’s advises people who have suffered significant losses as a result of the FTX collapse to seek legal counsel and join forces with “other injured parties.” The recent FTX collapse has had far-reaching consequences for investors worldwide. According to recent reports, the bankrupt cryptocurrency exchange may have “more than 1 million creditors.” According to a Reuters article published on November 20, the bankrupt cryptocurrency exchange owes “nearly $3.1 billion” to its top 50 creditors.",
    "pubDate": "2022-11-21 01:07:48",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Lucky Block Price Prediction for Today, November 20: LBLOCK Is in a Positive Trend as It Targets the $0.0002200 High",
    "link": "https://insidebitcoins.com/news/lucky-block-price-prediction-for-today-november-20-lblock-is-in-a-positive-trend-as-it-targets-the-0-0002200-high",
    "keywords": [
      "analysis",
      "LuckyBlock",
      "Opinion",
      "LBlock/USD",
      "Lucky Block",
      "Price Analysis"
    ],
    "creator": [
      "Azeez Mustapha"
    ],
    "video_url": null,
    "description": "Lucky Block Price Prediction – November 20, 2022 LBLOCK is currently in decline although the cryptocurrency is having an upward correction as it targets the [...]",
    "content": "is currently in decline although the cryptocurrency is having an upward correction as it targets the $0.0002200 high. Small-bodied unreliable candlesticks are seen in the high time frames. These candles result in a range-bound shift in the price action. LBLOCK price now – $0.0001578 LBLOCK market cap – LBLOCK circulating supply – LBLOCK Total Supply – $576,137 LBLOCK Coinmarketcap ranking – #2249 Resistance levels: $0.0021, $0.0022, $0.0023 Support levels: $0.00200, $0.001900, $0.001800 As the price crosses above the moving average lines, LBLOCK is in the positive trend zone. Buyers have been pressing against the barrier at $0.0001800 since November 10. The crypto’s price has attempted to break through the resistance four times but has failed. As it crosses over the moving average lines today On the upside, the altcoin will go toward the next resistance at $0.0002200 if it breaks above the resistance level. But as long as buyers are unable to push the price over the resistance level of $0.0001800, the coin will continue to trade sideways between levels of $0.0001400 and $0.0001800. LBLOCK fell to a low of $0.0001444 on November 19 as it targets the $0.0002200 high. As it reaches the peak of $0.0001674, the bullish momentum has burst over the lines of the moving averages. The region of overbought has been reached by the current rise. The altcoin has a daily Stochastic level of 96. The overbought area is anticipated to offer resistance to LBLOCK. Furthermore, LBLOCK has recovered bullish momentum since its dip on November 9 as it approaches the resistance around $0.0001800. However, Dash 2 Trade, a different coin, has seen its value soar recently. This puts into more perspective the requirement for a cutting-edge trading intelligence platform, and that exactly is what . It is a platform that can adequately detect impending adverse issues similar to what happened to FTX, thus enabling investors and traders to pinpoint safe opportunities for good profits. The D2T token presale is ongoing and it has raised $6.5 million so far. You can purchase Lucky Block here. • •",
    "pubDate": "2022-11-21 01:05:48",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Scroll Through the Universe with This Cool Interactive Map",
    "link": "https://www.universetoday.com/158735/scroll-through-the-universe-with-this-cool-interactive-map/",
    "keywords": [
      "Cosmology",
      "Astronomy",
      "cosmic microwave background",
      "cosmos",
      "education",
      "Education and Public Outreach",
      "interactive",
      "observable universe",
      "website"
    ],
    "creator": [
      "Laurence Tognetti"
    ],
    "video_url": null,
    "description": "Johns Hopkins University (JHU) continues to pad its space community résumé with their interactive map, “The map of the observable Universe”, that takes viewers on a 13.7-billion-year-old tour of the cosmos from the present to the moments after the Big Bang. While JHU is responsible for creating the site, additional contributions were made by NASA, … Continue reading \"Scroll Through the Universe with This Cool Interactive Map\" The post Scroll Through the Universe with This Cool Interactive Map appeared first on Universe Today.",
    "content": "Johns Hopkins University (JHU) continues to pad its space community résumé with their interactive map, “The map of the observable Universe”, that takes viewers on a 13.7-billion-year-old tour of the cosmos from the present to the moments after the Big Bang. While JHU is responsible for creating the site, additional contributions were made by NASA, the European Space Agency, the National Science Foundation, and the Sloan Foundation. The main page encourages you to scroll down as the viewer watches the number of celestial objects increase and then brings them to a 90-degree view of the night sky that has all 13.7 billion years of the cosmos right there in front of them. While this opening page serves as the summary of the interaction, the “explore the map” and “description” links at the bottom of the page allow the viewer to examine the map in more detail. “Explore the map” lets the viewer scroll back in time in 100-million-year increments all the way to the edge of the observable universe, also known as the Cosmic Microwave Background, while they are provided detailed descriptions of various celestial objects during their journey, which include several types of galaxies and quasars. “Description” does an excellent job answering questions in detail that the viewer might be asking throughout their journey pertaining to both the map and the instruments that were used to gather the data. These include easy-to-understand figures and diagrams. At the bottom, the viewer is also given the option to either download or purchase the map for their own personal or educational purposes. Overall, this interactive map is small, easy-to-use, and concise in its ability to share the entirety of the cosmos with easy-to-understand descriptions that are likely suitable for astronomy lovers as young as grade school. If you want a crash course on the history of our universe, then check out “The map of the observable Universe” from Johns Hopkins University! As always, keep doing science & keep looking up! The post Scroll Through the Universe with This Cool Interactive Map appeared first on Universe Today.",
    "pubDate": "2022-11-21 01:00:37",
    "image_url": "https://www.universetoday.com/wp-content/uploads/2022/11/CMB_Timeline300_no_WMAP-1024x676.jpg",
    "source_id": "universetoday",
    "country": [
      "united states of america"
    ],
    "category": [
      "science"
    ],
    "language": "english"
  },
  {
    "title": "Neymar Stands in the Way of Messi’s World Cup Dream",
    "link": "https://www.bloomberg.com/news/articles/2022-11-21/neymar-messi-lead-race-to-win-2022-world-cup-reveals-bloomberg-poll",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-21 01:00:07",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "With its new v5 router, 1inch seeks to minimize gas costs",
    "link": "https://insidebitcoins.com/news/with-its-new-v5-router-1inch-seeks-to-minimize-gas-costs",
    "keywords": [
      "Cryptocurrency"
    ],
    "creator": [
      "Gwinnart Kongphet"
    ],
    "video_url": null,
    "description": "Customers of the decentralized exchange (DEX) section would reportedly pay gas charges for swaps that are at least 10% less than those of 1inch’s prior [...]",
    "content": "Customers of the decentralized exchange (DEX) section would reportedly pay gas charges for swaps that are at least 10% less than those of 1inch’s prior offers, making switching activity on the Ethereum network more lucrative for its users. In the Router v5, 1inch predicted that swaps would be 10% more gas efficient compared to the second-best participant in the DEX segment and about 5% more gas efficient than in the previous edition. A new interaction logic, pre-/post-interactions, and an upgraded smart contract error processing system are among the new features and advancements brought to the Router v5 from earlier routers. The latest edition has undergone audits from almost a dozen industry initiatives, including Consensys, OpenZeppelin, and ABDK Consulting, and is also intended to prioritize security. Co-founder of 1inch Network Sergej Kunz said “We have gathered enough improvements since the 1inch Router v4 was published to warrant the introduction of the new fifth version. […] In comparison to utilizing any other DeFi device, our users will now save at least 8–14% more because to our improved gas cost optimization.” The 1inch Network would implement the 1inch Aggregation Protocol and the 1inch Limit Order Protocol on Avalanche and Gnosis Chain, formerly known as the xDai Chain at the start of the year. In order to give its user base with access to the 1inch Limit Order Protocol v2, as well as deeper liquidity and improved token swaps via the 1inch network, 1inch connected with Klaytn, South Korea’s most well-known metaverse blockchain, in August. The Router v5 is the newest router by DEX aggregator 1inch. The business said that by lowering gas prices for swaps, Router v5 will make consumers’ experiences with decentralized finance (DeFi) more convenient.",
    "pubDate": "2022-11-21 00:57:11",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Building  Smart Cities of the Future",
    "link": "https://www.bloomberg.com/news/videos/2022-11-21/building-smart-cities-of-the-future",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-21 00:55:39",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Vikings fall to 8-2 after dismal 40-3 home loss to the Cowboys",
    "link": "https://www.startribune.com/vikings-cowboys-40-3-kirk-cousins-seven-sacks-8-2-record/600228287/",
    "keywords": null,
    "creator": [
      "Ben Goessling"
    ],
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-21 00:47:29",
    "image_url": null,
    "source_id": "startribune",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Billionaire investor Bill Ackman says 'crypto is here to stay'",
    "link": "https://cointelegraph.com/news/billionaire-investor-bill-ackman-says-crypto-is-here-to-stay",
    "keywords": [
      "Bill Ackman",
      "Pershing Square Capital Management",
      "Intrinsic Value",
      "Helium",
      "Pump and Dump Schemes",
      "Global Economy"
    ],
    "creator": [
      "Cointelegraph By    Brayden Lindrea"
    ],
    "video_url": null,
    "description": "Bill Ackman’s conviction on crypto comes as much of the community attempts to regain confidence in the industry following the FTX fallout.",
    "content": null,
    "pubDate": "2022-11-21 06:13:54",
    "image_url": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTEvNDA3ZWVhYWEtZjUxNC00OGI1LTkxYTktNTY0NTFhODNlMjQxLmpwZw==.jpg",
    "source_id": "cointelegraph",
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "title": "Cardano Critic Says ADA Is Poised to “Plummet Down”",
    "link": "https://u.today/cardano-critic-says-ada-is-poised-to-plummet-down",
    "keywords": null,
    "creator": [
      "Alex Dovbnya"
    ],
    "video_url": null,
    "description": "An Input Output executive has slammed a critic who said that the ADA cryptocurrency was poised to plummet down",
    "content": null,
    "pubDate": "2022-11-21 06:09:01",
    "image_url": null,
    "source_id": "utoday",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Top Creditors May Receive $3B from FTX, But Retail Traders May Not Be on the List!",
    "link": "https://coinpedia.org/news/top-creditors-may-receive-3b-from-ftx-but-retail-traders-may-not-be-on-the-list/",
    "keywords": [
      "News",
      "Altcoins",
      "Bitcoin",
      "Crypto news",
      "Cryptocurrency"
    ],
    "creator": [
      "Sahana Vibhute"
    ],
    "video_url": null,
    "description": "The post Top Creditors May Receive $3B from FTX, But Retail Traders May Not Be on the List! appeared first on Coinpedia Fintech News FTX exchange filed for bankruptcy on November 11 in Delaware owing nearly 1 million customers with more than $10 billion in losses. With the beginning of the proceedings of the FTX bankruptcy lawsuit, the exchange said that they owed more than $3 billion to their top 50 creditors. Moreover, it mentioned that it owes nearly …",
    "content": "The post Top Creditors May Receive $3B from FTX, But Retail Traders May Not Be on the List! appeared first on Coinpedia Fintech News FTX exchange filed for bankruptcy on November 11 in Delaware owing nearly 1 million customers with more than $10 billion in losses. With the beginning of the proceedings of the FTX bankruptcy lawsuit, the exchange said that they owed more than $3 billion to their top 50 creditors. Moreover, it mentioned that it owes nearly $1.45 billion to the top 10 creditors, without naming them. The exchange during the court proceedings said that it was reviewing the assets they have and are preparing for the sale or reorganization of some business. However, as per an expert, the top creditors or the equity holders may be given the first preference for restructuring, while the investors in the Bahamas-based companies may be the next ones to receive.  Meanwhile, the FTX account holders could be their least priority as they stand at the end of the queue.  yikes.. reason why rich gets richer and retail gets fucked pic.twitter.com/7HvOqYJVzw— frxresearch (@frxresearch) November 21, 2022 On the other hand, FTX’s sister concern, Alameda Research, a trading platform, has transferred nearly $37 million USDC to an address named FalconX. This is speculated to be user’s funds which were squeezed without intimating them. Meanwhile, the so-called ‘hacker’ who stole assets worth more than $600 million swapped them into ETH & stablecoins. In a recent update, these ETH were further traded into wBTC & renBTC through aggregators like 1Inch. Therefore, it is pretty clear that the retail traders who traded on FTX exchanges on a daily basis and kept the platform active are the least considered for any restructuring. Moreover, the user’s funds which were stolen, have been utilised. Hence, a re-broadcast of MT. Gox’s rehabilitation plan is expected to repeat, and retail investors may wait for a long time to retrieve their lost funds.",
    "pubDate": "2022-11-21 06:07:57",
    "image_url": null,
    "source_id": "coinpedia",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Why is Ripple Interested in Buying Certain Parts of Collapsed FTX Exchange?",
    "link": "https://coinpedia.org/news/why-is-ripple-interested-in-buying-certain-parts-of-collapsed-ftx-exchange/",
    "keywords": [
      "News",
      "Cryptocurrency",
      "Ripple (XRP)"
    ],
    "creator": [
      "Delma Wilson"
    ],
    "video_url": null,
    "description": "The post Why is Ripple Interested in Buying Certain Parts of Collapsed FTX Exchange? appeared first on Coinpedia Fintech News The CEO of Ripple, Brad Garlinghouse, recently stated that his company would be interested in FTX-owned businesses. He is also interested in purchasing some parts of the troubled FTX cryptocurrency exchange. Garlinghouse thinks that if transparency and trust are kept as a priority, the cryptocurrency sector will grow stronger. He places a high value on …",
    "content": "The post Why is Ripple Interested in Buying Certain Parts of Collapsed FTX Exchange? appeared first on Coinpedia Fintech News The CEO of Ripple, Brad Garlinghouse, recently stated that his company would be interested in FTX-owned businesses. He is also interested in purchasing some parts of the troubled FTX cryptocurrency exchange. Garlinghouse thinks that if transparency and trust are kept as a priority, the cryptocurrency sector will grow stronger. He places a high value on bitcoin because it gives individuals the opportunity to reject the private monopoly and control over people’s assets for the first time in history “Part of my conversation [with SBF] as if he needs liquidity, maybe there are businesses that he has bought or he has that we would want to own. Maybe there are investments that we would want own. Would we have bought some of those from him? I think that was on the table.” On Nov. 16 and 17, 2022, during the 6th annual RippleSwell conference in London, Mr. Garlinghouse revealed that former FTX CEO Sam Bankman-Fried had called him two days prior to the company declaring bankruptcy in an effort to gather investors to save it. He also took to Twitter and explained in a long thread “With all that’s happening in the past few weeks (and over the course of this year’s ups and downs), it feels even more imperative that we’ve gathered together in person to have honest conversations about solving real-world problems with crypto and blockchain. As I said on stage – I firmly believe that crypto will be stronger because of this if we keep focusing on transparency and trust. Ripple has and will continue to lead in this regard.” What’s Next For Ripple Vs SEC? Regarding the SEC’s (Securities and Exchange Commission) lawsuit against Ripple, founder Chris Larsen, and co-founder Garlinghouse, Brad Garlinghouse and Stuart Alderoty both anticipate a decision in the first half of 2023. Final legal briefs must be submitted by Nov. 30 in order for the court to make a decision or schedule a jury trial.",
    "pubDate": "2022-11-21 05:53:08",
    "image_url": null,
    "source_id": "coinpedia",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Binance Beats Coinbase To Become Top Bitcoin-Holding Exchange With Over $9B BTC Reserve",
    "link": "https://www.benzinga.com/markets/cryptocurrency/22/11/29798806/binance-beats-coinbase-to-become-top-bitcoin-holding-exchange-with-over-9b-btc-reserve",
    "keywords": [
      "$BTC",
      "Binance",
      "Bitcoin",
      "COIN",
      "Coinbase",
      "Cryptocurrency",
      "Gemini",
      "News",
      "Top Stories",
      "Markets",
      "COIN",
      "US21254S1078",
      "$BTC",
      "News",
      "Cryptocurrency",
      "Top Stories",
      "Markets",
      "Benzinga"
    ],
    "creator": null,
    "video_url": null,
    "description": "Binance, one of the world’s largest cryptocurrency exchanges, holds over 584,083 Bitcoin (CRYPTO: BTC) worth 9.34 billion in its reserve, data from CryptoQuant showed. read more",
    "content": null,
    "pubDate": "2022-11-21 05:47:45",
    "image_url": null,
    "source_id": "benzinga",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Massive Exposure As Shiba Inu Going To Immerse Global Summit",
    "link": "https://thecryptobasic.com/2022/11/21/massive-exposure-as-shiba-inu-going-to-immerse-global-summit/?utm_source=rss&utm_medium=rss&utm_campaign=massive-exposure-as-shiba-inu-going-to-immerse-global-summit",
    "keywords": [
      "Market",
      "Altcoins",
      "SHIB",
      "Shiba Inu"
    ],
    "creator": [
      "Zabi"
    ],
    "video_url": null,
    "description": "Marcie Jastrow To Represent Shiba Inu At Immerse Global Summit. Lead Shiba Inu Metaverse advisor Marcie Jastrow to represent Shiba Inu (SHIB) at Immerse Global Summit 2022. The official Twitter handle of Immerse Global Summit confirms that the lead SHIB Metaverse advisor, Marcie Jastrow, will speak at the upcoming Immerse Global Summit scheduled to begin […] The post Massive Exposure As Shiba Inu Going To Immerse Global Summit first appeared on The Crypto Basic.",
    "content": "Marcie Jastrow To Represent Shiba Inu At Immerse Global Summit. Lead Shiba Inu Metaverse advisor Marcie Jastrow to represent Shiba Inu (SHIB) at Immerse Global Summit 2022. The official Twitter handle of Immerse Global Summit confirms that the lead SHIB Metaverse advisor, Marcie Jastrow , will speak at the upcoming Immerse Global Summit scheduled to begin on December 5th and end on December 7 th , 2022, at Fontainebleau Hotel Miami, Florida. Marcie Jastrow from @Shibtoken will be speaking at #IGSmiami Dec 5-7, 2022 #ShibaArmy Retweet to share this! 📢 Did you get your tickets yet? https://t.co/3K2nwRoAy3 #metaverse #blockchain #techconference #tech #SHIBARMYSTRONG $SHIB pic.twitter.com/KJqEU5p0Gj — Immerse Global Summit (@ImmerseSummit) November 18, 2022 As per reports, Marcie Jastrow will shed light on the development of SHIB: The Metaverse and the whole Shiba Inu Ecosystem at the summit alongside major industry players, including Meta Platforms, Inc. (Meta), Microsoft (MSFT), web3equity, and TerraZero. As per the official website of Immerse Global Summit, over 1000 attendees, including 300+ company representatives, 200+ speakers, and 20+ industry verticals, are coming to the technology and business growth conference. Apart from this, Immerse Global Summit has also partnered with major media outlets to get huge media coverage all across the globe, including Fortune, Miami Herald, Cointelegraph, and many more. Shiba Inu’s representation at IGS Miami is supposed to be a major milestone as it will expose Shiba Inu and its Metaverse to many investors and enthusiasts across the globe. Disclaimer: The content is for informational purposes only, may include the author's personal opinion, and does not necessarily reflect the opinion of TheCryptoBasic. All Financial investments, including crypto, carry significant risk, so always do your complete research before investing. Never invest money you cannot afford to lose; the author or the publication does not hold any responsibility for your financial loss or gains.",
    "pubDate": "2022-11-21 05:42:13",
    "image_url": null,
    "source_id": "thecryptobasic",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Scoreboard for Sunday, Nov. 20",
    "link": "https://www.inforum.com/sports/scoreboard-for-sunday-nov-20",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "Regional and local scores and schedule.",
    "content": null,
    "pubDate": "2022-11-21 05:34:14",
    "image_url": null,
    "source_id": "inforum",
    "country": [
      "united states of america"
    ],
    "category": [
      "sports"
    ],
    "language": "english"
  },
  {
    "title": "Lucky Block Price Prediction: LBLOCK Sets Gaze Beyond $0.0001700",
    "link": "https://insidebitcoins.com/news/lucky-block-price-prediction-lblock-sets-gaze-beyond-0-0001700",
    "keywords": [
      "Cryptocurrency",
      "LuckyBlock",
      "Trading",
      "LBlock/USD",
      "Lucky Block",
      "Technical Analysis"
    ],
    "creator": [
      "Azeez Mustapha"
    ],
    "video_url": null,
    "description": "Lucky Block has now broken loose from the pull of downward forces. Subsequently, this crypto appears to be moving fast towards the $0.00017000 perhaps to [...]",
    "content": "has now broken loose from the pull of downward forces. Subsequently, this crypto appears to be moving fast towards the $0.00017000 perhaps to surpass it. Lucky Block’s Value: $0.0001690 Market Capitalization for LBLOCK: $0.575 million LBLOCK Flowing Supply: —- Lucky Block Total Supply: 3.65 billion LBLOCK Ranking on Coinmarketcap: #4283 Resistance: $0.0001690, $0.0001720, $0.0001750 Support: $0.0001660, $0.0001630, $0.0001600 From the 4-hour chart it is portrayed that bulls are very much active. This is revealed as the bulls seem to have been on a winning streak, after price action tested the floor of the Bollinger indicator. Additionally, price activity seems to have found support at the MA line. Consequently, this implies that we are more likely to witness additional upside moves in Lucky Block price. Also, the RSI continues to portray more optimism, as its faster line has reached the 100 level while the slower one is still at 75 levels. At this point, we can anticipate more moves in this market. Here on the 1-hour chart, we can see that price candles bounced off the Bollinger band but soon resumed their upward path. Subsequently, this resulted in to price rising higher and has placed price further above the MA line. Likewise, the RSI lines are now in the overbought region with the two lines seem positioned to continue in that region. Technically, market signs are aligned to portray possible additional upward move in the price above the $0.0001700. More like what we have here on the LBLOCK market, there is another crypto called the Impact Token. Its presale is still ongoing and has raised approximately $13 million within weeks of its presale. This is because the token is eco-friendly and is attractive to investors, as a result, this supplies bullish sentiment to the token. Also, recently we’ve witnessed the collapse of some crypto like the Terra LUNA and the most recent FTX collapse. Consequently, this makes it important for traders to be equipped with the best intelligent trading tools, and this is where the comes in. This platform is intelligent and able to find out adverse problems with cryptos: like what happened to the above-mentioned crypto. Consequently, this helps investors and traders to spot safe opportunities for nice gains. Also, the D2T presale is still on and has raised $6.5 and interested individuals can still plug into its system You can purchase Lucky Block here.",
    "pubDate": "2022-11-21 05:25:13",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Set to 'move forward,' Kyrie returns as Nets roll",
    "link": "https://www.espn.com/nba/story/_/id/35072600/irving-set-move-forward-nets-winning-return?device=featurephone",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "Brooklyn guard Kyrie Irving returned to the lineup Sunday, finishing with 14 points and five rebounds in 26 minutes as Nets defeated the Memphis Grizzlies 127-115, and said afterward that he's relieved he \"can move forward with the rest of the season.\"",
    "content": null,
    "pubDate": "2022-11-21 05:20:11",
    "image_url": null,
    "source_id": "espn",
    "country": [
      "united states of america",
      "united kingdom",
      "india",
      "australia",
      "singapore",
      "canada"
    ],
    "category": [
      "sports"
    ],
    "language": "english"
  },
  {
    "title": "Taylor Swift makes history at AMAs, wins fan-voted artist of the year amid Eras Tour ticket fiasco",
    "link": "https://www.foxnews.com/entertainment/taylor-swift-makes-history-amas-wins-fan-voted-artist-year-amid-eras-tour-ticket-fiasco",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "Taylor Swift won six American Music Awards, including artist of the year, pop album and music video. Swift skipped the red carpet after the Ticketmaster fiasco.",
    "content": null,
    "pubDate": "2022-11-21 05:19:40",
    "image_url": null,
    "source_id": "foxnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Tether Or Binance’s Failure Could Mark The End Of Cryptocurrency – Dogecoin Founder",
    "link": "https://coinpedia.org/opinion/tether-or-binances-failure-could-mark-the-end-of-cryptocurrency-dogecoin-founder/",
    "keywords": [
      "Opinion",
      "Crypto news",
      "Cryptocurrency"
    ],
    "creator": [
      "Qadir AK"
    ],
    "video_url": null,
    "description": "The post Tether Or Binance’s Failure Could Mark The End Of Cryptocurrency – Dogecoin Founder appeared first on Coinpedia Fintech News To allay the concerns of global investors Dogecoin’s founder, Shibetoshi Nakamoto believes that the collapse of either the cryptocurrency exchange Binance or the stablecoin issuer Tether might drastically shake up the entire market. He now has some sound guidance for seasoned investors. He contends that it is preferable to learn about and comprehend the elements …",
    "content": "The post Tether Or Binance’s Failure Could Mark The End Of Cryptocurrency – Dogecoin Founder appeared first on Coinpedia Fintech News To allay the concerns of global investors Dogecoin’s founder, Shibetoshi Nakamoto believes that the collapse of either the cryptocurrency exchange Binance or the stablecoin issuer Tether might drastically shake up the entire market. He now has some sound guidance for seasoned investors. He contends that it is preferable to learn about and comprehend the elements of the digital asset market before participating to prevent massive financial losses.  Apparently, if either Binance or Tether goes down, it might be “Game Over for Crypto,” according to Dogecoin co-creator Billy Markus (also known as Shibetoshi Nakamoto). The American software engineer also outlined that an increasing number of people have realized that too much centralization is a “big weakness.” “It’s great that more of you are finally finding out what this whole thing is and how the centralized stuff is a huge ol’ vulnerability, but it was like this when you bought too, so don’t worry about the collapse of Binance and/or Tether.” Nakamoto’s speculation was shared by a number of people, including Jack Dorsey, ex-CEO of Twitter. He referred to the possibility of a meltdown as “game over for the games,” meaning that it would be impossible to continue playing. game over for the games, certainly.— jack (@jack) November 16, 2022 Moreover, Markus is certain that this situation would definitely provoke a “bigger than projected Monday market meltdown.” Cryptocurrency investors have historically responded to disruptions like the recent FTX debacle by selling off their holdings in the market in a frenzy. As a result of all this doubt, some people have even declared Bitcoin “dead.” Does Bitcoin Stand A Chance? According to the analyst’s assessment, the leading cryptocurrency is still active and growing in popularity around the world despite having “died” more than 460 times. As a result of its restricted supply, it has become legal tender in countries with struggling economies such as El Salvador and the Central African Republic, and many investors see it as a way to protect themselves from inflation. Binance Is Secure, Claims Zhao  Many market participants anticipated that the FTX issue would trigger a domino effect and pull other exchanges into the muck, however, the reality was different and the impact wasn’t as bad.  The largest cryptocurrency exchange, Binance, on the other hand, confirmed that its financial sheet was stable and even increased the amount of its Secure Asset Fund for Users (SAFU) to $1 billion to protect users in a catastrophe. In addition, the corporation established a recovery fund for the industry, which is intended to assist projects that are having difficulty during difficult economic times. To disprove the allegations, CEO Zhao publicly said that Binance is establishing an industry recovery fund to assist projects that are otherwise robust but are experiencing a liquidity problem. This will serve to lessen the negative effects of FTX that will continue to cascade. We’ll have more information soon.  Meanwhile, he issued a challenge to anyone seeking additional information to get in touch with Binance Labs.",
    "pubDate": "2022-11-21 12:38:09",
    "image_url": null,
    "source_id": "coinpedia",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "IMMOPET token(IMPT) used as game currency for Australian P&P’s bulldog racing game ‘BET DOG’",
    "link": "https://www.crypto-reporter.com/press-releases/immopet-tokenimpt-used-as-game-currency-for-australian-pps-bulldog-racing-game-bet-dog-39109/",
    "keywords": [
      "Press Releases"
    ],
    "creator": [
      "David Bryan"
    ],
    "video_url": null,
    "description": "Amitos, the publishing foundation of IMMOPET token(IMPT), and P&P Entertainment of Australia (P&P) announced that P&P used IMMOPET token to create a blockchain economic structure for the Bulldog racing game BET DOG, which is scheduled to be serviced, and signed an MOU on the 24th. Amitos is a company that is promoting the development of […] The post IMMOPET token(IMPT) used as game currency for Australian P&P’s bulldog racing game ‘BET DOG’ appeared first on Crypto Reporter.",
    "content": "Amitos, the publishing foundation of IMMOPET token(IMPT), and P&P Entertainment of Australia (P&P) announced that P&P used IMMOPET token to create a blockchain economic structure for the Bulldog racing game BET DOG, which is scheduled to be serviced, and signed an MOU on the 24th. Amitos is a company that is promoting the development of solutions using blockchain in various areas such as games, digital IDs, licenses, certificates, and arts. To this end, the existing blockchain cryptocurrency’s ecosystem approach will be innovatively improved by using the IMMOPET token. “This agreement with Australia P&P is an opportunity to show the infinite possibilities of IMPT,” a spokesperson for Amitos said. “We are currently receiving love calls from various game companies that want to introduce a blockchain ecosystem in the game, so we expect to cooperate with additional game developers.” BET DOG, a Bulldog racing game to which IMPT will be applied, is a racing game that introduces NFT and blockchain, and will provide various designed Bulldog NFTs while showing dynamic racing scenes. “We will develop continuous blockchain games to introduce IMPT and establish our position as a development partner that plays a leading role in the IMPT ecosystem,” P&P CEO said, explaining that the introduction of BET DOG’s immopet token is a very early stage cooperation. He also said, “We will make efforts to provide differentiated content and a different blockchain experience to consumers through this agreement with Amitos.” Currently, IMMOPET Token is listed on the global exchange, and information can also be found on CoinMarketCap. Media Contact: Email: team@amios.net Company: AMITOS co.,Ltd.. Contact Person: JOON JUNG Website : https://amitos.net/ Country: CAMBODIA The post IMMOPET token(IMPT) used as game currency for Australian P&P’s bulldog racing game ‘BET DOG’ appeared first on Crypto Reporter.",
    "pubDate": "2022-11-21 12:36:47",
    "image_url": null,
    "source_id": "cryptoreporter",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Billionaire Bill Ackman Does U-Turn on Crypto, Reveals Helium Investment",
    "link": "https://decrypt.co/115176/billionaire-bill-ackman-does-u-turn-on-crypto-reveals-helium-investment",
    "keywords": [
      "Business"
    ],
    "creator": [
      "Tim Hakki"
    ],
    "video_url": null,
    "description": "The billionaire founder of Pershing Square revealed that he’s a “small direct investor” in crypto projects including wireless network Helium.",
    "content": null,
    "pubDate": "2022-11-21 12:34:00",
    "image_url": "https://img.decrypt.co/insecure/rs:fill:1024:512:1:0/plain/https://cdn.decrypt.co/wp-content/uploads/2022/11/helium-hnt-gID_1.jpg@png",
    "source_id": "decrypt",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Shiba Inu Sees 92% Spike in Trading Volume as Large Transactions Rise",
    "link": "https://u.today/shiba-inu-sees-92-spike-in-trading-volume-as-large-transactions-rise",
    "keywords": null,
    "creator": [
      "Tomiwabold Olajide"
    ],
    "video_url": null,
    "description": "Shiba Inu large holders are making moves on market",
    "content": null,
    "pubDate": "2022-11-21 12:34:00",
    "image_url": null,
    "source_id": "utoday",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Bitcoin falls to $16k as crazy rumors hit market – Is the bottom in or will BTC drop to $13k?",
    "link": "https://www.crypto-news-flash.com/bitcoin-falls-to-16k-as-crazy-rumors-hit-market-is-the-bottom-in-or-will-btc-drop-to-13k/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-falls-to-16k-as-crazy-rumors-hit-market-is-the-bottom-in-or-will-btc-drop-to-13k",
    "keywords": [
      "News",
      "Bear market",
      "Bearish",
      "Bitcoin",
      "Bitcoin price",
      "BTC"
    ],
    "creator": [
      "Olivia Brooke"
    ],
    "video_url": null,
    "description": "According to analyst Benjamin Cowen, BTC could be flashing a bottom signal. Amid rumors threatening to drop BTC to $13k, market participants are still long-term bullish. While several foreboding rumors making the rounds in the crypto market have seen the price of Bitcoin (BTC) dump to less than $16,000, analysts are still confident that the [...] Der Beitrag Bitcoin falls to $16k as crazy rumors hit market – Is the bottom in or will BTC drop to $13k? erschien zuerst auf Crypto News Flash.",
    "content": "According to analyst Benjamin Cowen, BTC could be flashing a bottom signal. Amid rumors threatening to drop BTC to $13k, market participants are still long-term bullish. While several foreboding rumors making the rounds in the crypto market have seen the price of Bitcoin (BTC) dump to less than $16,000, analysts are still confident that the pioneer digital currency could have reached a cyclical bottom. According to popular crypto market analyst Benjamin Cowen, the BTC percentage of supply in profit and loss metric is flashing signs of a historical bottom for the asset. He told his over 774,000 YouTube subscribers that the metric is one of his favorites as it shows the ebb and flow of the market during bear and bull markets. In previous years including 2011, 2014, 2015, 2018, and 2019 when this metric crossed over the 30-day moving average, it accurately marked the bottom of the BTC market. One of my favorite on-chain indicators is the Bitcoin percentage of supply in profit and loss. The reason I like this one is because of how cyclical it looks – the ebb and flow of this indicator… If you apply the [30-day] moving average to [the Bitcoin percentage of supply in profit and loss]… what you’ll notice is that historically, they have always crossed before the bottom was in, His analysis is coming at a time when the price of BTC has hit $15,800 for the first time since 2020. According to an analysis by Santiment, the drop was thanks to fear, uncertainty, and doubt (FUD) due to a lack of trust in exchanges, especially since the FTX exchange collapsed. Exacerbating the situation is the roster of firms that have been run aground or are likely to suffer losses. One of these that have been rumored to be in trouble is Digital Currency Group (DCG), the parent company of Genesis and Grayscale. Read More: BREAKING: DCG didn’t find investors, will Bitcoin and the whole crypto market implode? Report Another FUD-creating event that is shaking the market is the movement of crypto assets in the wallet of the hacker of the FTX exchange. Blockchain security firm Chainalysis said in a tweet that the FTX hacker has been bridging ETH to BTC. The notice added that the asset is likely to be mixed as the hacker may attempt to cash out through exchanges. 🚨1/ Funds stolen from FTX are on the move and exchanges should be on high alert to freeze them if the hacker attempts to cash out — Chainalysis (@chainalysis) November 20, 2022 Market analyst still sees a price explosion for BTC in early 2023 Amid the various speculations that BTC could drop to as low as $13,000, analysts are still long-term bullish for the benchmark crypto. Billionaire venture capitalist Tim Draper said in a recent interview that he still expects BTC to reach $250,000 by early 2023, sticking to his prediction from last year. Draper said that he expects the price target to be reached once the market recovers from the massive FUD and people, especially women, start using Bitcoin for daily shopping. He noted that women’s interest in crypto is already showing signs of increasing, having recently grown from controlling 7.14 percent of Bitcoin wallets to 16.6 percent. Der Beitrag Bitcoin falls to $16k as crazy rumors hit market – Is the bottom in or will BTC drop to $13k? erschien zuerst auf Crypto News Flash.",
    "pubDate": "2022-11-21 12:31:52",
    "image_url": null,
    "source_id": "cryptonewsflash",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Ben Armstrong Says ‘Crypto is Not Dead’, Supports With Evidence",
    "link": "https://coinpedia.org/opinion/ben-armstrong-says-crypto-is-not-dead-supports-with-evidence/",
    "keywords": [
      "Opinion",
      "Crypto news",
      "Cryptocurrency"
    ],
    "creator": [
      "Qadir AK"
    ],
    "video_url": null,
    "description": "The post Ben Armstrong Says ‘Crypto is Not Dead’, Supports With Evidence appeared first on Coinpedia Fintech News The FTX crisis and the lowest levels of Bitcoin trading have led to the widespread belief that the crypto industry is dead. Top YouTuber Ben Armstrong, better known as Bitboy, said that cryptocurrency is not dead and will not be, regardless of what happens next. In 2022, Bitcoin has dramatically decreased in value from its …",
    "content": "The post Ben Armstrong Says ‘Crypto is Not Dead’, Supports With Evidence appeared first on Coinpedia Fintech News The FTX crisis and the lowest levels of Bitcoin trading have led to the widespread belief that the crypto industry is dead. Top YouTuber Ben Armstrong, better known as Bitboy, said that cryptocurrency is not dead and will not be, regardless of what happens next. In 2022, Bitcoin has dramatically decreased in value from its all-time high of $69,000 reached in November 2021, having lost 76% of its value in a single year. Crypto is not dead. NO MATTER what happens with GBTC/Genesis/Silvergate.., remember this:When $BTC was barely relevant Mtgox was hacked. 90% of Bitcoin transactions happened there. Almost the entire market at one place… gone… poof.And we survived and thrived.— Ben Armstrong (@Bitboy_Crypto) November 19, 2022 He uses the failure of Mt. Gox, one of the biggest Bitcoin exchanges at the time, as evidence, claiming that the market rebounded well. The Mt. Gox exchange crashed in February 2014 as a result of a major 840,000 BTC hack. A record-breaking high of about $1,100 had been reached by Bitcoin only a few months prior, and Mt. Gox accounted for the majority of transactions—about 90%—at that time. Ben Armstrong predicted the FTX crash? Ben came close to predicting what would occur days in advance, though, so it is important to note that. “If you don’t close your FTX account today and get your funds off that exchange ASAP, I’m sorry, but you are the definition of low IQ and deserve what’s going to happen to you.” And two weeks later, after everything unraveled, FTX CEO Sam Bankman-Fried told his clients he was, quote, “really sorry we ended up here,” he had said on Twitter. If you don’t close your @FTX_Official account today and get your funds off that exchange ASAP… I’m sorry but you are the definition of Low IQ and you deserve what’s going to happen to you.— Ben Armstrong (@Bitboy_Crypto) October 29, 2022 Armstrong specifically said that Sam Bankman-Fried is urging lawmakers to pass legislation that would rigorously control the cryptocurrency industry. He also pledged to reveal many additional wrongdoings committed by SBF. Additionally, Bitboy asserted that FTX was taking advantage of its users in late October when the exchange’s API was abused. The blogger had already made disparaging remarks about both the exchange and its leader, Bankman-Fried, before the entire incident.",
    "pubDate": "2022-11-21 12:25:10",
    "image_url": null,
    "source_id": "coinpedia",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Tuition Coin Incentives Global Educational Content With Cardano Technology",
    "link": "https://www.crypto-news-flash.com/tuition-coin-incentives-global-educational-content-with-cardano-technology/?utm_source=rss&utm_medium=rss&utm_campaign=tuition-coin-incentives-global-educational-content-with-cardano-technology",
    "keywords": [
      "News",
      "Press release"
    ],
    "creator": [
      "chainwire"
    ],
    "video_url": null,
    "description": "Delhi, India, 21st November, 2022, Chainwire Tuition Coin aims to enhance the appeal of the Cardano ecosystem through its Teach to Earn nature. The venture will streamline participation in educational technology, benefiting students and teachers alike. Tuition Coin is created by the Crystal Chain team and brings Teach to Earn to the Cardano blockchain. Teachers [...] Der Beitrag Tuition Coin Incentives Global Educational Content With Cardano Technology erschien zuerst auf Crypto News Flash.",
    "content": "Delhi, India, 21st November, 2022, Chainwire Tuition Coin aims to enhance the appeal of the Cardano ecosystem through its Teach to Earn nature. The venture will streamline participation in educational technology, benefiting students and teachers alike. Tuition Coin is created by the Crystal Chain team and brings Teach to Earn to the Cardano blockchain. Teachers can tap into a new ecosystem free from being underpaid and overworked. Instead, they can explore cryptocurrency rewards by contributing to the global educational space. Any teacher globally can become part of the Tuition Coin initiative. All they need to do is register on the Coins for College platform and verify their identity through a Know-Your-Customer (KYC) process. Following the approval, they can begin creating educational content and earn cryptocurrency rewards by sharing knowledge. In addition, existing online content and lessons can be incorporated to build Tuition Coin’s open information sphere. All content provided through the Coins for College platform is accessible free of charge to students. That positions Tuition Coin as a leading initiative to promote equality to high-quality educational resources and materials. It is a much-needed solution to the educational gaps that remain in place today. Furthermore, students who complete lessons and tasks will earn Scholarship Points, allowing their overall progress to be measured through a streamlined system. Although the SAT system exists already, its influence is waning, and a new global standard for education is in high demand. Tuition Coin has a maximum supply of 100 billion TUIT coins. Sixty percent is reserved for educators and can only be earned through contributions to the Coins for College platform. Teachers receive identical incentives for content regardless of whether it is newly created or imported existing material. However, all content must meet the 1EdTech standards to ensure it is suitable for remote learning. Follow us for the latest crypto news! window.coinzilla_display = window.coinzilla_display || []; var c_display_preferences = {}; c_display_preferences.zone = \"277607dd63990fae550\"; c_display_preferences.width = \"728\"; c_display_preferences.height = \"90\"; coinzilla_display.push(c_display_preferences); With TUIT, teachers can supplement their income and give more students global access to educational resources. In addition, all content on the platform can be shared freely as it will meet age-appropriate guidelines based on the student’s country’s educational requirements. About Tuition Coin Tuition Coin is the cryptocurrency that powers the Coins For College platform. Created by Crystal Chain, Tuition Coin forms a key part of the reward mechanism for teachers creating content and lesson plans. Students can access the content for free using the Coins For College platform and will be awarded Scholarship Points upon completing modules and assessments. These Scholarship Points will serve as a measurement tool to identify promising and deserving students who desire to pursue further education, but may lack the financial resources to do so. Visit the Tuition Coin website to learn more about how you as an educator can get involved in shaping the future of generations to come. Join the community on Facebook, Twitter and Instagram for the latest updates within the TUIT and Coins For College ecosystem Website | Facebook | Twitter | Instagram Contact Aman Kumar info@crystalchain.org",
    "pubDate": "2022-11-21 12:18:11",
    "image_url": null,
    "source_id": "cryptonewsflash",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Ethereum Whale Worth 720,000 ETH Wakes up to Make These Manipulations: Details",
    "link": "https://u.today/ethereum-whale-worth-720000-eth-wakes-up-to-make-these-manipulations-details",
    "keywords": null,
    "creator": [
      "Gamza Khanzadaev"
    ],
    "video_url": null,
    "description": "Ethereum whale worth $817 million reactivates after being dormant for two years",
    "content": null,
    "pubDate": "2022-11-21 12:18:00",
    "image_url": null,
    "source_id": "utoday",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "The Community Traces 317K BTC As It Attempts To Identity Grayscale Reserves",
    "link": "https://thecryptobasic.com/2022/11/21/the-community-traces-317k-btc-as-it-attempts-to-identity-grayscale-reserves/?utm_source=rss&utm_medium=rss&utm_campaign=the-community-traces-317k-btc-as-it-attempts-to-identity-grayscale-reserves",
    "keywords": [
      "Crypto News",
      "Market",
      "Bitcoin",
      "BTC",
      "Grayscale"
    ],
    "creator": [
      "Ammara"
    ],
    "video_url": null,
    "description": "The community takes things into its hands as Grayscale refuses to provide proof of Reserve. @ErgoBTC, AKA Ergo, a blockchain researcher with OXT Research, disclosed findings from a community-led effort to trace Grayscale’s Bitcoin Trust (GBTC) reserves in a Twitter thread yesterday. Grayscale GBTC Trust, the largest legal holder of BTC, refuses to provide any […] The post The Community Traces 317K BTC As It Attempts To Identity Grayscale Reserves first appeared on The Crypto Basic.",
    "content": "The community takes things into its hands as Grayscale refuses to provide proof of Reserve. @ErgoBTC, AKA Ergo, a blockchain researcher with OXT Research, disclosed findings from a community-led effort to trace Grayscale’s Bitcoin Trust (GBTC) reserves in a Twitter thread yesterday. Grayscale GBTC Trust, the largest legal holder of BTC, refuses to provide any Proof of Reserve. To begin a community lead effort at transparency for the GBTC holdings, we have taken steps to ID likely GBTC addresses and balances based on public info and blockchain forensics. pic.twitter.com/WFtOyoCEay — 🏴∴Ergo∴🏴 (@ErgoBTC) November 20, 2022 Per the analysis, Ergo reveals that they have identified 432 addresses holding about 317,705 BTC, likely part of the GBTC reserves. It is worth noting that the team started its analysis around July 2019, when Grayscale moved custody of its assets to Coinbase from Xapo. Grayscale declined to release a proof-of-reserves in response to community demands citing security concerns inspiring the effort from Ergo. In the wake of the FTX collapse, the crypto community speculates that Digital Currency Group, the parent company of Genesis Trading, Grayscale, and CoinDesk, is the next domino to fall. It comes after Genesis Trading, arguably crypto’s biggest lender announced its decision to halt operations despite receiving a capital infusion from DCG to cater for the loss of $175 million in assets in the FTX collapse. However, a Wall Street Journal report cites illiquid assets in its balance sheet as the reason for halting withdrawals. The report also indicates it sought $1 billion in capital to resume operations. Genesis is seen as the go-to for institutions and whales looking to lend crypto to earn yield. Consequently, several industry pundits have asserted that a Genesis collapse could have a bigger ripple effect than FTX. Already, Gemini has been forced to halt its earn program. In light of recent information, users speculate DCG itself may be insolvent. According to North Rock Digital founder Hal Press, the size of funds required indicates that the liability lies with DCG . Consequently, users have also called to question the health of the Grayscale trust. Notably, Coinbase released a letter today to assure users of the safety of Grayscale assets in its cold storage wallets. “Coinbase Custody Trust Company, LLC (Coinbase Custody) writes to you to reaffirm that the assets underlying all of Grayscale’s digital asset products held at Coinbase Custody, as listed in the table below, are secure,” Furthermore, it asserts that each user’s assets are kept separately to avoid mixing user assets. “Coinbase Custody always ensures that each client’s digital assets are segregated on-chain, in deep cold-storage, from both the property of Coinbase Custody and the assets of other Coinbase Custody clients,” Coinbase writes. “This means that the digital assets underlying each Grayscale product will never be commingled with or confused for the digital assets of any other client. This also means that the digital assets of each Grayscale product can be confirmed on-chain.” Despite these assurances, the community continues to frown at the refusal of the exchange to reveal the wallet addresses. Messari founder Ryan Selkis in a tweet today, asserted that this week is likely to be a turbulent one for DCG and its subsidiaries. GBTC continues to trade at a 43% discount to the actual Bitcoin price indicating investor bearishness. Disclaimer: The content is for informational purposes only, may include the author's personal opinion, and does not necessarily reflect the opinion of TheCryptoBasic. All Financial investments, including crypto, carry significant risk, so always do your complete research before investing. Never invest money you cannot afford to lose; the author or the publication does not hold any responsibility for your financial loss or gains.",
    "pubDate": "2022-11-21 12:16:05",
    "image_url": null,
    "source_id": "thecryptobasic",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Ren Protocol (REN) 'Only Has Funding' for Five Weeks Left, Here's Why",
    "link": "https://u.today/ren-protocol-ren-only-has-funding-for-five-weeks-left-heres-why",
    "keywords": null,
    "creator": [
      "Vladislav Sopov"
    ],
    "video_url": null,
    "description": "Ren Protocol (REN), one of oldest decentralized protocols, shares sad announcement for its community",
    "content": null,
    "pubDate": "2022-11-21 12:05:00",
    "image_url": null,
    "source_id": "utoday",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  }
]
