[
  {
    "title": "Solana NFT Protocol Metaplex Announces Layoffs in Wake of FTX Collapse",
    "link": "https://decrypt.co/115002/solana-nft-protocol-metaplex-announces-layoffs-ftx-collapse",
    "keywords": [
      "NFTs"
    ],
    "creator": [
      "Sander Lutz"
    ],
    "video_url": null,
    "description": "While it had no financial exposure to the fallen exchange, Metaplex appears to be suffering from reputational damage spreading to Solana.",
    "content": null,
    "pubDate": "2022-11-18 02:01:59",
    "image_url": "https://cdn.decrypt.co/resize/1024/height/512/wp-content/uploads/2022/09/metaplex-logo-gID_6.png",
    "source_id": "decrypt",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "California Democratic Rep. Porter Reelected After Tough Race",
    "link": "https://www.usnews.com/news/us/articles/2022-11-17/california-democratic-rep-porter-reelected-after-tough-race",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 01:57:26",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Nancy Pelosi Reflects On the Not-Quite-End of An Era",
    "link": "https://time.com/6234982/nancy-pelosi-interview-legacy/",
    "keywords": [
      "Uncategorized",
      "Congress",
      "democrats",
      "uspoliticspolicy"
    ],
    "creator": [
      "Molly Ball"
    ],
    "video_url": null,
    "description": "An interview with the outgoing House Speaker",
    "content": "Ever since the election, Nancy Pelosi says, congressional Democrats have been begging her to remain as their leader. Of course, she knew what they were really doing: currying favor, just in case. “Our members were just exploding my phone to stay,” she says, “which is a nice thing, because if I don’t stay, then they’ve gotten the points for saying ’stay,’ and if I do—“ she trailed off, laughing. No matter what she decided, they knew it would be in their interest to be on her good side going forward. For two decades, it has been in every congressional Democrat’s interest to stay in Pelosi’s good graces. Since winning her first leadership position in 2001, she has ruled the House Democratic caucus with an iron fist and a velvet glove, keeping her fractious party in near-lockstep during historically tumultuous times. From the Iraq War to the financial crisis, through health-care reform and government shutdowns, through two presidential impeachments, a pandemic and an insurrection attempt, she has been a constant force and consummate operator. No national politician of her era can match her combination of legislative prowess, vote-counting savvy, negotiating skill, and fundraising ability. [time-brightcove not-tgx=”true”] On Thursday, it was finally time to move on—sort of. Shortly after noon, she gave a brief speech on the House floor, announcing that she would not seek re-election as leader of the House Democrats. It was time, she said, “for a new generation to lead the Democratic caucus that I so deeply respect.” Yet she couldn’t bring herself to step away completely: she owed it to her constituents in San Francisco, she said, to stay on as a rank-and-file member of Congress and finish her two-year term. Like the man who fakes his own death and then sneaks into the funeral, she would stick around to see how her people tried to get along without her. Chip Somodevilla—Getty ImagesNancy Pelosi waves to colleagues while being nominated as the next Speaker of the House during a swearing in ceremony for the 110th Congress in the House Chamber of the U.S. Capitol in Washington, DC., on Jan. 4, 2007. Just after her speech, the 82-year-old House Speaker sat at a white-clothed table in a small, ornate room off the House floor known as the Board of Education, a hidden chamber where former Democratic Speaker Sam Rayburn used to hole up and relax. Then-vice president Harry Truman was playing cards with Rayburn here in 1945 when he learned that FDR had died and he would become President. One wall Rayburn had painted with a Texas seal; on two others, Pelosi recently added her own touches: a painting of the Golden Gate Bridge, and a tribute to women’s suffrage. Pelosi was contemplating the not-quite-end of the era and struggling to unwrap a package of chocolate-chip cookies. “What was important to me was how we did in the election, because we were on a bad path,” she told a small group of reporters. “Storming the Capitol, really? And the reaction of Republicans, not taking a stand? And I knew we could win.” Her party had just lost the House, weeks after a crazed intruder broke into her California home and bludgeoned her husband with a hammer. But it hardly felt as if Pelosi was giving up in defeat. In an election that history and many forecasters predicted would deliver a Republican wave, Democrats surprisingly held their own. The resulting GOP majority will be a narrow one, with the Senate remaining in Democrats’ hands. The Oct. 28 attack on Paul Pelosi, the Speaker’s husband of 59 years, influenced her decision to remain in Congress, but not in the way many people thought. “It was not, ‘Oh, well, since they did that, I can’t even think of something else,’” she says. “No, it had the opposite effect. I couldn’t give them that satisfaction.” Read More: Nancy Pelosi Doesn’t Care What You Think Of Her. This steely tenaciousness, this refusal to let others decide her path, is a running theme of my biography of Pelosi. It has been the hallmark of her political career, from forcing her way into the male-dominated ranks of congressional leadership to standing up to former President Donald Trump. As the youngest child and only daughter of three-term Baltimore mayor Thomas D’Alessandro, politics was in Pelosi’s blood; she first set foot on the House floor as a young child, when her father was serving in Congress. But when she finally ran for office herself at the age of 47—after raising five children and serving for decades as a political fundraiser, strategist and volunteer—it was from a different coast, under a different name, with a political identity all her own. Deanne Fitzmaurice—San Francisco Chronicle/Getty ImagesNancy Pelosi at election headquarters on primary election night, on April 7, 1987. Ask Pelosi about her legacy, and the first thing she’ll mention is the Affordable Care Act. However flawed and incomplete the 2010 law’s guarantee of universal access to health care may have proven, it represented the fulfillment of a century of liberal aspirations, and the pinnacle of Pelosi’s legislative craft. She moved mountains to get it through the House, at one point nearly breaking down in tears as she begged a group of liberal feminists to swallow an unsavory compromise on abortion funding. Then, after a special election robbed Democrats of their supermajority in the Senate, she urged then-President Obama not to give up on the historic legislation. “If the gate’s closed, you go over the fence,” she said at the time. “If the fence is too high, we’ll pole-vault in. If that doesn’t work, we’ll parachute in. But we’re going to get health-care reform passed for the American people.” Though most of the drama around the bill’s passage revolved around the Senate, it never could have happened without Pelosi’s determination and drive. Win McNamee—Getty ImagesSpeaker of the House Nancy Pelosi stands behind President Barack Obama as he signs the Affordable Health Care for America Act during a ceremony with fellow Democrats in the East Room of the White House on March 23, 2010. She did it knowing there might be a political cost, and indeed there was. Republicans gained 63 seats in the House in the 2010 midterm elections, an election in which Pelosi was a central figure. Republicans made her the subject of millions of dollars’ worth of attack ads across the country, capitalizing on their base’s visceral loathing of her and giving Peosi unusual prominence for a congressional leader. But Pelosi believed in gaining power not for its own sake but in order to do something with it. Obamacare is part of a legacy that includes two decades of liberal policy victories, from allowing gay people to serve openly in the military to the historic climate investments of this year’s Inflation Reduction Act. “This is a very difficult job,” she told us. “You have to really know how to be a legislator.” These legislative successes were all the more remarkable for the era in which they came. Faced with unrelenting Republican opposition, she held together the diverse Democratic caucus and drove a hard bargain in negotiations across the aisle. After Donald Trump became president, she led her party back to power, becoming Speaker for the second time in 2019 in the middle of a government shutdown over border-wall funding. Pelosi refused to budge, and Trump soon capitulated. She would go on to impeach him twice while simultaneously negotiating with his Administration to secure trillions in COVID-19 relief funding. Read More: Why Nancy Pelosi Is Going All In Against Trump. Pelosi rejects the notion that she bears any blame for the toxic state of politics. “I don’t take any responsibility for what the Republicans have done to the Congress. This is not about gridlock,” she says. “This isn’t about some sort of equivalence between Democrats and Republicans. They are anti-science, anti-government, and that’s where they are.” The GOP’s lack of decency was apparent in many Republicans’ reaction to her husband’s attack, Pelosi says. “Just think if your spouse were in that situation and people would make a joke of it, like it was funny,” she added. “Collecting money for bail for the perpetrator, putting out a conspiracy theory about what it was about. It’s so horrible to think that the Republican Party has come down to this.” This attitude, she says, was part of what voters recoiled from the midterms. Mark Wilson—Getty Images (2); Chip Somodevilla—Getty Images; Jim Watson—Pool/AFP/Getty Images Pelosi never groomed a successor, something for which she was often criticized. Ambitious Democrats languished for decades waiting for an opening in House leadership. She has often expressed the view that power is never given but must be taken by those who seek it. “I didn’t think that was the right approach, to anoint somebody,” she told us Thursday. “It’s really important for people to have the legitimacy that they were chosen by the members.” A free-for-all appears unlikely. Pelosi’s longtime deputy Steny Hoyer, a fellow Marylander who has known her since they worked for the same Senator in 1963, announced Thursday that he would also stay in Congress but not in leadership. Rep. Hakeem Jeffries of New York, the 52-year-old chair of the Democratic caucus, appears almost certain to win the minority leader position in the Democratic leadership elections scheduled for Nov. 30, becoming the first Black man to lead a party in Congress. The first woman Speaker, in passing the torch, will make history once again. Pelosi intends to spend the next two years in valedictory mode. “My life ahead is full of thank-yous,” she says, to her constituents and all the others who have supported her over the years. She does not plan to serve on any committees and she does not want to serve as a sort of shadow speaker from the sidelines. “Thanksgiving is coming,” she says. “I have no intention of being the mother-in-law in the kitchen saying, ‘My son doesn’t like the stuffing that way, this is the way we make it in our family.’ They will have their vision. They will have their plan. It’s up to the caucus to decide which way they want to go.”",
    "pubDate": "2022-11-18 01:56:26",
    "image_url": null,
    "source_id": "timenextadvisor",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Rodgers, NFL Players Urge League to Nix Turf, Go With Grass",
    "link": "https://www.usnews.com/news/sports/articles/2022-11-17/rodgers-nfl-players-urge-league-to-nix-turf-go-with-grass",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 01:54:52",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Seoul: North Korea Fires Suspected Long-Range Missile",
    "link": "https://www.usnews.com/news/world/articles/2022-11-17/seoul-n-korea-fires-another-ballistic-missile-toward-sea",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 01:54:02",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Judge Wins AL MVP in Runaway; Goldschmidt Takes NL Prize",
    "link": "https://www.usnews.com/news/sports/articles/2022-11-17/cardinals-slugger-paul-goldschmidt-wins-nl-mvp-award",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 01:53:53",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Lengthy Vote Counts Frustrate, but Don't Signal Problems",
    "link": "https://www.usnews.com/news/politics/articles/2022-11-17/lengthy-vote-counts-frustrate-but-dont-signal-problems",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 01:47:46",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Blackstone Files for Nexus Mall REIT IPO at $3 Billion Value",
    "link": "https://www.bloomberg.com/news/articles/2022-11-18/blackstone-files-for-nexus-mall-reit-ipo-at-3-billion-value",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 01:44:58",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "John Stamos wants you to give Lori Loughlin a break, ok?",
    "link": "https://www.avclub.com/john-stamos-wants-you-to-give-lori-loughlin-a-break-ok-1849799325",
    "keywords": null,
    "creator": [
      "Peter Scobel"
    ],
    "video_url": null,
    "description": "Read more...",
    "content": null,
    "pubDate": "2022-11-18 01:22:00",
    "image_url": null,
    "source_id": "avclub",
    "country": [
      "united states of america"
    ],
    "category": [
      "entertainment"
    ],
    "language": "english"
  },
  {
    "title": "Bismarck Legacy stages furious comeback to top West Fargo and advance to Class A volleyball semifinals",
    "link": "https://www.inforum.com/sports/prep/bismarck-legacy-stages-furious-comeback-to-top-west-fargo-and-advance-to-class-a-volleyball-semifinals",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "After falling into a 2-0 hole, the Sabers clawed all the way back to top the Packers in five sets on Thursday.",
    "content": null,
    "pubDate": "2022-11-18 01:18:05",
    "image_url": null,
    "source_id": "inforum",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "How are Bitcoin Long-Term Holders Responding to the BTC Price Crash?",
    "link": "https://coinpedia.org/bitcoin/how-are-bitcoin-long-term-holders-responding-to-the-btc-price-crash/",
    "keywords": [
      "Bitcoin",
      "Bitcoin Price",
      "Crypto news",
      "Cryptocurrency",
      "Price Analysis"
    ],
    "creator": [
      "Elena R"
    ],
    "video_url": null,
    "description": "The post How are Bitcoin Long-Term Holders Responding to the BTC Price Crash? appeared first on Coinpedia Fintech News The Bitcoin price has continued to shrink in 2022 since Terra Luna initiated a significant crypto crash in Q1. The FTX and Alameda meltdown has stirred fresh selling pressure, which analysts expect to push through 2023. Moreover, confidence in centralized crypto exchanges has significantly slumped, which may push some to the insolvency route. According to …",
    "content": "The post How are Bitcoin Long-Term Holders Responding to the BTC Price Crash? appeared first on Coinpedia Fintech News The Bitcoin price has continued to shrink in 2022 since Terra Luna initiated a significant crypto crash in Q1. The FTX and Alameda meltdown has stirred fresh selling pressure, which analysts expect to push through 2023. Moreover, confidence in centralized crypto exchanges has significantly slumped, which may push some to the insolvency route. According to our latest crypto price oracles, Bitcoin is trading around $16,500, up from the recent lows of $15,900. The digital asset is trading 76 percent down from its ATH, $69k, set approximately a year ago. Long-term Bitcoin critic Peter Schiff thinks Bitcoin price is yet to bottom per the current sentiments. Shiff highlighted a scenario where long-term Bitcoin holders sell their bags to sustain themselves—adding that sooner than later, only long-term holders with sustainable paychecks will survive the shakeout. It didn't take long for this forecast to come true. The lion's share of the selling has not even started yet. #Bitcoin still has a long way to fall. https://t.co/dvNtGMIQHq— Peter Schiff (@PeterSchiff) November 17, 2022 Nonetheless, long-term Bitcoin holders are optimistic about the overall Btc market, which has significant adoption worldwide. Per on-chain data, long-term Bitcoin holders perceive the current bear market as similar to 2018 one. Glassnode explained: “Bitcoin Long-Term Holders are currently experiencing acute financial stress, holding an average of -33% in unrealized losses. This is comparable to the lows of the 2018 bear market, which saw a peak unrealized loss of -36% on average.” Notably, Glassnode data shows that crypto exchanges recorded a sharp uptick in withdrawals toward non-custodial platforms. Reportedly, cryptocurrency exchanges have seen one of the most significant net declines in aggregate BTC balance in history, falling by 72.9k BTC in 7 days. Glassnode Further Notes on Bitcoin Market Outlook Bitcoin (BTC) is a legal tender to two countries -El Salvador and the African Central Republic – and is regulated as a digital asset in many other jurisdictions. With a hard cap of 21 million Bitcoins and a halving to reduce the overall supply over time, market strategists are optimistic about its long-term success.  Nevertheless, global geopolitics and the prevailing macroeconomics continue to push Bitcoin prices to higher volatility. For instance, the ongoing war between Russia and Ukraine has significantly divided international regulators on using Bitcoin and other crypto assets.  Furthermore, western governments argue that Russia has used Bitcoin and other crypto assets to manoeuvre the set sanctions.  However, with the rising global inflation rate, which has significantly reduced fiat currencies’ purchasing power, Bitcoin and other digital assets are expected to record significant cash inflows.",
    "pubDate": "2022-11-18 06:28:00",
    "image_url": null,
    "source_id": "coinpedia",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Gokhshtein Says He’s Still Unofficial Leader of Shiba Inu",
    "link": "https://thecryptobasic.com/2022/11/18/gokhshtein-says-hes-still-unofficial-leader-of-shiba-inu/?utm_source=rss&utm_medium=rss&utm_campaign=gokhshtein-says-hes-still-unofficial-leader-of-shiba-inu",
    "keywords": [
      "Market",
      "Altcoins",
      "David Gokhshtein",
      "Shiba Inu"
    ],
    "creator": [
      "Lele Jima"
    ],
    "video_url": null,
    "description": "Gokhshtein insists he’s the unofficial leader of Shiba Inu. Prominent cryptocurrency influencer David Gokhshtein has reiterated again that he is the unofficial leader of Shiba Inu (SHIB). Gokhshtein’s recent claim comes less than two weeks after he declared himself as the unofficial Shiba Inu leader. In a tweet today, Gokhshtein said: “I’m still the unofficial leader […] The post Gokhshtein Says He’s Still Unofficial Leader of Shiba Inu first appeared on The Crypto Basic.",
    "content": null,
    "pubDate": "2022-11-18 06:25:05",
    "image_url": null,
    "source_id": "thecryptobasic",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Telefonica Plans Broad Spanish Price Hikes in Effort to Boost Sales",
    "link": "https://www.bloomberg.com/news/articles/2022-11-17/telefonica-plans-broad-spanish-price-hikes-in-bid-to-boost-sales",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 06:24:42",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "APT Price Soars 10% – Time To Buy APT?",
    "link": "https://insidebitcoins.com/news/apt-price-soars-10-time-to-buy-apt",
    "keywords": [
      "Cryptocurrency"
    ],
    "creator": [
      "Prateek Arora"
    ],
    "video_url": null,
    "description": "As we come across new stories and find how deep the FTX-debacle rabbit hole goes, we are also witnessing the values of crypto assets sinking [...]",
    "content": "As we come across new stories and find how deep the FTX-debacle rabbit hole goes, we are also witnessing the values of crypto assets sinking [...]",
    "pubDate": "2022-11-18 06:13:07",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Metaverse ‘explosion’ will be driven by B2B, not retail consumers: KPMG partner",
    "link": "https://cointelegraph.com/news/metaverse-explosion-will-be-driven-by-b2b-not-retail-consumers-kpmg-partner",
    "keywords": [
      "James Mabbott",
      "Alysse Sue",
      "KPMG Futures",
      "KPMG Origin",
      "Business Model",
      "Google Meet",
      "Microsoft Teams",
      "Zoom",
      "User Activity",
      "User Experience"
    ],
    "creator": [
      "Cointelegraph By    Brayden Lindrea"
    ],
    "video_url": null,
    "description": "KPMG's incoming Head of Metaverse Futures Alyse Sue said the objective is to build a multi-million dollar business opportunity for the firm by 2025.",
    "content": null,
    "pubDate": "2022-11-18 06:09:37",
    "image_url": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTEvNDg2ZjU3MWQtOTFhMi00OTJiLTllYmQtODdkMTM1MTI3MjU4LmpwZw==.jpg",
    "source_id": "cointelegraph",
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "title": "$250,000 per Bitcoin? Tim Draper Explains Why He Still Stands by His Bullish Prediction",
    "link": "https://u.today/250000-per-bitcoin-tim-draper-explains-why-he-still-stands-by-his-bullish-prediction",
    "keywords": null,
    "creator": [
      "Alex Dovbnya"
    ],
    "video_url": null,
    "description": "Prominent venture capitalist Tim Draper continues to stand by his uber-bullish Bitcoin price prediction",
    "content": null,
    "pubDate": "2022-11-18 06:08:21",
    "image_url": null,
    "source_id": "utoday",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Toon Finance DogeCoin Shiba Inu Coin Moon After Elon Musk Seals Twitter Purchase",
    "link": "https://coinpedia.org/press-release/toon-finance-dogecoin-shiba-inu-coin-moon-after-elon-musk-seals-twitter-purchase/",
    "keywords": [
      "PRESS RELEASE"
    ],
    "creator": [
      "Coinpedia"
    ],
    "video_url": null,
    "description": "The post Toon Finance DogeCoin Shiba Inu Coin Moon After Elon Musk Seals Twitter Purchase appeared first on Coinpedia Fintech News In the past few months, there has been a great deal of discussion over so-called “meme coins” like DOGE, of which Elon Musk claims to be a large admirer. Since his controversial purchase of Twitter, it has rocketed in popularity. What is a meme coin? A cryptocurrency that is based on or gets its inspiration …",
    "content": "The post Toon Finance DogeCoin Shiba Inu Coin Moon After Elon Musk Seals Twitter Purchase appeared first on Coinpedia Fintech News In the past few months, there has been a great deal of discussion over so-called “meme coins” like DOGE, of which Elon Musk claims to be a large admirer. Since his controversial purchase of Twitter, it has rocketed in popularity. What is a meme coin? A cryptocurrency that is based on or gets its inspiration from an online meme is called a meme coin. The most well-known example of a currency based on a meme is the DOGE, which was designed after the viral image of a Shiba Inu dog known as the “Doge” meme. Other examples of meme coins are UBQ and COIN, both of which are based on popular memes such as “Ubiquiti” and “Bitcoin,” respectively. The realm of virtual currencies is perpetually undergoing change, with new concepts and technology being presented on a consistent basis. The proliferation of meme coins is a relatively recent phenomenon in this sector.  The Support of DOGEcoin by Elon Musk and What It Means for Investors in Cryptocurrencies Elon Musk, CEO of both Tesla and SpaceX, has been a prominent booster of DOGEcoin, which has led to a significant increase in the price of the cryptocurrency. It is possible that there is more to Musk’s backing than meets the eye, despite the fact that some people assume he is just trying to capitalise on the current wave of excitement. In this article, we will discuss some of the reasons that Musk may have endorsed DOGEcoin, as well as what this support may represent for those who have invested in cryptocurrencies. There are a few different hypotheses to consider on the reasons why Elon Musk is such a vocal supporter of DOGEcoin. To begin, it is possible that he just really likes the coin, or that he has faith in its potential in the long run. Second, it is possible that he is trying to raise people’s knowledge about cryptocurrencies in general and the potential that they have as an investment. The third possibility is that he is attempting to create a buzz in order to artificially inflate the price of DOGEcoin (and make a profit in the process). It is important to note that Musk is not the only celebrity to endorse DOGEcoin; other celebrities, such as Snoop Dogg and Gene Simmons, have also shown their support for the cryptocurrency. It is possible that the price of DOGEcoin is being driven even higher by the increased attention it is receiving from high-profile personalities. It is impossible to overlook Elon Musk’s impact on the cryptocurrency market, regardless of whether you are an investor in cryptocurrencies or just someone who is inquisitive about the world of digital currencies. The price of the cryptocurrency has skyrocketed as a direct result of his public promotion of DOGEcoin.  Some people assume that he is simply trying to capitalise on the buzz around the cryptocurrency; however, there may be more to his endorsement than meets the eye. The impact that Musk’s continuous support will have on DOGEcoin and the cryptocurrency industry as a whole is something that can only be determined with the passage of time; nevertheless, one thing is certain: he is most certainly someone to keep an eye on. Toon Finance Decnetalized coins are beginning to attract media attention from all over the world as more and more celebrities from across the world enter the field of decentralised finance. Toon Finance is a brand new DEX platform that operates similarly to pancake swaps and will include support for the ERC20 blockchain. Toon Finance is a forward-thinking piece of software that has produced a sizable community of seasoned users, and anyone who is interested in joining the team can do so at no cost. Simply joining their Telegram channel and introducing yourself is all that is required of you at this point. Already having raised more than 2 million dollars in USD during the first week of their presale, Toon Finance is poised to become the Meme token of the year. After many months of planning and preparation, the long-delayed project can now be accessed by the general public. The following is a list of the distinguishing characteristics that set Toon Finance apart from other meme coins, such as Tamadoge and Shiba Inu: Uses the DEX Operating System as its base. The primary feature of the Toon Finance Protocol is that it is a decentralized exchange (DEX) platform. This is a unique characteristic because other meme coins on the market operate on centralized platforms. Toon Finance operates on the DEX to offer investors more security and peace of mind. One of the biggest advantages of the DEX system is that it does not have a central failure point that hackers can attack to harm the users. This is why investors can rest assured that their finances are safer. Another advantage of DEX is that it eliminates the need for a third party to act as a middleman in the transactions. Toon Finance / TFT Twitter / Toon Finance Telegram Disclaimer: This is a press release post. Coinpedia does not endorse or is responsible for any content, accuracy, quality, advertising, products, or other materials on this page. Readers should do their own research before taking any actions related to the company.",
    "pubDate": "2022-11-18 06:07:04",
    "image_url": null,
    "source_id": "coinpedia",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "8 things to do this weekend in Portland | Nov. 18-20",
    "link": "https://www.kgw.com/article/entertainment/events/portland-things-to-do/things-to-do-this-weekend-portland/283-24e02b89-ab21-4af2-b41f-c238284b8eaa",
    "keywords": [
      "portland-things-to-do",
      "entertainment",
      "events",
      "home"
    ],
    "creator": null,
    "video_url": null,
    "description": "The holiday spirit is definitely in the air. This weekend kicks off a few Christmas theme events, along with food and gift festivals.",
    "content": null,
    "pubDate": "2022-11-18 05:55:06",
    "image_url": "https://media.tegna-media.com/assets/KGW/images/f015c192-326b-448c-b30e-ff707d65ffdf/f015c192-326b-448c-b30e-ff707d65ffdf_750x422.jpg",
    "source_id": "kgw",
    "country": [
      "united states of america"
    ],
    "category": [
      "entertainment"
    ],
    "language": "english"
  },
  {
    "title": "Zerlina Zeng on China's Property Crisis (Radio)",
    "link": "https://www.bloomberg.com/news/audio/2022-11-18/zerlina-zeng-on-china-s-property-crisis-radio",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 05:54:34",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Bitcoin Price Prediction for Today, November 17: BTC Price Risks Further Decline as It Faces Rejection at $17K",
    "link": "https://insidebitcoins.com/news/bitcoin-price-prediction-for-today-november-17-btc-price-risks-further-decline-as-it-faces-rejection-at-17k",
    "keywords": [
      "analysis",
      "Bitcoin",
      "Opinion",
      "btc",
      "BTC/USD",
      "Price Analysis"
    ],
    "creator": [
      "Azeez Mustapha"
    ],
    "video_url": null,
    "description": "Bitcoin Trades Marginally as It Faces Rejection at $17K – November 17, 2022 Bitcoin’s (BTC) price has been moving sideways since its price drop on [...]",
    "content": "Bitcoin Trades Marginally as It Faces Rejection at $17K – November 17, 2022 Bitcoin’s (BTC) price has been moving sideways since its price drop on [...]",
    "pubDate": "2022-11-18 05:52:02",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Sunny & Cold Today and through the Weekend – Mark",
    "link": "https://www.kxly.com/sunny-cold-today-and-through-the-weekend-mark/",
    "keywords": [
      "Forecast",
      "Top Stories",
      "Weather",
      "bitter",
      "cold",
      "ski",
      "sun",
      "thanksgiving",
      "warm",
      "weekend",
      "winds"
    ],
    "creator": [
      "Mark Peterson"
    ],
    "video_url": null,
    "description": "Our current high pressure will keep us cloud-free and very cold with Arctic Air hanging out until the start of next week. Clouds and slow warming into Thanksgiving with the best chance of showers Tuesday.",
    "content": "What we’re tracking Our current high pressure will keep us cloud-free and very cold with Arctic Air hanging out until the start of next week. Clouds and slow warming into Thanksgiving with the best chance of showers Tuesday. Plan your day Morning starts with bitter cold conditions and a clear sky. Dress in layers and grab your shades. Spokane and Coeur d’Alene forecast Teens begin the day and we won’t hit the freezing mark so Cold all day. High of 31 with a normal high around 41. COPYRIGHT 2022 BY KXLY. ALL RIGHTS RESERVED. THIS MATERIAL MAY NOT BE PUBLISHED, BROADCAST, REWRITTEN OR REDISTRIBUTED.",
    "pubDate": "2022-11-18 12:46:37",
    "image_url": null,
    "source_id": "kxly",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Here’s How FTX Collapse Could Be A Domino Effect Of Terra Collapse",
    "link": "https://www.tronweekly.com/ftx-collapse-be-domino-effect-of-terra-collapse/",
    "keywords": [
      "News",
      "World",
      "Almeda",
      "ftx",
      "terra"
    ],
    "creator": [
      "Aishwarya shashikumar"
    ],
    "video_url": null,
    "description": "Numerous projects like FTX went under in the world of cryptocurrencies. Prominent cryptocurrency platforms were observed declaring bankruptcy one after another. The biggest fall was undoubtedly SBF’s firm collapse. While many were busy accusing Sam Bankman-Fried (SBF) of fraud and poor management, a new study showed how Terra might have precipitated the SBF’s empire’s precipitous […]",
    "content": null,
    "pubDate": "2022-11-18 12:37:29",
    "image_url": null,
    "source_id": "tronweekly",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Bloomberg UK Politics: Hunting for Positives (Podcast)",
    "link": "https://www.bloomberg.com/news/audio/2022-11-18/bloomberg-uk-politics-hunting-for-positives-podcast",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 12:36:16",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Ethereum to develop climate platform for the world – Will it drive ETH price to $2,000?",
    "link": "https://www.crypto-news-flash.com/ethereum-to-develop-climate-platform-for-the-world-will-it-drive-eth-price-to-2000/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-to-develop-climate-platform-for-the-world-will-it-drive-eth-price-to-2000",
    "keywords": [
      "News",
      "climate change",
      "ConsenSys",
      "Ethereum",
      "Proof of Work",
      "Proof-of-Stake",
      "tech"
    ],
    "creator": [
      "Paul Ade"
    ],
    "video_url": null,
    "description": "ConsenSys, in collaboration with several crypto companies, is co-launching a climate platform for the world built on the Ethereum PoS consensus protocol. Regulatory authorities have constantly expressed their worries over the effects of crypto mining on the environment. The Ethereum-based software firm, ConsenSys, which played a crucial role in the completion of the much-publicized Merge, [...] Der Beitrag Ethereum to develop climate platform for the world – Will it drive ETH price to $2,000? erschien zuerst auf Crypto News Flash.",
    "content": "ConsenSys, in collaboration with several crypto companies, is co-launching a climate platform for the world built on the Ethereum PoS consensus protocol. Regulatory authorities have constantly expressed their worries over the effects of crypto mining on the environment. The Ethereum-based software firm, ConsenSys, which played a crucial role in the completion of the much-publicized Merge, has teamed up with many other crypto firms to co-launch the Ethereum Climate Platform (ECP) during the ongoing global climate conference, dubbed COP27. The COP27 is a United Nations Climate Change Global Innovation Hub in Sharm el-Sheikh, Egypt, from November 6–18. The climate platform is developed for the Ethereum network and aims to reduce the ecosystem’s excess energy demand, which was the norm before the Merge two months ago. According to Joseph Lubin, co-founder of ConsenSys and a developer of the Ethereum blockchain, the motive is to raise some capital and invest it in high-impact technologies. Lubin stated that the team is expected to find funding for new projects that have technological significance and determine how impactful they will become. Upon the completion of the Merge, Ethereum discontinued its use of the energy-intensive proof-of-work (PoW) to the more energy-efficient proof-of-stake (PoS) consensus protocol. Ethereum, during the PoW stage, was powered by miners who completed several challenging puzzles to add more transactions to the ledger. With the PoS, Ethereum utilizes validators to facilitate transactions on the blockchain while using less energy. After the Merge, the network has drastically reduced its energy use by 99.9%. Part of Lubin’s statement read: “The Ethereum Merge has raised the bar for reducing climate change across the broader sectors of the global economy. It shows that with a collective drive, technological innovations are possible without increasing carbon emissions.” Rising Concerns about Crypto Mining Even before Ethereum’s transition from the PoW to the PoS, digital asset mining has been the subject of increasing backlash from regulators and environmental activists. Accordingly, the European Commission revealed in October that it plans to ban crypto mining if the region faces a severe energy crisis in the coming winter. As expected, regulatory agencies like the European Union (EU) are proposing ways to reduce PoW activities within the bloc. In October, the European Commission told its member states to be ready to stop crypto mining. In addition, the commission proposes load shedding in the region’s electricity supply as winter approaches. China has since taken a more extreme stance by banning Bitcoin mining and other crypto trading activities in 2021. Other PoW protocols, like Dogecoin and Zcash, also consider switching to PoS due to energy concerns. Ethereum has experienced a significant surge in its price after the Merge, with the network seeing close to a 10% increase. However, the gains were short-lived as ETH could not continue its upward trend 24 hours after the historic transition. ETH currently trades at $1,214 at the time of writing, per our data. However, the token is yet to respond to the latest development as the community hopes for a price increase towards the $2,000 level before the year ends. Der Beitrag Ethereum to develop climate platform for the world – Will it drive ETH price to $2,000? erschien zuerst auf Crypto News Flash.",
    "pubDate": "2022-11-18 12:34:51",
    "image_url": null,
    "source_id": "cryptonewsflash",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Use Safety Check to instantly wipe toxic apps (and people) from your iPhone",
    "link": "https://www.tomsguide.com/how-to/how-to-use-safety-check-on-iphone",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "Safety Check on iOS allows users to instantly shut down any information sharing on their iPhone, extinguishing privacy threats in one fell swoop. Here's how.",
    "content": null,
    "pubDate": "2022-11-18 12:32:08",
    "image_url": "http://cdn.mos.cms.futurecdn.net/PANBZRFKz9DApoSgwJaus9.jpg",
    "source_id": "tomsguide",
    "country": [
      "united states of america"
    ],
    "category": [
      "technology"
    ],
    "language": "english"
  },
  {
    "title": "SHIB Now Gaining Traction as Safe Haven, Certik Statistics Imply",
    "link": "https://u.today/shib-now-gaining-traction-as-safe-haven-certik-statistics-imply",
    "keywords": null,
    "creator": [
      "Tomiwabold Olajide"
    ],
    "video_url": null,
    "description": "SHIB's historic social sentiment remains positive for blockchain",
    "content": null,
    "pubDate": "2022-11-18 12:28:00",
    "image_url": null,
    "source_id": "utoday",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "iPhone 15 vs. iPhone 15 Pro: What we know so far",
    "link": "https://www.tomsguide.com/news/iphone-15-vs-iphone-15-pro",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "The iPhone 15 vs iPhone 15 Pro differences could be huge. Here's the rumors and leaks so far.",
    "content": null,
    "pubDate": "2022-11-18 12:17:05",
    "image_url": "http://cdn.mos.cms.futurecdn.net/HzWJ3MENAJNeQFGEiRAyfe.jpg",
    "source_id": "tomsguide",
    "country": [
      "united states of america"
    ],
    "category": [
      "technology"
    ],
    "language": "english"
  },
  {
    "title": "Crypto Marketing 2022: How Big Eyes Coin Overtook The Meme Coin Moment",
    "link": "https://coincheckup.com/blog/crypto-marketing-2022-how-big-eyes-coin-overtook-the-meme-coin-moment/",
    "keywords": [
      "Sponsored",
      "BIG",
      "Big Eyes",
      "FLOKI",
      "Floki Inu",
      "SHIB",
      "Shiba Inu"
    ],
    "creator": [
      "External Team"
    ],
    "video_url": null,
    "description": "It’s 2022, and everywhere are distractions. In your pocket right now is a machine capable of delivering to you nearly any sort of entertainment you could ever wish for. When you turn on your television, you’re able to pause, skip, or fast-forward through ads for products of all varieties. Whether you’re listening to the radio, watching a video on an online platform, or even reading a book through a digital reader, it’s impossible to avoid marketing.",
    "content": null,
    "pubDate": "2022-11-18 12:16:33",
    "image_url": null,
    "source_id": "coincheckup",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Chris Rock returns to site of infamous Will Smith slap",
    "link": "https://nypost.com/2022/11/18/chris-rock-returns-to-site-of-will-smith-slap-at-dolby-theatre/",
    "keywords": null,
    "creator": [
      "Richard Pollina",
      " Marjorie Hernandez"
    ],
    "video_url": null,
    "description": "Rock seemed determined to show that he had shifted the energy in the room by claiming he was not the victim then and he would never play one on stage.",
    "content": "Rock seemed determined to show that he had shifted the energy in the room by claiming he was not the victim then and he would never play one on stage.",
    "pubDate": "2022-11-18 12:15:40",
    "image_url": "https://nypost.com/wp-content/uploads/sites/2/2022/11/newspress-collage-24703785-1668772054630.jpg?quality=90&strip=all&1668754111",
    "source_id": "nypost",
    "country": [
      "united states of america"
    ],
    "category": [
      "entertainment"
    ],
    "language": "english"
  },
  {
    "title": "BC.GAME’s World Cup Carnival Offers $2.1M and a Tesla in Prizes",
    "link": "https://www.crypto-news-flash.com/bc-games-world-cup-carnival-offers-2-1m-and-a-tesla-in-prizes/?utm_source=rss&utm_medium=rss&utm_campaign=bc-games-world-cup-carnival-offers-2-1m-and-a-tesla-in-prizes",
    "keywords": [
      "News",
      "Press release"
    ],
    "creator": [
      "chainwire"
    ],
    "video_url": null,
    "description": "Willemstad, Curaçao, 18th November, 2022, Chainwire To mark the FIFA World Cup 2022, online gaming platform BC.GAME is offering multi-million dollar prizes via its Coco’s Carnival portal. Crypto Casino BC.GAME is a major World Cup advocate thanks to its sponsorship of the Argentine Football Association. Throughout 2022, BC.GAME has been offering an ever-growing number of [...] Der Beitrag BC.GAME’s World Cup Carnival Offers $2.1M and a Tesla in Prizes erschien zuerst auf Crypto News Flash.",
    "content": "Willemstad, Curaçao, 18th November, 2022, Chainwire To mark the FIFA World Cup 2022, online gaming platform BC.GAME is offering multi-million dollar prizes via its Coco’s Carnival portal. Crypto Casino BC.GAME is a major World Cup advocate thanks to its sponsorship of the Argentine Football Association. Throughout 2022, BC.GAME has been offering an ever-growing number of prizes, culminating in a grand promotion that coincides with the World Cup. This gives players a chance to win up to $2.1M or a Tesla car from Coco’s Carnival, a separate page created by BC.GAME dedicated to fans and sports bettors of the World Cup. BC.GAME offers a $100,000 prize pool for those who submit their World Cup predictions before November 26, 2022. Sports bettors are to place their predictions on the winners of each group. From the winners of the knockout rounds, players must predict who will be this year’s world champion. Players with VIP 4 and above can participate for free and finalize their predictions by 26/11/2022 00:00 AM UTC. In the event that more than one player makes the same prediction, the prize pool will be divided equally, and only one player per household is allowed to join the game. As part of BC.GAME’s policy, multiple claims or players with combo bets will be disqualified from the promotion. Further details of the promotions offering a $2,100,000 prize pool and a Tesla will be released soon. BC.GAME’s partnership with the Argentine Football Association will focus not only on the World Cup but also on the upcoming leagues in which the AFA is participating. AFA and BC.GAME are seeking engagements with Argentine team members and crypto casino players. About BC.GAME BC.GAME is a crypto gambling platform that offers various online casino games, live casinos, and sports betting. With its integration of cryptocurrency and blockchain technology, BC.GAME enables players to access the benefits provided by both technologies. Sportsbetting is included in its gaming portfolio, supporting wagers on major leagues, including the upcoming World Cup. Contact PRIssay DomingoBC.GAMElarswriter@bcgame.com Der Beitrag BC.GAME’s World Cup Carnival Offers $2.1M and a Tesla in Prizes erschien zuerst auf Crypto News Flash.",
    "pubDate": "2022-11-18 12:15:07",
    "image_url": null,
    "source_id": "cryptonewsflash",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Binance and Cristiano Ronaldo First Exclusive NFT Drops",
    "link": "https://www.tronweekly.com/binance-cristiano-ronaldo-exclusive-nft-drops/",
    "keywords": [
      "Industry",
      "News",
      "Binance",
      "Cristiano Ronaldo",
      "NFT"
    ],
    "creator": [
      "Vignesh Karunanidhi"
    ],
    "video_url": null,
    "description": "The captain of the Portuguese national football team, Cristiano Ronaldo, has partnered with Binance to launch his first NFT collection. The international cryptocurrency exchange Binance and the football player have entered into an exclusive multi-year partnership. The launch is scheduled just before the 2022 FIFA World Cup in Qatar, which gets underway on November 20. Ronaldo plans […]",
    "content": null,
    "pubDate": "2022-11-18 18:05:43",
    "image_url": null,
    "source_id": "tronweekly",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "FCA Opts for Public Censure of Sonali Bank UK ex-CEO for AML Failure",
    "link": "https://www.financemagnates.com//fintech/fca-opts-for-public-censure-for-sonali-bank-uk-ex-ceos-aml-failure/",
    "keywords": [
      "FinTech",
      "News"
    ],
    "creator": [
      "Solomon Oladipupo",
      "www.financemagnates.com"
    ],
    "video_url": null,
    "description": "<p>The United Kingdom Financial Conduct Authority (FCA) has publicly censured Mohammad Prodhan, the former Chief Executive Officer of Sonali Bank UK (SBUK), for failing to establish and maintain effective anti-money laundering (AML) systems and controls at the bank. </p><p>The financial markets regulator, which <a href=\"https://www.financemagnates.com/institutional-forex/regulation/sonali-bank-uk-ceo-fined-76400-for-money-laundering/\">fined Prodhan £76,400 in 2018</a>, is now opting to several disapprove the ex-CEO as a result of “exceptional circumstances in this case.”</p><p>These situations include \"Mr Prodhan returning to Bangladesh and no longer having income or assets in the UK; the fact he is no longer in employment in Bangladesh; ongoing personal conditions which limit his ability to travel to the UK for the Upper Tribunal; and the length of time since his misconduct which has been impacted by Covid-delays to the litigation,” <a href=\"https://www.financemagnates.com/tag/financial-conduct-authority/\" target=\"_blank\">FCA</a> explained in a statement <a href=\"https://www.fca.org.uk/news/press-releases/fca-issues-final-notice-former-ceo-anti-money-laundering-failings\">released</a> on Friday.</p><p>Furthermore, the financial watchdog noted the Bank of England’s Prudential Regulation Authority has canceled the bank’s authorization. The institution has also been renamed to Sonali Bangladesh (UK) Limited, it said. </p><p>SBUK was founded in 2001 to serve the Bangladeshi community in the United Kingdom. The bank is the product of a partnership between the Bangladesh government and Sonali Bank, a state-owned commercial bank in Bangladesh.</p><p>Prodhan's Offence</p><p>In 2018, the FCA penalized Prodhan for failing to take charge of his AML duties at the SBUK, leading to “systemic failures in SBUK’s AML systems and controls throughout the business.” However, the CEO referred the case to the Upper Tribunal, a UK superior appellate court, where the case was delayed. </p><p>“While a financial penalty was appropriate in this case, prolonged litigation to enforce a penalty that is unlikely to be paid against a person who may not be able to travel to the UK to explain himself in person to the Upper Tribunal is neither practical nor fair,\" noted Mark Steward, Executive Director of Enforcement and Market Oversight at the FCA. \"In these exceptional circumstances, a public censure is an appropriate resolution of the case,” Steward added.</p><p>Meanwhile, in 2016, <a href=\"https://www.financemagnates.com/tag/bangladesh/\">Bangladesh</a> appointed Pradhan as the Managing Director of Rupali Bank, a state-owned commercial bank. In 2019, the executive was also selected as the MD of Sonali Bank in Bangladesh. However, FCA in the latest statement said Prodhan is no longer in employment in Bangladesh.</p> This article was written by Solomon Oladipupo at www.financemagnates.com.",
    "content": null,
    "pubDate": "2022-11-18 17:58:43",
    "image_url": null,
    "source_id": "financemagnates",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Solana Loses $1 Billion in USDT to Ethereum in Tether Chain Swap",
    "link": "https://decrypt.co/115028/tether-usdt-1-billion-solana-ethereum",
    "keywords": [
      "solana",
      "tether",
      "Business"
    ],
    "creator": [
      "Mathew Di Salvo"
    ],
    "video_url": null,
    "description": "The chain swap announcement comes as Solana faces difficulties.",
    "content": null,
    "pubDate": "2022-11-18 17:49:27",
    "image_url": "https://cdn.decrypt.co/resize/1024/height/512/wp-content/uploads/2022/04/Tether-dollars-gID_6.jpeg",
    "source_id": "decrypt",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "BTC Price Prediction – How Long Can the Crypto Ranging Go On?",
    "link": "https://insidebitcoins.com/news/btc-price-prediction-how-long-can-the-crypto-ranging-go-on",
    "keywords": [
      "Bitcoin",
      "Cryptocurrency"
    ],
    "creator": [
      "Jimmy Aki"
    ],
    "video_url": null,
    "description": "Bitcoin has yet to enjoy a smooth sailing year. Macroeconomic events and industry incidents have largely hampered its growth since its November 2021 record high [...]",
    "content": "Bitcoin has yet to enjoy a smooth sailing year. Macroeconomic events and industry incidents have largely hampered its growth since its November 2021 record high [...]",
    "pubDate": "2022-11-18 17:45:41",
    "image_url": null,
    "source_id": "insidebitcoins",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Russian bill would legalize crypto mining, sales under ‘experimental legal regime’",
    "link": "https://cointelegraph.com/news/russian-bill-would-legalize-crypto-mining-sales-under-experimental-legal-regime",
    "keywords": [
      "Russia",
      "Mining",
      "Cryptocurrency Exchange",
      "Digital Asset"
    ],
    "creator": [
      "Cointelegraph By   Derek Andersen"
    ],
    "video_url": null,
    "description": "The bill provides a legal definition of mining and mining pools and would create a domestic cryptocurrency market in Russia’s latest step to integrate digital assets into its economy.",
    "content": null,
    "pubDate": "2022-11-18 17:45:00",
    "image_url": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTEvOTg5YmVkYmUtNDA2NS00ZjFmLTk5MmEtNGJiNjg4ODBjOGJhLmpwZw==.jpg",
    "source_id": "cointelegraph",
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "title": "Thunderbird Entertainment Sees Proxy Fight With Activist Investor Heat Up",
    "link": "https://www.hollywoodreporter.com/business/business-news/thunderbird-entertainment-sees-proxy-fight-with-activist-investor-heat-up-1235265152/",
    "keywords": [
      "Business",
      "Business News",
      "thunderbird entertainment"
    ],
    "creator": [
      "Etan Vlessing"
    ],
    "video_url": null,
    "description": "Producer Thunderbird Entertainment, which backs multiple projects filming Vancouver for U.S. studios and streamers, has dismissed a proxy fight heating up with activist investor Voss Capital. “Thunderbird believes this proxy fight is a waste of time, energy and resources,” the company, led by CEO Jennifer Twiner McCarron, said in a statement on Thursday after delaying […]",
    "content": null,
    "pubDate": "2022-11-18 17:44:41",
    "image_url": null,
    "source_id": "hollywoodreporter",
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "title": "Taylor Swift On Ticketmaster Tech Issues: “We Were Assured” They Could Handle the Demand",
    "link": "https://www.hollywoodreporter.com/business/business-news/taylor-swift-ticketmaster-we-were-assured-they-could-handle-demand-1235265157/",
    "keywords": [
      "Business",
      "Business News",
      "Live Nation",
      "Taylor Swift",
      "Ticketmaster"
    ],
    "creator": [
      "Caitlin Huston"
    ],
    "video_url": null,
    "description": "Taylor Swift is speaking out against Ticketmaster after fans experienced problems buying tickets to her upcoming Eras tour.  Ticketmaster experienced errors and site slowdowns on Tuesday during its Taylor Swift pre-sale for verified fans. The site sold two million tickets during the pre-sale, a record for a single artist in a day but continued to […]",
    "content": null,
    "pubDate": "2022-11-18 17:42:56",
    "image_url": null,
    "source_id": "hollywoodreporter",
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "title": "Here’s What Binance’s CZ Has To Say About SBF",
    "link": "https://www.tronweekly.com/heres-what-binances-cz-has-to-say-about-sbf/",
    "keywords": [
      "News",
      "World",
      "Binance",
      "Changpeng Zhao",
      "CZ",
      "Sam Bankman-Fried",
      "SBF"
    ],
    "creator": [
      "Aishwarya shashikumar"
    ],
    "video_url": null,
    "description": "The bankruptcy of reputable cryptocurrency exchange FTX has caused complete turmoil in the industry. Binance agreed to make a non-binding contribution to the troubled business earlier this month. Then, though, it quickly changed its mind and said that it was powerless to do anything about the problems. Changpeng Zhao, the co-founder and CEO of Binance, […]",
    "content": null,
    "pubDate": "2022-11-18 17:41:22",
    "image_url": null,
    "source_id": "tronweekly",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Carvana to Cut 1,500 Jobs as Online Auto Dealer’s Troubles Mount",
    "link": "https://www.bloomberg.com/news/articles/2022-11-18/carvana-says-it-will-cut-1-500-jobs-as-company-s-troubles-mount",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 17:39:49",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Candace Cameron Bure says faith helped through 'difficult year': 'Grateful for God's protection'",
    "link": "https://www.yahoo.com/entertainment/candace-cameron-bure-faith-bob-saget-god-173948625.html",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-18 17:39:48",
    "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2021-11/72dde980-4ed1-11ec-a7f7-a95569e3320e",
    "source_id": "yahoo",
    "country": [
      "united states of america"
    ],
    "category": [
      "entertainment"
    ],
    "language": "english"
  },
  {
    "title": "Attorney General appoints special counsel to oversee Trump criminal investigations",
    "link": "https://www.cbsnews.com/sanfrancisco/video/attorney-general-appoints-special-counsel-to-oversee-trump-criminal-investigations/",
    "keywords": [
      "News",
      "Crime",
      "Politics",
      "National News",
      "Spoken Word KPIXTV"
    ],
    "creator": null,
    "video_url": null,
    "description": "Attorney General Merrick Garland has named a special counsel to oversee the entirety of the Justice Department's criminal investigation of former president Donald Trump. Skyler Henry reports. (11-19-22)",
    "content": null,
    "pubDate": "2022-11-19 01:18:00",
    "image_url": "https://assets3.cbsnewsstatic.com/hub/i/r/2022/11/19/dc75f10d-3fc8-493f-871a-5e35e5e61370/thumbnail/1024x576/2b3276fecfe559038b37370cbc9676a0/1cd94f5691514e517b555d939433c972.jpg",
    "source_id": "sanfranciscocbslocal",
    "country": [
      "united states of america"
    ],
    "category": [
      "politics"
    ],
    "language": "english"
  },
  {
    "title": "Trump 2024 Rivals Court His Donors at Big Las Vegas Meeting",
    "link": "https://www.usnews.com/news/politics/articles/2022-11-18/trumps-rivals-court-his-donors-as-24-primary-season-begins",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-19 01:11:56",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Musk Starts Twitter Poll on Reinstating Former President Trump",
    "link": "https://www.bloomberg.com/news/articles/2022-11-19/musk-starts-twitter-poll-on-reinstating-former-president-trump",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-19 01:10:47",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Summers Warns Very Risky for US to Aim at ‘Tearing China Down’",
    "link": "https://www.bloomberg.com/news/articles/2022-11-19/summers-warns-very-risky-for-us-to-aim-at-tearing-china-down",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-19 01:06:21",
    "image_url": null,
    "source_id": "bloomberg",
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english"
  },
  {
    "title": "Homer Library Board Delays Decision on Moving LGBTQ+ Books",
    "link": "https://www.usnews.com/news/best-states/alaska/articles/2022-11-18/homer-library-board-delays-decision-on-moving-lgbtq-books",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-19 01:03:41",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Closing arguments begin in Oath Keepers trial",
    "link": "https://www.cbsnews.com/news/prosecutors-say-storming-capitol-was-means-for-oath-keepers-to-keep-biden-from-becoming-president/",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "Closing arguments began in the Jan. 6 trial for five members and affiliates of the far-right Oath Keepers accused of seditious conspiracy.",
    "content": null,
    "pubDate": "2022-11-19 01:02:18",
    "image_url": "https://assets3.cbsnewsstatic.com/hub/i/r/2022/10/19/1a55a968-3d92-4d80-b943-f9f05a6f675b/thumbnail/60x60/02b493c5a5f3b4a7f44b9560989c3b21/ap22285736875213-1.jpg",
    "source_id": "cbsnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "politics"
    ],
    "language": "english"
  },
  {
    "title": "Having married himself to earn $10 million, Dennis Rodman once claimed how s*x the night before games ruined his performance",
    "link": "https://thesportsrush.com/nba-news-having-married-himself-to-earn-10-million-dennis-rodman-once-claimed-how-sx-the-night-before-games-ruined-his-performance/",
    "keywords": [
      "Basketball"
    ],
    "creator": [
      "Ashish Priyadarshi"
    ],
    "video_url": null,
    "description": "Dennis Rodman is one of the raunchiest men in NBA history, but even his experiences didn’t work all the time. Especially not the nights before NBA games. The Bulls legend made a name in the NBA for various reasons. He was notably known as the rebounding king of his time. It’s why he earned the… The post Having married himself to earn $10 million, Dennis Rodman once claimed how s*x the night before games ruined his performance appeared first on The SportsRush.",
    "content": "Dennis Rodman is one of the raunchiest men in NBA history, but even his experiences didn’t work all the time. Especially not the nights before NBA games. The Bulls legend made a name in the NBA for various reasons. He was notably known as the rebounding king of his time. It’s why he earned the nickname, ‘The Worm.’ His tough brand of defense and hustle stemmed from his time with the Detroit Pistons, known as the ‘Bad Boy Pistons.’ He helped the Bulls win three straight championships from 1995 to 1998 after Jordan recruited him. Jordan regularly played the Pistons during their peak, so he knew exactly what he would be getting with Rodman on the team. The Pistons routinely harassed Jordan to the point where they coined the ‘Jordan rules’, a physical style of play meant to neutralize the greatest player in NBA history. “The Last Dance” turned to Dennis Rodman, the “Bad Boys” Pistons of the late 1980s, the Jordan Rules and the continued turbulence early in the 1997-98 Bulls’ campaign.https://t.co/TJcC04CAYr — Sun-Times Sports (@suntimes_sports) April 27, 2020 Also Read: “LeBron James just mocked his own LeLiar personality”: Lakers star makes fun of his pathological lying while discussing LeRoy Butler’s Lambeau Leap Dennis Rodman discussed how scandalous experiments before games never worked for him Rodman’s career is defined more by his adventures outside the court than those on it, however. He was a wild man. Rodman loved partying, and he loved to have fun with women. However, for all his crazy stories, Rodman found his breaking point. Even the legendary Rodman had his limits. It was surprising for him, but in the end, he did come to a decision. He was talking to Mike Tyson on his show ‘Hotboxin’, when he said, “I’ve done this twice in my life playing sports and I never knew that this s**t will f**k with you when you’re playing the game.” What exactly was he referring to? “I’m trying to have s*x all night before the game. Doesn’t f****ng work out too well.” The routine affected his gameplay and his coach even had to talk to him to sort out the issues. “Why don’t you take a night off? I know what you did last night. You got weak knees right?” Rodman recalled his coach saying. Rodman married himself and earned a cool $10 million Dennis Rodman is a generally wild character, but there are some lengths he’ll go to that will amaze people. Once he even married himself, and the entire stunt netted him a massive profit. Dennis Rodman has a net worth of $500,000 right now, and he once tried to increase that immensely. In 1996, Rodman appeared at his book signing for ‘Bad as I wanna be’ in a bridal gown and a horse-drawn carriage. The whole thing was done to promote his book, and it worked. The book was a bestseller for several months, and in the end Rodman revealed that he earned $10 million from the entire thing. What a way to earn money, but of course, it’s only Rodman who could do something like this. Also Read: Charles Barkley, Who Lost $25,000 In A Golf Bet, Was Lambasted By Shaquille O’Neal For Lying To Barack Obama The post Having married himself to earn $10 million, Dennis Rodman once claimed how s*x the night before games ruined his performance appeared first on The SportsRush.",
    "pubDate": "2022-11-19 01:00:46",
    "image_url": null,
    "source_id": "thesportsrush",
    "country": [
      "united states of america",
      "united kingdom",
      "india",
      "australia"
    ],
    "category": [
      "sports"
    ],
    "language": "english"
  },
  {
    "title": "Nevada Dems: Midterms Show Why Nevada Should Start Primary",
    "link": "https://www.usnews.com/news/politics/articles/2022-11-18/nevada-dems-midterms-show-why-nevada-should-start-primary",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-19 00:58:14",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "Ringleaders in Massive COVID Fraud Extradited to US",
    "link": "https://www.usnews.com/news/us/articles/2022-11-18/ringleaders-in-massive-covid-fraud-extradited-to-us",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-19 00:55:46",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  },
  {
    "title": "At CPAC Mexico, 'Orphaned' Right Tries to Build Home as Region Tacks Left",
    "link": "https://www.usnews.com/news/world/articles/2022-11-18/at-cpac-mexico-orphaned-right-tries-to-build-home-as-region-tacks-left",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-11-19 00:55:35",
    "image_url": null,
    "source_id": "usnews",
    "country": [
      "united states of america"
    ],
    "category": [
      "world"
    ],
    "language": "english"
  }
]
