[
  {
    "article_id": "5fac7781a73d91fcbe1a67bd28676f3c",
    "title": "Three-Continent 2030 World Cup Gives Some Teams An Unfair Disadvantage",
    "link": "https://www.forbes.com/sites/steveprice/2023/10/05/three-continent-2030-world-cup-gives-some-teams-an-unfair-disadvantage/",
    "keywords": [
      "SportsMoney",
      "/sportsmoney",
      "Business",
      "/business",
      "SportsMoney",
      "/sportsmoney",
      "business",
      "sportsmoney",
      "standard"
    ],
    "creator": [
      "Steve Price, Senior Contributor"
    ],
    "video_url": null,
    "description": "The opening 3 games of the FIFA 2030 World Cup will be played 10,000 km away from the rest of the tournament. The teams playing in those games have a huge disadvantage.",
    "content": "Forbes Business SportsMoney Three-Continent 2030 World Cup Gives Some Teams An Unfair Disadvantage Steve Price Senior Contributor Opinions expressed by Forbes Contributors are their own. Following Oct 5, 2023, 02:45am EDT | Press play to listen to this article! Got it! Share to Facebook Share to Twitter Share to Linkedin LONDON, ENGLAND - JULY 11: Francesco Acerbi, Leonardo Bonucci and teammates celebrate after victory ... [+] in the UEFA Euro 2020 Championship Final between Italy and England at Wembley Stadium on July 11, 2021 in London, England. (Photo by Andy Rain - Pool/Getty Images) Getty Images Teams hoping to win the World Cup not only have to beat their opponents, they need to beat the local climate and conditions. Games played at altitude, in soaring temperatures, or with huge distances between venues can make or break a team’s tournament. At the 2014 World Cup, an energy-sapping encounter in Manaus, deep in the hot and humid Amazon basin, exhausted England and Italy’s players, and was partially blamed for both countries’ group-stage exits. Many of these challenges are caused simply by the diverse nature of our planet. But for the 2030 World Cup, FIFA has skewed the field for its own political reasons. Reports suggest that the 2030 World Cup will be hosted in Spain, Portugal and Morocco, but with the opening three matches played across the ocean in South America. Uruguay, Paraguay and Argentina had bid for the 2030 tournament, with a main focus of their bid being that it would be 100 years since the first World Cup in Uruguay, so it would be nice and sentimental to host the centenary event there too (despite most of the games being in neighboring Argentina). In some feat of sporting diplomacy, it seems the bulk of the 2030 tournament will now be played in Europe and North Africa, with the opening three games being played in Uruguay, Paraguay and Argentina to reflect this centenary year. MORE FOR YOU Ukrainian Troops Recovered One Of Their Damaged Strv 122 Tanks—In Time For The Tank To Meet The President Bill Gates Predicts Arista Networks Will Disrupt Google And Amazon Powerball Jackpot Rises To 1 4 Billion Here s What The Winner Will Take Home After Taxes It is a solution that tries to make everybody happy (not least Saudi Arabia, who appear to have an open goal for their bid to host the 2034 World Cup) while actually making nobody happy. Local South Americans will be unlikely to get any tickets despite “hosting” a World Cup, national team fans will have to add a transatlantic ticket to their World Cup expenses, and while Infantino says 2030 “will have a unique global footprint,” it seems he hasn’t considered the tournament’s carbon footprint . The decision to host the opening three games in South America could also impact the sporting integrity of the tournament. Buenos Aires is more than 10,000 kilometers, or a 12-hour flight, from Madrid. That’s more than double the distance between 2026 host cities Vancouver and Miami, and more than three times the distance between the two furthest apart cities at Russia 2018. While Madrid and Morocco could be in the middle of summer heatwaves during the World Cup, it will be winter in Buenos Aires with the daily mean temperature in June just 12 degrees Celsius (53 degrees Fahrenheit), and there is a six-hour time difference between Paraguay and Spain. The effect of travel on performance can be seen at Euro 2020 , which was held across Europe and had huge disparities between distances traveled, with some countries potentially traveling more than ten times further than others. Out of all the teams to reach the knockout stages, the two finalists, England and Italy, had the shortest total distance from their opening game to the final. Semi-finalists Denmark had the second shortest distance to travel up to the round of 16, where they won 4-0 against Wales, who had the fifth longest distance at that stage. The other semi-finalist, Spain, had the fifth shortest route to the final. And in the three-day turnaround between the quarterfinals and semifinals, the two losers of the semifinals had much longer journeys to London from Baku and Saint Petersburg. Correlation might not be causation, but there is certainly some correlation between the distances traveled and results during Euro 2020. Overcoming the local conditions is part of tournament soccer. As far back as the Mexico 1986 World Cup, England trained in steam rooms at altitude in Colorado to try to prepare for with the altitude of Mexico City and extreme heat of Monterrey. But depending on the fixture schedule, six teams at the 2030 World Cup could possibly have to travel an extra 10,000 miles more than their next opponents. They will also need to find two base camps, disrupting their tournament preparations. Whether it shows in the next game, or through accumulated fatigue as the tournament progresses, these kinds of factors can make the difference between winning and losing. Follow me on Twitter . Steve Price Editorial Standards Print Reprints & Permissions",
    "pubDate": "2023-10-05 06:45:29",
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/651e57ad9b42485e6812d410/0x0.jpg?width=960",
    "source_id": "forbescrypto",
    "source_priority": 57,
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english",
    "short_uuid": "b00f87ca"
  },
  {
    "article_id": "82093009c8030984a7c4dbd9fb2991d3",
    "title": "Doctors urged to ask patients about gambling in new NHS mental health guidance",
    "link": "https://www.theguardian.com/society/2023/oct/05/doctors-urged-to-ask-patients-about-gambling-in-new-nhs-mental-health-guidance",
    "keywords": [
      "Gambling",
      "Society",
      "Mental health",
      "NHS",
      "Health"
    ],
    "creator": [
      "PA Media"
    ],
    "video_url": null,
    "description": "People should be asked about problem gambling in same way they are asked about drugs and alcohol, say draft rulesPeople who seek help for mental health issues should be asked about problem gambling in the same way they are asked about drugs, smoking and alcohol, new guidance has suggested.According to the National Institute for Health and Care Excellence (Nice), those who visit an NHS health professional in England for depression, anxiety or thoughts about self-harm or suicide due to a possible addiction, such as alcohol or drugs, could be at a greater risk of harm from gambling.In the UK and Ireland, Samaritans can be contacted on freephone 116 123, or email jo@samaritans.org or jo@samaritans.ie. In the US, you can call or text the National Suicide Prevention Lifeline on 988, chat on 988lifeline.org, or text HOME to 741741 to connect with a crisis counselor. In Australia, the crisis support service Lifeline is 13 11 14. Other international helplines can be found at befrienders.org Continue reading...",
    "content": "People who seek help for mental health issues should be asked about problem gambling in the same way they are asked about drugs, smoking and alcohol, new guidance has suggested. According to the National Institute for Health and Care Excellence (Nice), those who visit an NHS health professional in England for depression, anxiety or thoughts about self-harm or suicide due to a possible addiction, such as alcohol or drugs, could be at a greater risk of harm from gambling. Nice said questions should be asked about patients’ gambling habits to ensure they can cope with their thoughts and urges. In new draft guidance, it suggested patients should be encouraged to assess the severity of their gambling by using a questionnaire available on the NHS website. Those who score eight or higher should seek support and treatment from gambling services. Health professionals should also discuss software blocking tools to limit online gambling and consider cognitive behavioural therapy (CBT) as an option. NHS England has said about 1,400 people were referred for help for gambling addiction last year, up by a third on 2021. Prof Jonathan Benger, the chief medical officer and interim director of the centre for guidelines at Nice, said: “Harmful gambling causes immense misery to all those who experience it. We want those needing help or who are at risk to be identified sooner and receive appropriate help.” Since 2019, NHS England has opened 12 gambling treatment clinics, with a further three due to open in the coming months. It is planning to treat up to 3,000 people a year across the 15 facilities, as part of the NHS long-term plan. Benger added: “The independent committee who made these draft recommendations included both clinicians and people with personal experience of harmful gambling. They scrutinised all the available evidence to identify treatments and therapies that have been shown to work and offer good value for money. The result is this useful and usable advice to help NHS clinics as they develop their service.” Fiona Macleod, the director of services at the charity GamCare, said the Nice guidance was “an important step”. “Identifying an issue with gambling as early as possible is vital to prevent harm from occurring later down the line, and we know that there is an important role that healthcare professionals can play in helping more people find the support they need. “We believe these recommendations, if implemented, will present a greater opportunity to prevent gambling harms from occurring in the UK. They represent an important step in encouraging more people to seek support, through services such as those GamCare provides.” Zoë Osmond, the chief executive of GambleAware, also welcomed the draft guidance. “Gambling harms are a serious public health issue, which can affect anyone, and healthcare professionals are ideally placed to identify and help people experiencing them,” she said. “We welcome the development of guidelines to further inform treatment for those seriously affected by gambling harm and will be responding to the consultation with our views.” The NHS England mental health director, Claire Murdoch, said: “Gambling addiction is a cruel disease that destroys people’s lives, and the NHS is already playing its part in treating it with four new specialist clinics opening in recent months and a further three opening later this year, so if you’re struggling, please come forward for help. “We will work with Nice on this consultation process and while this new guidance will ensure the NHS can help even more people struggling with gambling addiction to receive evidenced-based treatment, it is vital that the billion-pound industry also takes action in line with the government’s white paper to stop people coming to harm in the first place.” In April, the government outlined plans to reform gambling to ensure regulation meets new challenges as the “landscape has changed significantly since 2005”. For support, advice or information about gambling, contact the National Gambling Helpline on 0808 8020 133. In the UK and Ireland, Samaritans can be contacted on freephone 116 123, or email jo@samaritans.org or jo@samaritans.ie . In the US, you can call or text the National Suicide Prevention Lifeline on 988, chat on 988lifeline.org , or text HOME to 741741 to connect with a crisis counselor. In Australia, the crisis support service Lifeline is 13 11 14. Other international helplines can be found at befrienders.org",
    "pubDate": "2023-10-05 06:37:09",
    "image_url": "https://i.guim.co.uk/img/media/e859935cfbd1a3c9d1fed54ddb12dc3b5a4c5966/0_457_5357_3213/master/5357.jpg?width=460&quality=85&auto=format&fit=max&s=1a1bec6ad5c74045791e8c7b6190e8f4",
    "source_id": "theguardian",
    "source_priority": 106,
    "country": [
      "united states of america"
    ],
    "category": [
      "health"
    ],
    "language": "english",
    "short_uuid": "713c7186"
  },
  {
    "article_id": "3ce9cc74e879b5e8030e810391d83124",
    "title": "Cricket’s World Cup Starts Amid Uncertainty For Maligned ODI Format",
    "link": "https://www.forbes.com/sites/tristanlavalette/2023/10/05/crickets-world-cup-starts-amid-uncertainty-for-maligned-odi-format/",
    "keywords": [
      "SportsMoney",
      "/sportsmoney",
      "Business",
      "/business",
      "SportsMoney",
      "/sportsmoney",
      "business",
      "sportsmoney",
      "standard"
    ],
    "creator": [
      "Tristan Lavalette, Contributor"
    ],
    "video_url": null,
    "description": "There is an unknown over cricket's 50-over future as its popularity declines, but the World Cup in India might stir a wave of nostalgia.",
    "content": "Forbes Business SportsMoney Cricket’s World Cup Starts Amid Uncertainty For Maligned ODI Format Tristan Lavalette Contributor Opinions expressed by Forbes Contributors are their own. Following Oct 5, 2023, 02:34am EDT | Press play to listen to this article! Got it! Share to Facebook Share to Twitter Share to Linkedin The cricket World Cup starts on October 5 (Photo by Matthew Lewis-ICC/ICC via Getty Images) ICC via Getty Images The cricket World Cup starts on October 5 in the sport's rabid heartland. India which famously last hosted the event in 2011 when a MS Dhoni title-clinching six into a sea of ecstatic fans became instantly etched into lore. Even though T20s had been around for some time, with two T20 World Cups contested and the Indian Premier League exploding onto the scene in 2008, the most important prize was undoubtedly the World Cup of the 50-over variety. Back then there was no need to differentiate. The World Cup was the World Cup. The T20 equivalent was a little bit mickey mouse at the international level, still not taken seriously. But things have changed significantly in the last 12 years. The shorter three-hour format of T20 has grabbed the hearts of a younger generation, spawning lucrative domestic leagues globally, and proving a suitable game for this instant gratification era. Last year's T20 World Cup , marked by an epic India-Pakistan contest at a 90,000 MCG, felt like the tournament had really arrived. And the next event - just eight months away - might be a definitive moment for the sport with it being co-hosted by the U.S. Kohli inspired India to an amazing victory over arch-rivals Pakistan (Photo by Daniel ... [+] Pockett-ICC/ICC via Getty Images) ICC via Getty Images MORE FOR YOU Ukrainian Troops Recovered One Of Their Damaged Strv 122 Tanks—In Time For The Tank To Meet The President Bill Gates Predicts Arista Networks Will Disrupt Google And Amazon Powerball Jackpot Rises To 1 4 Billion Here s What The Winner Will Take Home After Taxes But sandwiched between those mega events is the World Cup, which will thrust the maligned 50-over format - becoming something of a black sheep middle sibling - to the forefront of fans over the next six months. There has been much debate over the future of the 50-over format - which is played over around eight hours - and whether it should be significantly reduced or ditched entirely. As I reported recently, ODI's immediate future is secure with cricket's powerbrokers intent on protecting the format. ODIs still holds significant cache because of the 50-over World Cup, which is a money-spinner and remains the most coveted prize for players. It won't be going anywhere because there are World Cups in the next cycle of events in 2027 and 2031. For the next event, which will be played in South Africa, Zimbabwe and Namibia, the World Cup will finally expand from its measly number of 10 teams to 14. That means smaller cricket nations will need more exposure beforehand to ensure they are competitive for the next World Cup. But amid such a crammed calendar, with ODIs seemingly the casualty, there will be precious opportunities for them. With seemingly little appetite, despite administrators saying otherwise, the format is clearly on the nose, played less these days with little fanfare from fans. It's saddening for a previous generation when the 50-over format was the most exciting spectacle imaginable. ODI cricket once attracted packed crowds (Photo by Tony Marshall/EMPICS via Getty Images) PA Images via Getty Images There have already been reports from India that this cricket-mad country has been less enthused over the World Cup. Sports fever is currently centered over India's strong showing at the Asian Games - the world's second biggest multi-sport event being contested in Hangzhou, China. Inevitably, especially if hosts and favorites India start getting on a roll, the World Cup will ignite and it could lead to a swirl of nostalgia. Maybe fans will believe the format can offer the right balance of Test cricket's slow burn along with T20's manic approach. Or perhaps this will be something of a last dance, where the often excruciating middle overs makes everyone realise that the format is a relic. Either way, 50-over cricket will be the center of attention in the cricket world. Something that rarely happens these days. Follow me on Twitter . Tristan Lavalette Editorial Standards Print Reprints & Permissions",
    "pubDate": "2023-10-05 06:34:23",
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/651e45b0e93a541eea2a4d04/0x0.jpg?width=960",
    "source_id": "forbescrypto",
    "source_priority": 57,
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english",
    "short_uuid": "bf9adce5"
  },
  {
    "article_id": "3ccb3114ac70587179265eb19ae2a333",
    "title": "Biden’s Dog Commander ‘Not Presently’ At White House After Biting Incidents",
    "link": "https://www.forbes.com/sites/siladityaray/2023/10/05/bidens-dog-commander-not-presently-at-white-house-after-biting-incidents/",
    "keywords": [
      "Business",
      "/business",
      "Business",
      "/business",
      "Breaking",
      "breaking-news",
      "topline"
    ],
    "creator": [
      "Siladitya Ray, Forbes Staff"
    ],
    "video_url": null,
    "description": "The German shepherd has been involved in a series of biting incidents at the White House.",
    "content": "Forbes Business Breaking Biden’s Dog Commander ‘Not Presently’ At White House After Biting Incidents Siladitya Ray Forbes Staff Covering breaking news and tech policy stories at Forbes. Following Oct 5, 2023, 02:22am EDT | Press play to listen to this article! Got it! Updated Oct 5, 2023, 02:33am EDT Share to Facebook Share to Twitter Share to Linkedin Topline President Joe Biden’s dog Commander is not at the White House premises at present, a spokesperson for First Lady Jill Biden said Wednesday, after multiple reports of the German shepherd biting several Presidential staffers, including Secret Service agents. File Photo: Commander, US President Joe Biden and US First Lady Jill Bidens German Shepherd, is ... [+] taken for a walk on the South Lawn before their return to the White House in Washington, DC. AFP via Getty Images Key Facts The First Lady’s spokesperson said Commander “is not presently on the White House campus while next steps are evaluated,” the Associated Press reported . The spokesperson noted that the Bidens are “grateful for the patience and support” of the Secret Service staffers and all other staffers as they attempt to “work through solutions.” Last month, a tourist took a photo of Commander biting Dale Haney, the White House’s chief groundskeeper and later that month the dog bit a Secret Service officer. White House press secretary Karine Jean-Pierre commented on the photo of Commander biting Haney and said the dog and the chief groundskeeper were playing and no skin was broken at the time. What To Watch For It is unclear where the 2-year-old German shepherd is living currently and if there are plans to bring him back to the White House. The First Lady’s spokesperson said the White House can be a “stressful environment” for pets and the family was working on “ways to help Commander handle the often unpredictable nature of the White House grounds.” Key Background Aside from the two biting incidents reported last month, the 2-year-old German shepherd has bitten Secret Service personnel at least 10 other times , according to the Department of Homeland Security’s records. The ten earlier biting incidents were recorded between October 2022 and January 2023, one of which required a hospital visit. It is unknown if any other biting incidents have taken place between January and September. Biden’s older German Shepherd Major was also involved in several biting incidents, which eventually resulted in him moving out of the White House. Tangent CNN reported that Secret Service personnel at the White House had raised concerns about workplace safety over the biting incidents. One source cited by CNN referred to the work environment as “hostile” and “dangerous” adding that agents are forced to avoid some entrances and routes inside the building to avoid getting bitten by Commander. Despite purportedly receiving assurances that the dog would receive appropriate training, the incidents continued to happen. Further Reading Biden’s Dog Bit Secret Service Officers At Least 10 Times, Records Show (Forbes) Biden’s dog Commander no longer at White House after biting incidents (Associated Press) Follow me on Twitter . Send me a secure tip . Siladitya Ray Editorial Standards Print Reprints & Permissions",
    "pubDate": "2023-10-05 06:22:44",
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/651e52ec642ecd18166ddd32/0x0.jpg?width=960&precrop=4500%2C2531%2Cx0%2Cy75",
    "source_id": "forbescrypto",
    "source_priority": 57,
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english",
    "short_uuid": "1059cb2b"
  },
  {
    "article_id": "ec63db94476c4919fc17a0c1ee744c5e",
    "title": "Red team runs away from White, 88-70, in Arkansas' annual Red/White intra-squad scrimmage on Wednesday at Barnhill Arena",
    "link": "https://www.nwahomepage.com/sports/pig-trail-nation/red-team-runs-away-from-white-88-70-in-arkansas-annual-red-white-intra-squad-scrimmage-on-wednesday-at-barnhill-arena/",
    "keywords": [
      "Pig Trail Nation",
      "Hogville"
    ],
    "creator": [
      "Kevin McPherson"
    ],
    "video_url": null,
    "description": "Sophomore wing Joseph Pinion led six Red players in double figures with a game-high 20 points (7-of-8 field goals, including 3-of-4 from 3, and 3-of-4 free throws) to go with 4 rebounds, 1 assist, 1 steal, and boxscore plus-13 in 27 minutes as his team broke a 41-all tie at halftime to topple the White, 88-70, in front of a hearty crowd of nearly 5,500 inside the venue that the men's and women's basketball teams called home through the 1992-93 season.",
    "content": "by: Posted: Updated: By Kevin McPherson FAYETTEVILLE — Even with team centerpiece and sophomore forward Trevon Brazile sitting out there were plenty of fireworks from three and other storylines that emerged from Arkansas’ annual Red/White Showcase intra-squad scrimmage at Barnhill Arena. Sophomore wing Joseph Pinion led six Red players in double figures with a game-high 20 points (7-of-8 field goals, including 3-of-4 from 3, and 3-of-4 free throws) to go with 4 rebounds, 1 assist, 1 steal, and boxscore plus-13 in 27 minutes as his team broke a 41-all tie at halftime to topple the White, 88-70, in front of a hearty crowd of nearly 5,500 inside the venue that the men’s and women’s basketball teams called home through the 1992-93 season. Seven different Hogs hit three’s as the teams combined for 14-of-28 shooting from distance (50%). “First of all, the crowd was awesome,” Head Hog Eric Musselman said after the game. “It was closer to 6,000 than 5,500. So the turnout when the weather’s not great, and we’re still a long way from playing a game. So I thought the crowd was awesome. “I think the guys felt that, even pregame. A lot of things we need to clean up, we need to get better. But all things that we think are teachable. The shooting is obviously … We’re going to be able to stretch the defense out a little bit more than maybe we have in the past. So really pleased with our shooting. Pretty pleased wit how the flow of the offense is. We’re running an offense that we ran for about 10 games two years ago that’s kind of what Milwaukee ran two years ago. And it requires a lot of thinking and a lot of reading and pretty happy with how far advanced the guys are with that. Obviously we’ve got to get a lot, lot better. Some guys are further advanced on knowing this than others, but that’ll hopefully come over time.” Senior lead guard El Ellis had a strong floor game for the Red with his 16 points (8-10 field goals), game-high 6 assists, 1 steal, 1 turnover, and boxscore plus-17 in 28 minutes. Senior big man Jalen Graham finished with 15 points (7-of-11 field goals, including 1-of-1 from 3), 6 rebounds, 4 assists, 1 steal, and 1 turnover in 28 minutes. Senior forward Chandler Lawson had a double-double for the Red team — 13 points, 10 rebounds, 2 blocks,1 steal, 0 turnovers, and a boxscore plus-16 in 27 minutes. Veteran guard Davonte “Devo” Davis contributed 13 points (5-of-7 field goals, including 2-of-3 from 3, and 1-of-1 free throw) to go with 3 assists, 2 rebounds, 1 steal, 2 turnovers, and a game-high boxscore plus-20 in 24 minutes. Senior forward Denijay Harris chipped in 11 points, a game-high 5 steals, 3 rebounds, 3 assists, 2 turnovers, and a boxscore plus-14 in 22 minutes. The White team was led by senior wing Jeremiah Davenport, who scored all 19 of his points (6-of-10 from the field, including 5-of-8 from 3, and 2-of-2 free throws) in the first half, and he also finished with 3 rebounds, 2 assists, 1 steal, and a game-high 6 turnovers in 23 minutes. Also for the White, senior forward / center Makhi Mitchell had 13 points (6-of-7 field goals, including 1-of-1 from 3, and 0-of-3 free throws), 5 rebounds, 2 blocks, 1 assist, and 2 turnovers in 23 minutes. Freshman center Baye Fall also had 13 points (5-of-7 field goals and 3-of-4 free throws) to go with 3 rebounds, 1 assist, and 1 turnover in 18 minutes. Freshman guard Layden Blocker contributed 10 points (3-of-7 field goals and 4-of-4 free throws), a team-high 5 assists, 2 rebounds, and 1 turnover in 28 minutes. Veteran wing Tramon Mark had 7 points, 4 assists, 1 rebound, 1 steal, and 2 turnovers in 28 minutes. Sophomore guard Keyon Menifield, Jr. — he’ll redshirt in 2023-24 — had 5 points, 3 assists, 1 rebound, 1 steal, and 1 turnover in 28 minutes. The Red team shot a blistering 37-of-54 from the field (68.5%), including 6-of-11 from 3 (54.5%), and 8-of-11 at the free throw line (72.7%). The Red dominated the glass (plus-10 at 27-17) and turnovers [plus-6 at 13-7, including plus-7 in steals at 10-3). The White team shot 26-of-47 from the field (55.3%), including 8-of-17 from 3 (47.1%), and 10-of-15 from the foul line (66.7%). It seemed unlikely that Brazile would play given what Musselman told the media following practice on Thursday, Sept. 28, which was Brazile (he’s completing recovery on his injured knee that ended his season nearly a year ago in early December 2022) would likely begin competing in live, full-contact scrimmaging in “two-and-a-half weeks.” Indeed, Brazile was not included on either roster for the Red/White tilt. Musselman updated Brazile’s status following the Red/White game. “With TB, we’re being — like, I want TB in March,” Musselman said. “I mean, we want him to get his rhythm and all that. He’s done an awesome job. He’s been cleared. He’s been with his rehab guy. They’ve done all the testing. Everything is great. Probably could’ve played tonight, three minutes a half, but why? “We want him to go a little more three-on-three. He’s been going three-on-three live after we’re done with practice. So, he’ll go three-on-three live one more time this week at some point. But he’s been jumping into all of our drills. Offensively, when a player is coming back from an injury like that, that’s not really an issue. The issue is, ‘I’m guarding you or you or you and I got to react.’ And so that’s why we want to take our time. No real timeline other than we certainly — with the way it’s going now, he’s playing opening night.” Junior guard Khalif Battle went through early pre-game warmups, but left the court appearing to favor his right foot. When he returned to the court, he was in street clothes and on crutches with his foot in a walking boot. Musselman also addressed Battle’s injury status after the game. “He practiced today,” Musselman said of Battle. “I walked over and got in the gym and he said his foot was really sore. They took him for a preliminary look over at the football facility. At that point, nothing, there was no determination there was anything, no break or anything. But I know that they’re going to look at it again tomorrow with some different X-rays or whatever. “As of now, no update, nothing other than the fact he felt uncomfortable. Not in the same spot where he had a break earlier. Same foot, but not really related as of now. But we did have more than one doctor look at him over at football. Then we had a couple more doctors in our locker room. So right now, nothing unless whatever tests they run, something comes up.” My midnight in Fayetteville takeaways (2 parts) following Arkansas' Red/White Showcase on Wed @ Barnhill Arena -Rain falling outside, Hogs raining 3's inside -Players who stood out -Injury updates -Key recruiting updates, incl '24 Hog target announcing on Thurs More Arkansas Razorbacks R/W gm highlights from Barnhill -Makhi Mitchell drives left for window finish (reel 1) -Jeremiah Davenport drives paint for runner (reel 2) -Joseph Pinion dials up his 3rd triple (reel 3) -Davenport w/lightning-fast release on C&S corner 3 (reel 4) More Arkansas Razorbacks R/W gm highlights from Barnhill Arena on Wed … -Chandler Lawson wing middy (reel 1) -El Ellis drains corner Jnin transition (reel 2) -Devo & Lawson w/brilliant give-&-go in transition (reel 3) -Denijay Harris smash-cashes in 1 of his 5 stls (reel 4) One of the strengths of senior big man Makhi Mitchell's game is his roll to the cup after setting a pick … nice 2-man game here as sophomore G Keyon Menifield, Jr. fitted in a dime to set up Khi's finish … from R/W game @ Barnhill Arena on Wed … Arkansas senior forward Chandler Lawson was solid, finishing w/dbl-dbl (13p, 10r, 2b, 1s) in the Red win … Lawson's length, instincts tracking down rbs & battling for 50/50-balls in the paint, & competent face-up shooting look top-rotation worthy … Arkansas guard Devo Davis was givin' junior wing Tramon Mark the business on D … until … well, Mark hit the gas & snow-coned the finish off the window for the White team … This … is … Arkansas sophomore wing … JOSEPH PINION !!! Bustin' up rims & breakin' hearts … hello Layden Blocker !!! Arkansas freshman guard Layden Blocker dimes out to senior wing Jeremiah Davenport who splashes the first of his two made deep triples as the White team leads the Red, 6-2, early … Pre-game intros & warm-ups (incl sophomore forward Trevon Brazile , who was DNP) just prior to Arkansas' annual Red/White game on Wed @ Barnhill Arena in Fayetteville … ( sponsor Parkway Automotive) Red & White squads getting up shots inside Barnhill Arena in Fayetteville as we're about an hour from tipoff of Arkansas' annual intra-squad scrimmage … Arkansas backcourt trio of (L to R) Joseph Pinion Jeremiah Davenport & El Ellis are fielding media Q's following Red/White Showcase on Wed @ Barnhill Arena … Our gives his thoughts on the first half of the Red-White game. Next up for Arkansas is the first of two exhibition games as the Hoop Hogs will host Division II Texas-Tyler on Friday, Oct. 20, at Bud Walton Arena. The event marked the fourth Red/White game under Musselman as he enters his fifth season at Arkansas (the program did not have a Red/White game in the covid-shortened 2020-21 season). The intra-squad scrimmage was free to the public, and the doors were opened at 5:30 p.m. to allow fans to enter Barnhill. Tickets were not required for the event and seating was general admission on a first-come, first-served basis. Copyright 2023 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.",
    "pubDate": "2023-10-05 09:14:47",
    "image_url": "https://www.nwahomepage.com/wp-content/uploads/sites/90/2023/10/PLAYERS-PRESSER.00_09_19_12.Still001.jpg?w=900",
    "source_id": "nwahomepage",
    "source_priority": 21820,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "de1b31cd"
  },
  {
    "article_id": "0bf88ac3be0fd7a211e069db1c721234",
    "title": "Darren Kellenschwiler: My BSV blockchain journey",
    "link": "https://coingeek.com/darren-kellenschwiler-my-bsv-blockchain-journey-video/",
    "keywords": [
      "Interviews",
      "Baemail",
      "Bitcoin wallet",
      "BSV blockchain",
      "BSV Blockchain Association",
      "CoinGeek Conversations",
      "CoinGeek podcast",
      "Darren Kellenschwiler",
      "micropayments"
    ],
    "creator": [
      "Claire Celdran"
    ],
    "video_url": null,
    "description": "On this week’s CoinGeek Conversations, Darren Kellenschwiler takes a trip down memory lane on his long BSV blockchain history—which runs from the tumultuous days of the BCH-BSV split to his current role as a technical lead at the BSV Blockchain Association. [...] Read More... The post Darren Kellenschwiler: My BSV blockchain journey appeared first on CoinGeek.",
    "content": "Darren Kellenschwiler’s long BSV blockchain history runs from the tumultuous days of the BCH-BSV split to his current role as a technical lead at the . On this week’s , Darren takes a trip down memory lane with Charles Miller, recalling the end of 2018 when he hosted Bitcoin meetups in London. It was during this period that the BCH and BSV split occurred, resulting in heated debates and ideological divisions within the community. Darren recalled the atmosphere, when “everything was a little tumultuous, and people were taking different ideological stances. There were very strong arguments—over a beer! That’s the sort of atmosphere at that time. It was the hash wars era.” Darren was on the BSV blockchain side of the divide, firmly believing in Dr. Craig Wright as the inventor of . As he explained, “I had made my mind up years before that this chap, Dr Wright is the inventor of Bitcoin. So I didn’t really waste my time with the crowd that were somehow rebelling against him.” As BSV blockchain emerged, Darren took “a leap of faith” despite the ongoing debates about Dr. Craig Wright. As he says, “There wasn’t a lot of public detail with respect to the evidence for Dr. Craig Wright having invented Bitcoin.” This period also marked the birth of the “Bitcoin protocol is set in stone” campaign. One of Darren’s notable contributions to the BSV blockchain community was , an email application integrated with micropayments. He explained his motivation behind it: “I don’t like spam. I hate reading emails that are not relevant to me. So I thought, attach some value to it. We’ll create ‘inbox economics,’ where the highest in the inbox is the person who paid you the most for you to read it.” While Baemail gained quick adoption within the BSV blockchain community, it faced challenges in achieving widespread usage due to limitations in BSV wallet adoption. Darren’s journey continued when he met Brendan Lee from at a conference in London. Brendan bought Baemail and hired Darren, making him a co-founder of the company. Together, they delved into building Metanet applications and experimenting with hosting entire websites on the Metanet, a concept that was both groundbreaking and esoteric at the time. Today, Darren serves as the technical lead of the utilization value stream at the BSV Blockchain Association. He described his role as multifaceted, involving contributions to various aspects of the BSV blockchain ecosystem. He also emphasized the Association’s responsibility to ensure that the user experience and businesses built on BSV blockchain remain intact and thrive. Darren also highlighted his passion for tackling complex challenges and his role in documenting, analyzing, and improving wallet architectures within the BSV blockchain ecosystem. He mentioned the importance of effective communication and collaboration with developers, including discussions with Dr. Craig Wright, to advance the ecosystem’s growth and development. Darren Kellenschwiler’s journey in the BSV blockchain ecosystem exemplifies the resilience and dedication of individuals committed to the vision of a stable, scalable, and innovative blockchain. As BSV blockchain continues to evolve, Darren and others like him play a pivotal role in shaping its future.",
    "pubDate": "2023-10-05 09:00:47",
    "image_url": "https://coingeek.com/coingeek.com/wp-content/uploads/2023/10/Darren-Kellenschwiler-680x354.webp",
    "source_id": "coingeek",
    "source_priority": 123655,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "400b670a"
  },
  {
    "article_id": "cd17951cb8a8c77527ae127ffed214b1",
    "title": "Kevin McCarthy’s Downfall Is the Culmination of the Tea Party",
    "link": "https://www.politico.com/news/magazine/2023/10/05/mcarthy-tea-party-theda-skocpol-00120009",
    "keywords": null,
    "creator": [
      "By Ian Ward"
    ],
    "video_url": null,
    "description": "Political scientist Theda Skocpol on how tea party politics laid the foundation for the GOP’s current troubles.",
    "content": "In the hours after the House of Representatives’ historic vote to oust Kevin McCarthy from the speakership, a photo began circulating online of the cover of Young Guns , the splashy policy treatise authored by then-Reps. Eric Cantor, Paul Ryan and Kevin McCarthy in 2010. The irony of the photo was clear enough: The book, which featured a gleaming group portrait of the three self-declared standard-bearers of the Republican Party, was intended to introduce the rising stars of the GOP to the American people — but now, just 13 years after its publication, the book had become a visual obituary for the party’s past. When I called Theda Skocpol — a political scientist at Harvard University who’s written extensively about the rise of the tea party and the transformation of the Republican Party — shortly after the House kicked McCarthy out of the speakership, she was staring at this same photo. “I’m sitting here looking at a picture on my iPad of the three ‘Young Guns’ from that iconic cover of their book,” she said. “All three of them were felled in succession by the popular anger of the tea party base.” The tea party that Skocpol was referring to no longer formally exists as a faction in Congress, its erstwhile allies having been subsumed into the far-right Freedom Caucus or into the generic “America First” wing of the GOP. But according to Skocpol, the history of the tea party remains essential to understanding the forces that ultimately led to McCarthy’s political demise. “It represents the culmination of [the tea party movement],” said Skocpol. “All the research that I and other political scientists have done on the movement shows that by the 2010s — just before Donald Trump emerges — the tea party had taken the shape of a just-say-no, blow-it-all-up, don’t-cooperate, do-politics-on-Twitter faction — and this is the perfect expression of it. This is where it leads.” In some respects, Skocpol’s argument is counterintuitive. In the late 2000s and early 2010s, McCarthy and the other Young Guns rose to power by harnessing the grassroots power of the tea party movement, promising to slash government spending, constrain federal power and foil the Obama administration’s policy goals. But though McCarthy and the other Young Guns rose to prominence by allying themselves with the tea party movement, Skocpol said, their banishment from the GOP doesn’t mark a break with the movement’s legacy. Instead, it shows that the Young Guns never really understood the forces that they helped unleash. “The fact that McCarthy and the other Young Guns were once called tea party people because they dallied with the movement,” Skocpol said, “does not mean that the tiger wasn’t going to consume them in the end.” The following has been edited for clarity and concision. Ian Ward: You’ve written extensively about the history of the tea party movement and its aftereffects for the Republican Party. How does the vote to oust Speaker McCarthy fit into that history? Theda Skocpol: Shortly into Barack Obama’s presidency, we saw this explosion of tea party demonstrations and a remarkable degree of grassroots organizing — a couple thousand local tea parties, according to our research. There was a lot of writing at the time claiming that this organization was motivated by the same thing that people now claim drives the Republican Party when they shut down the government — cutting the deficit. But it was never about cutting the deficit. The popular side of the tea party was about anger and fear of a changing country in which a guy with ‘Hussein’ as his middle name and black skin could be elected president. The tea party — especially at the grassroots — was trying to pressure the Republican Party and its elected leaders not to compromise with a changing country or with Democratic Party politicians in Washington. Ward: How did the Young Guns fit into that mobilization? Skocpol: The tea party mobilization made a big difference electorally in 2010 in installing a Republican Congress, and probably even more importantly in installing Republican-dominated state legislatures. But it was especially potent after that in undoing any effort at compromise over immigration. Our research shows that polarization over immigration between the two major parties has played out recently and piled on top of the polarization over the civil rights revolution of the 1960s. By the time you get to the period at the end of Barack Obama’s presidency, he’s trying to find a way to incorporate long-present immigrants from Mexico and Central America and give them a path to citizenship — and that effort falls apart in 2013 and 2014. Remember that election in which David Brat in central Virginia shockingly felled Eric Cantor, who at that time was seen as the kind of rising golden boy on the Republican right? It was anger over the potential of immigration reform that played a big role in that. And then you have Paul Ryan, who inherited a Congress where the Republican caucus was increasingly riven by the rise of this angry, just-say-no style that the tea party always favored. They wanted to make sure that people were angry about changes in the country and wanted to make sure Republicans were not compromising about those. Paul Ryan was [from] Mr. Koch’s network. I think that House Republicans thought that by making him their leader, they would cement their right-wing Republican credentials— and it did with the elites around the Republican Party at the time. But among the populist right — who make up more than half of Republican base voters and the most loyal primary voters —they never liked what he had to offer. So he was gone before long. And now finally, we get to Kevin McCarthy, who is just an example of the final transmogrification of the tea party anger, which was given a national focus and much more potency by Donald Trump. Donald Trump didn’t create all this. He’s just been very good, ever since 2015, at giving it permission and focus. Ward: McCarthy and the other Young Guns who rose to power during that tea party moment in the late 2000s and early 2010s gave voice to one interpretation of the tea party movement that you mentioned, which is that it was all about fiscal conservatism and small government. Why do you think they so dramatically misunderstood the energies behind the movement? Skocpol: We have to understand the radicalization of the Republican Party as a process that has been underway since 2000. Act 1 of that radicalization was the rise of the Koch network, which was itself motivated by displeasure with what the Republicans under Bush junior and senior had been doing — for example, passing Medicare expenditures. The Koch network outflanked the Republican Party, and they put a lot of pressure on candidates and officeholders to hew the line on cutting taxes, cutting regulations and disabling public sector unions. These Young Guns were initially in tune with that — and why wouldn’t they be? They thought that’s where the money came from and where the business community had gone. But that wasn’t satisfactory to a lot of base voters around the Republican Party, who were much angrier about social changes in the country and much more upset about immigration. So I think the Republican Party was first hollowed out at the top, and then the tea party crystallized when Barack Obama was elected president and then it ended up being given further expression during the immigration reform battles and the rise of Donald Trump. I call it the bottom-up radicalization of the Republican Party, and I think it caught a lot of these Koch network darlings, including all three of these Young Guns, by surprise — although in McCarthy’s case, I think he has done his best to ride the tiger. He’s tried to have it both ways. Ward: Why do you think McCarthy was able to ride that tiger for longer than the other two? Skocpol: He’s a shapeshifter, and that’s given him staying power — up until the moment he had Democratic votes to keep the government open and then went on TV over the weekend and trashed the Democrats. The shape shifting is both a strength and a weakness. It’s a strength in that, a little bit more effectively than Paul Ryan before him, he’s been able to have it both ways — to condemn Donald Trump and then embrace him, to say he’s about cutting the deficit and he’s about cracking down on the border. If the Republican Party really had wings — and I don’t think it does at this point — he might have been able to bridge them. But by the end, he got to the point where nobody trusted him. I don’t think anybody in the Republican Party trusted his word, and Democrats definitely couldn’t. Ward: Given the fact that McCarthy rose to power during the tea party moment, is there any sense in which his ouster represents a repudiation of the tea party legacy? Skocpol: No — it represents the culmination of it. I think most people in the in the media thought the tea party was about cutting the federal budget deficit because that’s what a few elite spokesmen on TV said it was about. But our research always showed that at the grassroots, it was about popular anger over a changing country and fury at a Republican Party that was not responding to that desire. All the research that I and other political scientists have done on the movement shows that by the 2010s, just before Donald Trump emerges, the tea party had taken the shape of a just-say-no, blow-it-all-up, don’t-cooperate, do-politics-on-Twitter faction — and this is the perfect expression of it. This is where it leads. The fact that McCarthy and the other Young Guns were once called tea party people because they dallied with the movement does not mean that the tiger wasn’t going to consume them in the end. Ward: The conflict between the tea party and the Obama-era Republican Party reflected some real ideological differences between those two factions, especially on issues like immigration. Do you think the conflict between the far-right, anti-McCarthy wing of the party and McCarthy’s backers reflects a similarly robust ideological fissure? Or does it just boil down to rank obstructionism? Skocpol : I think it’s post-ideological. One of the things that Trump’s presidency accomplished was to give national expression to populist ethno-nationalism and anger at “business as usual” in Washington, D.C, and you get to a certain point where there aren’t many moderates at all in the Republican House caucus. There certainly are some people who are cross pressured because they come from Biden districts, but most of them have been enthusiastic supporters of the same kinds of issues that Matt Gaetz is speaking to. This is a disagreement over whether you should ever settle for less than 100 percent of what you want, even when you’re in a position where you don’t control more than one chamber. Ward: So if the conflict is essentially about tactics and the real energies behind the far right are cultural, why do people like Gaetz still lean so heavily on the language of fiscal conservatism? After all, this most recent incident was partly set off by McCarthy’s unwillingness or inability to slash spending levels. Skocpol: You’re not going to like the answer I’m going to give you. Ward: Try me. Skocpol: It sells with the Washington press corps. Why anybody believes this is beyond me. Did you see what Donald Trump did when he was office? Did you see what Republicans did when they controlled the entire Congress? They don’t cut anything, except taxes. And that keeps a certain number of billionaires — and even Charles Koch himself — happy. There are two strands that have played out in the Republican Party during recent years. One of them I call “McConnellism.” McConnellism is clever. It’s about using every lever of power to make sure Republicans get the federal judiciary full of judges who are going to disempower Democratic initiatives, and it’s about doing everything you can to shape the electorate, both by encouraging your own voters and discouraging the other guys’ voters. It’s at the edge of what’s legally and constitutionally legitimate. Then there’s Trumpism, which at this point has gone from bullying and threatening to actual calls for violence. One of them is very powerful in the House, and the other is very powerful in the Senate. But it’s a tactical difference. It’s not as if there’s a huge difference of policy. I think there might be some differences in policy over immigration, but those don’t really come up because nobody’s talking about legislating on immigration. Ward: So what does all this mean for the future of the Republican Party? What are the ramifications of the argument that you’re making — that there’s a fundamental continuity between the tea party movement and the MAGA movement? Skocpol: Well, everything depends on whether Donald Trump is reelected president, and I don’t think that’s impossible. I really don’t. As for the House of Representatives, I really do not know how they’re going to find a new Kevin McCarthy who can promise enough because the promises that are being demanded are impossible to fulfill. Ward: Based on the traditional tea party playbook, though, what do you think the endgame here is for the far-right faction in the House? Skocpol: Well, I think Matt Gaetz himself wants to get on TV, raise a lot of money and run for another office. That’s true of a number of the people who make up this very small group of people who were in a position to pull the hook on the grenade. But I don’t think we know how this is going to come out. If you’ve got people in power who are backed by a large number of voters who are angry, fearful, limited in the information they get about what’s going on and thinking that it would be better to blow America up than to save it — I think you’re in uncharted territory. We are in uncharted territory.",
    "pubDate": "2023-10-05 09:00:00",
    "image_url": "https://static.politico.com/c4/72/1c93ab96410ab4ba28b30f239d27/obama-silicon-valley.JPEG",
    "source_id": "politico",
    "source_priority": 388,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "eca6f47"
  },
  {
    "article_id": "0031f0c2a9d8c3a1dfedf28fb2cddf09",
    "title": "DeSantis Energy Plan Prioritizes US Economy Over Climate Advocacy",
    "link": "https://www.forbes.com/sites/daneberhart/2023/10/05/desantis-energy-plan-prioritizes-us-economy-over-climate-advocacy/",
    "keywords": [
      "Energy",
      "/energy",
      "Business",
      "/business",
      "Energy",
      "/energy",
      "Business",
      "energy",
      "standard"
    ],
    "creator": [
      "Dan Eberhart, Contributor"
    ],
    "video_url": null,
    "description": "An all-of-the-above energy plan makes sense for a country as rich in natural resources as the United States, but there’s always the risk of national campaigns to throw...",
    "content": "Forbes Business Energy DeSantis Energy Plan Prioritizes US Economy Over Climate Advocacy Dan Eberhart Contributor Opinions expressed by Forbes Contributors are their own. Dan Eberhart is CEO of Canary, LLC. Following Oct 5, 2023, 07:10am EDT | Press play to listen to this article! Got it! Share to Facebook Share to Twitter Share to Linkedin DES MOINES, IOWA - MARCH 10: Florida Gov. Ron DeSantis speaks to Iowa voters gathered at the Iowa ... [+] State Fairgrounds in March in Des Moines, Iowa. (Photo by Scott Olson/Getty Images) Getty Images Florida Governor Ron DeSantis recently unveiled his energy plan , calling for more domestic production of oil, natural gas, and minerals while promising to scrap the Biden administration’s climate policies, which he says are stifling U.S. energy production and benefiting China. The 2024 presidential hopeful, who is polling second behind former President Donald Trump in the race for the Republican nomination, promises an energy policy to benefit “Midland over Moscow,” “The Marcellus over the Mullahs,” and “the Bakken over Beijing.” An all-of-the-above energy plan makes sense for a country as rich in natural resources as the United States, but there’s always the risk of national campaigns to throw the baby out with the bathwater. “The self-imposed handcuffs on oil, gas, and critical minerals extraction will be removed,” DeSantis said at a late-September campaign event in Midland, Texas, the heart of the Permian Basin, the nation’s largest oil-producing basin. To remove those handcuffs, DeSantis wants to unwind the United State’s current climate commitments, including withdrawing from the 2015 Paris Climate Agreement. Former President Donald Trump exited the Paris Agreement in 2017, a decision incoming President Joe Biden reversed on his first day in the Oval Office. MORE FOR YOU ‘Shocking’ Leak Blows Up Mystery Of Bitcoin Creator Satoshi Nakamoto U S Tech Workers Are Experiencing A Drop In Salaries And In The Number Of Jobs Available In The Bay Area This Is Our Best Shot At Cheap 8 Dividends Since 2020 The whipsaw effect on producers, refiners and consumers can be worse than either policy decision. I believe the Biden administration has overreached in advancing a rapid transition to an all-electric economy, but not every policy decision is wrong. Correcting course will require a deft hand that can keep what works while ensuring that American families and businesses have access to abundant and affordable energy. The next administration should conduct a full review of the current policies to ensure that abundance, affordability, and American-produced are at the top of the to-do list. In addition to pulling out of the Paris deal, DeSantis says he would walk back the 2021 Global Methane Pledge to slash emissions globally by at least 30% by 2030 from 2020 levels and strike environmental, social, and governance (ESG) disclosure requirements that have tempered investors’ confidence in traditional energy stocks despite the industry paying record dividends. The domestic oil and gas industry is committed to reducing emissions and minimizing the environmental impact of its activities, so eliminating artificial barriers to investment and access to capital, as the ESG trend has done, is a good start toward achieving our universal environmental goals. Like Trump’s “Making America Energy Independent Again” agenda , DeSantis leans heavily on pledges to rip up the Biden administration’s policies favoring climate change over energy security and economic growth, including reversing restrictions to oil and gas production on public lands. Energy abundance and affordability should be our highest goals. A wealthy nation is far better positioned to address the challenges of a changing climate than a poor one. DeSantis promises to “expand federal lease sales and devolve more leasing authority to the states.” The Biden administration has largely constrained new leasing to court-ordered sales or those prescribed in last year’s Inflation Reduction Act. The administration recently canceled leases in Alaska’s National Petroleum Reserve (NPR–A), frustrating the industry and Republicans on Capitol Hill, and released a five-year offshore leasing plan that made no one happy. DeSantis is pledging to refill the U.S. Strategic Petroleum Reserve (SPR), which Biden tapped before the 2020 election to tame rising gas prices – another example of politics interfering with public policy decisions. DeSantis says he would only use the nation’s emergency oil reserve – the SPR is at its lowest level since the early 1980s – for actual supply disruptions. Given the geopolitical situation in Europe and the revanchment of the Organization of the Petroleum Exporting Countries (OPEC) and its Russian ally, to say nothing of the rise of China, maintaining robust reserves makes sense. DeSantis promises to revitalize America’s nuclear and automobile industries. DeSantis would repeal Biden’s electric vehicle (EVs) mandates and “support Americans’ right to drive the cars they want.” That doesn’t mean he opposes EVs, but he believes they must be able to compete in the marketplace without government subsidies. DeSantis says he plans to jumpstart critical mineral mining on federal lands and create a strategic reserve of critical minerals to ensure America can compete in the energy transition with China, which controls 90% of the world's critical minerals. Streamlining environmental reviews and permitting is another priority for the Florida governor, as is preventing “abusive litigation” by environmental groups that have used the courts to block projects like the Dakota Access and Keystone XL pipelines by filing frivolous lawsuits. New rules targeting natural gas stoves, furnaces, and appliances would be repealed under DeSantis, giving Americans greater choice in how they want to cook and heat their homes. Such nanny state laws should be repealed wherever they are found because they create hurdles for competition and innovation in the marketplace. DeSantis likewise promises to repeal Biden’s Clean Energy Plan , which demands a 90% reduction in greenhouse gas emissions by 2035-2040 from power plants – essentially forcing a switch to renewable energy sources like wind and solar despite cost considerations. The country might be better served by a more modest goal that's attainable and doesn't scare off investment in the energy resources we need today – and will need for decades to come. The boldest – and most controversial – part of DeSantis’ agenda is his promise of $2 per gallon retail gasoline prices by 2025, requiring pump prices to fall by about $1.85 from the current national average. That would require a crude oil price of about $55 a barrel, which could hurt U.S. crude oil production by putting too many new prospects below breakeven cost levels for new wells. U.S. refiners may also lack the capacity to deliver gasoline at that price level. Indeed, gasoline prices haven’t touched the $2 a gallon level since the depths of the pandemic in 2020, when fuel demand collapsed under the weight of government-mandated lockdowns. Such a sharp price drop would also require cooperation from the OPEC cartel, whose member states are cutting supply to boost prices above $100 a barrel. The fix is literally in to keep pump prices high. Our only hope for seeing those prices fall is to increase domestic production. That won't happen overnight, but we have the resources; we just need the will. Overall, though, the feeling among American energy executives is that DeSantis is taking positive positions for national security and traditional energy producers. He prioritizes fossil fuel production, removing regulatory red tape and keeping the government out of industry decision-making over the pace and trajectory of the low-carbon transition. DeSantis’ energy priorities reflect his concerns about the impact of energy cost inflation on Americans today rather than positioning the United States as a global leader in the fight against climate change. But he's also looking to take advantage of the economic and jobs opportunities offered by the diversification of the energy sector, focusing on critical minerals mining and a strategic reserve for these strategic resources. Follow me on Twitter or LinkedIn . Check out my website or some of my other work here . Dan Eberhart Editorial Standards Print Reprints & Permissions",
    "pubDate": "2023-10-05 11:10:22",
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/651d7b62374a3c12fdc083b2/0x0.jpg?width=960",
    "source_id": "forbescrypto",
    "source_priority": 57,
    "country": [
      "united states of america"
    ],
    "category": [
      "technology"
    ],
    "language": "english",
    "short_uuid": "54f79fdb"
  },
  {
    "article_id": "a19457517ff6a7513bc45a8d306bb490",
    "title": "Xbox’s 2023 games feel like the Series X launch lineup we never got",
    "link": "https://www.digitaltrends.com/gaming/xbox-series-x-2023-game-lineup-reflection/",
    "keywords": [
      "Features",
      "Gaming",
      "forza motorsport",
      "Gears Tactics",
      "Hi-Fi Rush",
      "Starfield",
      "xbox series s",
      "Xbox Series X"
    ],
    "creator": [
      "Tomas Franzese"
    ],
    "video_url": null,
    "description": "The exclusives Microsoft released for Xbox Series X/S this year have made 2023 feel like what 2020 should have felt like.",
    "content": "Even though we’re almost three years into the life span of the Xbox Series X and Xbox Series S , it feels like this console generation is just starting for Microsoft. It’s no secret that Xbox was slow to start up and then maintain consistency this console generation. For example, 2020 saw the company putting out a weak console launch lineup made up of ports and remasters. While 2021 had a flurry of great games, it was followed by a comparatively barren 2022. And 2023 hasn’t been perfect either (due, in large part, to the flop that is Redfall ) , but outside of that, this year delivered the excellent Hi-Fi Rush , the grandly scaled Starfield , solid ports of two Age of Empires games and Quake II , a new Minecraft title, and a technical showpiece in Forza Motorsport . Recommended Videos Looking at that varied lineup, these games showcase both the potential of the Series X and the power of Xbox as a brand. Prospects for Xbox’s lineup are up heading into 2024 too, so it feels like we’re at the proper start of the Xbox Series X and S console generation … even if it came a few years too late. Related Baldur’s Gate 3 drops Series S splitscreen support to release on Xbox in 2023 Xbox Games Showcase and Starfield Direct: how to watch and what to expect How many games featured in Xbox’s 2022 showcase actually launched within 12 months? A new beginning Looking at the 2020 launch lineup for Xbox Series X/S, it wasn’t exactly emblematic of what the console could do. While there were some nice 4K and 60 frames per second (fps) upgrades for Xbox One games, the only new draws were a console port of Gears Tactics , the multiplayer-supporting Tetris Effect: Connected , a temporary next-gen exclusive version of Yakuza: Like a Dragon , and some smaller indies like The Falconeer and Bright Memory 1.0 . Xbox Game Studios Most of those games were on or came to more platforms afterward and, in general, didn’t provide that strong of an argument for why players should stick around this console generation. But looking at many of the games Xbox has released this year, it finally feels like we have a bundle of good Xbox exclusives that show what the platform was always capable of. In my review of Forza Motorsport , I note that the game feels like a launch title because it’s an impressive technical showpiece. It runs at 4K and 60 fps in performance mode, which is something not many games this generation have done. The closest comparable games are Astro’s Playroom and Marvel’s Spider-Man Remastered on PlayStation 5, which effectively demonstrated the power of Sony’s console early on. Forza Motorsport was also built as a platform that developer Turn 10 Studios can expand over time. It plans to periodically slot in new single and multiplayer content, including new cars and tracks. A game like that makes a lot of sense early on in a console’s life span in this live-service era. It’s what Microsoft tried to do with Halo Infinite , even if that didn’t pan out as expected due to a one-year delay, and with Killer Instinct on Xbox One. Xbox Game Studios Then there’s the matter of games that intrinsically feel next-gen in scope. While that’s a much more nebulous feeling from person to person, the scale of a game like Starfield feels like something that wouldn’t have worked or run as well on an Xbox One. It’s a landmark, zeitgeisty first-party release that got the whole video game industry talking, which is something that Xbox has only managed to do a few times over the past decade and could have sorely used at the start of this console generation. On top of that, you’ve got Hi-Fi Rush and Minecraft Legends as 2023 stand-ins for the typical quirkier launch titles, in line with games like Sackboy: A Big Adventure or Ryse: Son of Rome . The Age of Empires ports show unification between the PC and console publishing departments of Xbox. And it’s also been a solid year for day-one Xbox Game Pass titles, with third-party games like Exoprimal and Lies of P hitting the subscription on launch day . It’s perhaps the first time in nearly a decade that Xbox has seemed healthy on both the first-party and third-party fronts. Xbox Game Studios While it’s impossible to say that Xbox has fully gotten its mojo back or that this is a definitive end to Microsoft’s struggles, 2023 is still the first year where it has genuinely felt like the Series X vision is coming into focus. We’ve gotten a comprehensive game lineup and reason to have faith in the viability of the future game lineup thanks to a packed summer showcase this June. It feels like a console launch year for Xbox. While that is a bit concerning as we’re three years into these consoles’ life spans, it hopefully is a sign that things will be better going forward, with Xbox truly rebounding after the lows of 2022 and Redfall . So, what does this feeling mean for players? For Xbox Series X and S owners, we finally are getting a sense of consistency and validation for the hardware we picked up, in some cases, almost three years ago. For those who don’t own an Xbox system, it’ll feel like the generation just started if you pick one up now and immediately download Forza Motorsport, Starfield , and Hi-Fi Rush . Editors' Recommendations You don’t need an Xbox Series X to play Starfield. Here’s how Turn your Xbox Series X into a Starfield machine with this console wrap Xbox Games Showcase can succeed where the PlayStation Showcase struggled Xbox will hold three video game showcases this June, including a Starfield stream Hi-Fi Rush director reveals the secret to making a great music game",
    "pubDate": "2023-10-05 11:00:47",
    "image_url": "https://www.digitaltrends.com/wp-content/uploads/2023/10/ForzaMotorsport_Review-PressKit-01-16x9-1.jpg?resize=440%2C292&p=1",
    "source_id": "digitaltrends",
    "source_priority": 287,
    "country": [
      "united states of america"
    ],
    "category": [
      "technology"
    ],
    "language": "english",
    "short_uuid": "3b6fddad"
  },
  {
    "article_id": "a8589f4a9ee5d73b513d2d2d0595c927",
    "title": "Ketamine Nasal Spray Continues To Show Strong Promise In Treating Severe Depression",
    "link": "https://www.inverse.com/health/ketamine-nasal-spray-promising-treatment-severe-depression",
    "keywords": [
      "Health",
      "Drugs",
      "Science",
      "Mind and Body",
      "Brain science",
      "homepage",
      "hp-latest",
      "Mind &amp; Body news"
    ],
    "creator": [
      "Miriam Fauzia"
    ],
    "video_url": null,
    "description": "A new study finds an esketamine nasal spray achieved remission and prevented relapse of depression in patients with treatment-resistant depression.",
    "content": "A new study is offering more evidence in support of the former party drug in helping hard-to-treat depression. Depression is a , but an erstwhile party drug is projected to flip the narrative and improve the lives of those in desperate need. Over the last several years, — especially forms impervious to conventional treatment, known as treatment-resistant depression — by rewiring the brain, encouraging a phenomenon known as neuroplasticity. Currently, ketamine is only approved by the U.S. Food and Drug Administration as an anesthetic; it isn’t approved to treat any mental health conditions. But it’s seeing off-label use in clinics offering intravenous infusions (often at a ), , and more recently, through nasal sprays. In 2019, the , an intranasal nasal spray containing esketamine, a molecule derived from the drug, based on clinical trials demonstrating its potency in not only treating but keeping treatment-resistant depression at bay. Now, a new study is offering more evidence in support of esketamine, positioning the nasal spray as even more effective than antidepressant medications like quetiapine, also known as Seroquel. In a clinical trial spanning 24 countries, among 336 participants already on an antidepressant, 28 percent saw remission of their symptoms after eight weeks on the esketamine nasal spray versus 18 percent of a similar-sized group taking quetiapine in addition to their usual antidepressants. After about 32 weeks, 22 percent of the esketamine remained in remission as opposed to 14 percent in the quetiapine group. Medical experts say these results are promising for patients with treatment-resistant depression, but more research is needed to see how truly effective the esketamine nasal spray is compared to other antidepressants — not just quetiapine — and whether the former party drug is safe for patients to take long-term. The in the . Lasting remission While a majority of individuals with depression will get better with conventional antidepressant medications, 10 to 30 percent don’t respond to treatment at all. called the Sequenced Treatment Alternatives to Relieve Depression (or STAR*D) study, those getting treatment for depression will generally enter remission (or return to normal levels of functioning) in a step-wise fashion: 30 percent after the first treatment, 50 percent after two treatments, 60 percent after three, and 70 percent after four. Studies show esketamine does seem to work pretty well when compared against a placebo for individuals with hard-to-treat depression, , director of the Center for Affective Disorders at King’s College London, who co-led the study, tells . However, there hasn’t been much data on how the esketamine nasal spray stacks up against other recognized, more affordable treatment options like quetiapine. Typically, ketamine is delivered as an intravenous infusion. To suss out how well it works against other treatments, 676 adults between 18 and 74 were recruited and screened from August 2020 to November 2021 across 24 countries. These were individuals with treatment-resistant depression already on an antidepressant — either a selective serotonin or serotonin-norepinephrine inhibitor. Participants were randomly put into two groups, but knew what they were getting: the esketamine sprayed up the nose twice a week in a health care setting or quetiapine taken daily. “A very important thing of this study was to look at not only the people who got better but also stayed better over the course of 32 weeks,” says Young. And that’s what the researchers saw. After eight weeks of treatment, 28 percent of the esketamine group saw remission of their treatment-resistant depression, and 24 weeks after the initial treatment, 22 percent didn’t relapse. (Whether someone was functioning back to normal was determined by the Montgomery-Åsberg Depression Rating Scale, a 10-item clinician-rated scale used to assess the severity of depressive symptoms in those with mood disorders.) This is compared to 18 percent in the quetiapine group, 14 percent of whom didn’t relapse after the same time period. Therapeutic potential with many questions , chief of psychiatry at Massachusetts General Hospital, who wasn’t involved in the study, told in an email that the findings were in line with what many clinicians have come to expect with the efficacy of nasal esketamine for people with treatment-resistant depression. However, because the study was limited to comparing esketamine to quetiapine, it’s hard to say how much better the nasal spray is compared to other drugs used for treatment-resistant depression. For , professor of psychiatry at Harvard Medical School, who was also not involved in the study, there are concerns about how much the placebo effect may be at play during the course of the entire clinical trial, given participants knew what they were getting and the fact esketamine can only be administered in-person by a health care professional. “There’s a big placebo effect of giving that much attention to a patient,” he tells . He also mentions other factors at play, separate from the placebo effect. “People get a little bit of high when they get [the esketamine nasal spray].” While giving short-term doses of esketamine appears to be safe for patients, Anand says there’s the issue of potential addiction associated with esketamine with prolonged use, which needs to be further investigated. Right now, it’s not entirely clear how long esketamine can keep depressive symptoms at bay. Young says when treating severe or recurrent depression with conventional antidepressants, a patient would need to remain on medication for about six months although this can be as long as two years. He believes this could be the same for nasal esketamine. Like ketamine infusions, esketamine nasal sprays aren’t cheap, but they may be more cost-effective, . As millions of people around the world suffer from depression, the hope remains for esketamine to revolutionize the way we approach mental health care.",
    "pubDate": "2023-10-05 11:00:25",
    "image_url": "https://imgix.bustle.com/uploads/getty/2023/10/4/61c6c8d3-dade-4edf-9638-6c64863aabdd-getty-1298858720.jpg?w=500&fit=max&auto=format%2Ccompress",
    "source_id": "inverse",
    "source_priority": 1679,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "17f4f42c"
  },
  {
    "article_id": "93fa0ae449129414d20b7d1520f5ebc3",
    "title": "Hundreds of potentially toxic road runoff outfalls polluting England’s rivers",
    "link": "https://www.theguardian.com/environment/2023/oct/05/potentially-toxic-road-runoff-outfalls-polluting-england-rivers",
    "keywords": [
      "Rivers",
      "Pollution",
      "Road transport",
      "Water",
      "Environment",
      "World news",
      "Automotive emissions",
      "England",
      "UK news",
      "Wildlife",
      "Conservation",
      "Fish",
      "Health"
    ],
    "creator": [
      "Rachel Salvidge and Leana Hosea"
    ],
    "video_url": null,
    "description": "Exclusive: No regulator is monitoring scale of impact of cocktail of dangerous chemicals on wildlife or public healthA toxic cocktail of damaging chemicals created by road pollution is flowing into England’s rivers and no regulator is monitoring the scale of its impact on wildlife or public health.More than 18,000 outfalls such as pipes and about 7,700 soakaways managed by National Highways discharge rainwater potentially contaminated with heavy metals, hydrocarbons, microplastics and other chemicals from the main road network into rivers and on to land. Continue reading...",
    "content": "A toxic cocktail of damaging chemicals created by road pollution is flowing into England’s rivers and no regulator is monitoring the scale of its impact on wildlife or public health. More than 18,000 outfalls, such as pipes, and about 7,700 soakaways managed by National Highways discharge rainwater potentially contaminated with heavy metals, hydrocarbons, microplastics and other chemicals from the main road network into rivers and on to land. Last month, National Highways reported it had assessed its discharge points and found 1,236 outfalls and soakaways had “a potential high risk of pollution”. Of these, “145 have a verified high risk of pollution and require mitigation” while the remaining 1,091 had a “potential high risk” of “polluting the water environment”. runoff map Analysis by the Guardian and Watershed Investigations of hundreds of these sites reveals that about 70 are located in areas that are legally protected for important habitats or wildlife, and about 250 are within 1km (0.6 miles) of a protected site. Hundreds more discharge to rivers and land with no formal protection. Despite urban and transport pollution accounting for 18% of England’s water bodies failing to meet good ecological standards, highways outfalls are not regulated under environmental permitting regulations, which means there is less scrutiny and no monitoring in place. Guy Linley-Adams, a solicitor at the charity Wildfish, said: “The Environment Agency has the power to bring highways drains and discharges under environmental permitting if they involve ‘the discharge or entry to inland freshwaters, coastal waters or relevant territorial waters of any … poisonous, noxious or polluting matter’. “That would certainly appear to be the case here, so the agency must show that it has considered the problem and explain why it has not yet, to our knowledge, required permits that limit pollution of rivers from, at the very least, the higher risk discharges that have been identified by National Highways. “It is no good just saying: ‘We don’t know how big this problem is.’ Put simply, the agency has a duty to find out.” National Highways said it did not routinely monitor runoff because the results varied depending on rainfall and river flows, and because it would not be practical or good value. It had instead developed a predictive tool to determine scenarios where the risk of impacts on water quality were unacceptably high. The lack of monitoring makes it impossible to understand the scale of the pollution but it is also hampered by lack of knowledge over the total number of outfalls across the country. Jo Bradley, a former Environment Agency officer who runs the Stormwater Shepherds not-for-profit, said: “National Highways operates 3% of the road network and they have over 25,000 outfalls and soakaways. Imagine how many there are across the entire road network. The number of these outfalls dwarfs the 15,000 storm sewer overflows, and perhaps the impact of the pollution is worse.” Ten potentially high-risk outfalls drain runoff from the M27 bridge into the River Hamble conservation area, which flows into the Solent. Some of England’s rare and fragile chalk streams are also under threat from runoff; the M1 discharges into the River Colne, near Watford, and runoff from the M3 flows into the River Itchen, in Hampshire, which is home to salmon, brown trout, grayling and otters. A cluster of 24 outfalls surround the River Kennet chalk stream area and its tributaries near Reading. Official data shows the river system has high levels of heavy metals and hydrocarbons, which are associated with road runoff. Charlotte Hitchmough, the director of Action for the River Kennet, said: “The people responsible for highway drainage actively encourage the disposal of polluted rain water straight into the river, even rivers that have the highest levels of legal environmental protection. skip past newsletter promotion Sign up to Down to Earth Free weekly newsletter The planet's most important stories. Get all the week's environment news - the good, the bad and the essential Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion “Working with the Environment Agency we have measured runoff from the M4 motorway into the River Lambourn causing turbidity to increase 100 times … The riverbed is contaminated with a variety of polyaromatic hydrocarbons (PAHs) from oils and tar as well as heavy metals and microplastics, yet it has been impossible to get any action from National Highways.” Some PAHs are known to be carcinogenic and are classed as priority hazardous substances under the Water Framework Directive. “It’s an incredibly complicated cocktail of 300 or so chemicals,” said Joe Pecorelli, of the Zoological Society of London. “In the summer you get an accumulation of chemicals on the road surfaces … and when the rain comes, all that material – tyre wear , all the metals from brake pads – gets flushed directly into rivers … which causes the reduction of oxygen. In urban areas this is a perennial problem. Every summer we experience fish kills in those rivers where there are fish remaining.” Fish are not the only species under threat. Prof Andrew Johnson, from the Centre for Ecology and Hydrology, said persistent and bioaccumulative chemicals such as PAHs could reach the ocean, “in which case we start to worry about animals such as cetaceans [dolphins, porpoises and whales]”. However, he said the risk was hard to determine because the chemical loads were unknown. An Environment Agency spokesperson said outfalls and road drains were “not directly regulated by the Environment Agency but we do work with the government and partner organisations to reduce pollution from roads. This includes working closely with National Highways to influence their road investment strategy to include pollution mitigating schemes on their priority list of outfalls.” Stephen Elderkin, the director of environmental sustainability at National Highways, said: “We are committed to addressing all of our high-risk water outfalls by 2030 and our water quality plan 2030 sets out a high-level programme of work to achieve this … National Highways has also invested in a programme of research to understand the risk of pollution from microplastics in road runoff.” Under National Highways’ plan, four outfalls have confirmed funding for mitigation this year, and “17 outfalls and soakaways have been identified for potential delivery in 2024-25”. Dr Sue Young, the head of land use planning at the Wildlife Trusts, said it was “hugely concerning that National Highways doesn’t actually know the scale of the problem, and despite having identified over a thousand potentially polluting outfalls, it is mitigating just four of these this year. It’s hard to see, with this snail’s pace of action, how they will resolve this toxic issue by 2030. “Nature is in crisis now, with one in seven species in the UK at risk of extinction. We believe the next road investment strategy should allocate funding to act with greater ambition to stop this pollution now, rather than allowing most sites to continue putting this toxic mix into our most vulnerable rivers and streams until almost the end of the decade.”",
    "pubDate": "2023-10-05 11:00:11",
    "image_url": "https://i.guim.co.uk/img/media/d20b3c145b4e944b7f371cfc818bc91766efba89/0_176_3500_2101/master/3500.jpg?width=460&quality=85&auto=format&fit=max&s=b2269396dbf8e1836e57cd00735c6a46",
    "source_id": "theguardian",
    "source_priority": 106,
    "country": [
      "united states of america"
    ],
    "category": [
      "health"
    ],
    "language": "english",
    "short_uuid": "5d7104d"
  },
  {
    "article_id": "7aba00be50af100ca154c3604bb75347",
    "title": "Menendez’s alleged sharing of information with Egypt risked lives of US embassy staff, ex-US official says",
    "link": "https://www.theguardian.com/us-news/2023/oct/05/bob-menendez-egypt-us-embassy-staff-danger",
    "keywords": [
      "Bob Menendez",
      "Egypt",
      "US Senate",
      "US news",
      "Middle East and north Africa",
      "World news"
    ],
    "creator": [
      "Ruth Michaelson and Stephanie Kirchgaessner"
    ],
    "video_url": null,
    "description": "Former diplomat said senator’s allegedly corrupt actions could have put embassy staff in the sights of Egyptian intelligenceThe lives of staff at the US embassy in Cairo may have been put in jeopardy by the indicted Democratic senator Bob Menendez’s alleged sharing of sensitive personnel information with the Egyptian government, according to former senior US officials who said the charges represented a grave betrayal of trust.The New Jersey senator temporarily stepped down from his powerful position as chairman of the Senate foreign relations committee in September after he was indicted by federal prosecutors in New York on corruption charges, including allegations that he accepted cash bribes and gold bars in exchange for breaching his duties “in ways that benefited the government of Egypt”. Continue reading...",
    "content": "The lives of staff at the US embassy in Cairo may have been put in jeopardy by the indicted Democratic senator Bob Menendez’s alleged sharing of sensitive personnel information with the Egyptian government, according to former senior US officials who said the charges represented a grave betrayal of trust. Gold bars and stacks of cash: how Bob Menendez ended up charged with bribery Read more The New Jersey senator temporarily stepped down from his powerful position as chairman of the Senate foreign relations committee in September after he was indicted by federal prosecutors in New York on corruption charges, including allegations that he accepted cash bribes and gold bars in exchange for breaching his duties “in ways that benefited the government of Egypt”. Menendez pleaded not guilty to the allegations and has resisted calls for his resignation, including from fellow Democrats. Among former senior US officials and some Egyptian dissidents, one accusation included in the indictment against the senator stands out: that in May 2018, Menendez procured details from the state department about the number and nationalities of people working at the US embassy in Cairo, one of the largest US missions in the Middle East. Menendez is accused of passing this information to Egyptian officials, via his partner, Nadine Menendez, and a New Jersey businessman, Wael Hanna, who recently pleaded not guilty to charges that he bribed the senator. Menendez, Nadine Menendez and Hanna have all denied wrongdoing. The indictment states that “although this information was not classified, it was deemed highly sensitive because it could pose significant operational security concerns if disclosed to a foreign government or if made public”. The FBI has also reportedly opened a counterintelligence investigation related to the charges. “If the allegation is true, this is reprehensible. One of the worst aspects of this is that it’s not only selling influence, it’s really putting people’s lives in jeopardy,” said a former high-ranking state department official who worked across the Middle East, including Egypt. “I’d label this charge in the indictment a betrayal of trust,” said Gordon Gray, a former diplomat with 35 years in the foreign service whose postings included ambassador to Tunisia, senior adviser to the US ambassador to Iraq and deputy chief of mission in Cairo. “Our Egyptian employees … work for us under potentially high risk to themselves and their families.” It’s also a betrayal of trust of the US government writ large to protect its people Former diplomat Gordon Gray He added: “It’s also a betrayal of trust of the US government writ large to protect its people.” The state department declined to respond to questions about the impact of the apparent leak or whether it was providing additional security to individuals who may have been compromised. US personnel with knowledge of the Egyptian security state have long understood the specific risks facing diplomats based in Cairo – and that those working at the embassy, particularly Egyptian nationals, were likely to be the target of surveillance by Egyptian intelligence. Such fears sharply increased after the 2013 military coup that brought Egyptian president Abdel-Fatah al-Sisi to power, which spurred a resurgence in the power of Egyptian intelligence bodies. For the US embassy in Cairo, the arrest and detention of staffer Ahmed Aleiba a year later was a watershed moment. Reporting in Egyptian pro-government media suggested that Aleiba, an Egyptian national, was detained and transferred to the custody of an Egyptian intelligence body after accusations that he had coordinated meetings between US officials and the Muslim Brotherhood, a banned group. Pressure on foreign missions has also extended to those who meet with diplomats: in 2020, two employees of the Egyptian Initiative for Personal Rights, a prominent human rights organisation, were detained by security forces after hosting a meeting for a group of western diplomats at their offices in Cairo. skip past newsletter promotion Sign up to First Thing Free daily newsletter Our US morning briefing breaks down the key stories of the day, telling you what’s happening and why it matters Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion “The Egyptian government is less interested in dissuading people working for Americans than using these people as intelligence-gathering assets, so it’s not necessarily a physical safety thing for Americans in a place like Egypt,” said the former state department official. “This also means that the government of Egypt, which receives over $1bn annually from the USA, is gathering intelligence on another country that anointed them a major non-Nato ally.” The US grants Egypt $1.3bn in foreign military aid annually, while the Biden administration recently opted to withhold $85m, citing rights concerns. Following Menendez’s indictment, acting foreign relations committee chairman Ben Cardin as well as members of Congress moved to block a further $235m, the maximum possible amount, until Egypt’s record on human rights improves. Others said that while the information on embassy staff that Menendez allegedly passed to Egyptian officials was subject to constant change, it was valuable because Egyptian intelligence would have been able to compare it to other data secured through surveillance, to gauge which members of the embassy could be employees of US intelligence organisations and target Egyptian staff working there long term. “The Egyptian government wouldn’t just be relying on Menendez for information like this – obviously they have their own sources and methods of how to source it, including visas, passports and counting the numbers,” said Ben Fishman, a former member of the US national security council overseeing north Africa and Jordan. Referring to the allegations in the indictment, he added: “Being willing to convey that information and forward it on is, in my view, inappropriate for a senator.” Gray pointed to how Egyptians employed at the embassy are particularly vulnerable to intimidation by local security forces. “The pressures that the locally engaged staff face are always on the mind of US embassies, at least US embassies in non-democracies,” he said. “They don’t have diplomatic immunity, and their families are there. It can be a much more precarious situation for them.” One US-based Egyptian dissident said the Egyptian government would be aware of Egyptians staffing the US embassy in Cairo, and believed there were likely already informants who work for Egypt inside the embassy. But he said the alleged sharing of sensitive and non-public information, as described in the indictment, meant that Egypt gained another, highly reliable, source of information about embassy employees. “It would have been seen as a definitive list,” the person said.",
    "pubDate": "2023-10-05 11:00:11",
    "image_url": "https://i.guim.co.uk/img/media/6bf5c8796f65efd06f74d2fa79247c4905b4839c/0_7_4313_2590/master/4313.jpg?width=460&quality=85&auto=format&fit=max&s=0260b1a7b1ad6024e7887855a3cffc42",
    "source_id": "theguardian",
    "source_priority": 106,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "170f2b32"
  },
  {
    "article_id": "967098bb269f7699a6f7898db368c104",
    "title": "Selena Gomez Does Sparkly Flower Power On the Red Carpet",
    "link": "https://www.glamour.com/story/selena-gomez-does-sparkly-flower-power-red-carpet",
    "keywords": [
      "Style"
    ],
    "creator": [
      "Kathleen Walsh"
    ],
    "video_url": null,
    "description": "With a fresh new bob, of course.",
    "content": "Fashion probably wasn't the important topic discussed at Benefit Gala on October 4, but we do need to talk about the flowery, girly, and extremely sparkly gowns the Rare Beauty founder wore to the event. Styled by , Gomez appeared in a total of three looks over the course of the evening, including a long-sleeved with a botanical print which she wore on stage, a shimmering purple frock shaped like a large lotus flower, and the pièce de résistance, a crystal-encrusted silver gown with a crystal flower appliqué at the neck. The dazzling dress was perfectly fitted to Gomez's figure, and featured a short train and halter neck. (When she made time for all of these costume changes, I do not know.) Gomez accessorized all three looks with a pair of silver statement earrings and a new bob haircut—because it is the law that all celebrities get a bob now. Per the fund's website, started the , which supports mental health services for young people, after her own struggles with mental health. “I went a long time without the mental health support I needed because I didn't understand what I was feeling,” she writes.",
    "pubDate": "2023-10-05 13:23:01",
    "image_url": "https://media.glamour.com/photos/651eb747e1b54aaa13203e37/master/pass/GettyImages-1717670745.jpg",
    "source_id": "glamour",
    "source_priority": 722,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "38d2eb02"
  },
  {
    "article_id": "2ece3106808952ea619a8e813dda7da4",
    "title": "Yes, the original Barbie is a stereotype. But children also create their own 'Barbie worlds'",
    "link": "https://phys.org/news/2023-10-barbie-stereotype-children-worlds.html",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "With the blockbuster success of the \"Barbie\" movie and the related expansion of Barbie branding and merchandising, educators and parents may find themselves wondering about Barbie's original purpose: as a child's toy.",
    "content": "October 5, 2023 This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility: fact-checked trusted source written by researcher(s) proofread by Ozlem Cankaya, The Conversation With the blockbuster success of the \"Barbie\" movie and the related expansion of Barbie branding and merchandising , educators and parents may find themselves wondering about Barbie's original purpose: as a child's toy. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1449240174198-2'); }); Barbie has become an icon since her introduction in 1959 . On the positive side, dolls like Barbie can serve as a canvas for imaginative storytelling and role-playing . Children often create elaborate scenarios, dialogs and relationships among their dolls, and they refer to the thoughts, emotions and desires of themselves and others while playing, supporting language and emotional development . Dolls often act as catalysts for children to explore different roles (or careers) and social scenarios, potentially encouraging aspirations and broadening horizons. Additionally, Barbie play can promote fine motor skills as children dress and accessorize the dolls. Dolls can also facilitate social interaction when shared with peers or caregivers. However, there is a potential downside. Barbie dolls come with predefined appearances and characteristics, which can limit the range of narratives a child may explore. There is also marketing of an entire \"Barbie world\" of branded objects , which many parents may choose not to invest in for financial or environmental reasons. In the face of consumer pressures, while also being mindful of educational aspects of play, parents or caregivers can consider integrating open-ended everyday objects and versatile toys into children's play with Barbie or other commercially successful toys. This is a rewarding approach that promotes growth, creative thinking , adaptability and a sense of wonder. While Mattel, the maker of Barbie, today features Barbies featuring multiple skin tones, hairstyles and body types , the original Barbie may reinforce certain stereotypes, particularly related to whiteness and gender roles . And while the Barbie brand has evolved, many unfortunate decisions were made historically. For example, in 2014 Mattel apologized after readers complained about a book where Barbie as a computer engineer waited for males to save the day from computer difficulties . Mattel's release of Teen Talk Barbie in 1992 sparked controversy due to a particular phrase: \"Math class is tough!\" The phrase perpetuates the stereotype that struggling with math is expected or even normal. The doll inadvertently contributed to a culture that discourages girls from pursuing mathematics and other STEM fields , reinforced gender biases and perpetuated misconceptions that can have far-reaching consequences on children's educational choices and career aspirations. When children play with dolls and toys, they are not just having fun, but also absorbing messages and attitudes from their playthings. Researchers name play in early childhood as one of the powerful early influences on later gendered outcomes . The choice of toys and play materials can contribute to how adults reinforce gendered patterns and habits, encouraging boys and girls to develop different interests and skills. For example, psychology researchers Emily F. Coyle and Lynn Liben explored the impact of gendered toy packaging in five-year-old children's STEM play with their mothers. Mothers and their child (31 daughters; 30 sons) were randomly assigned to play with a mechanical toy packaged for girls (GoldieBlox) or boys (BobbyBlox). They discovered children's independent play varied with game packaging. When preparing for the play, mothers who were provided BobbyBlox built more toy pieces than those given the GoldieBlox. Also, mothers built more with their sons, whereas they focused more on reading the toy's instructions with their daughters. Further exploration of young children's early STEM play patterns may effectively influence later outcomes. Encouraging children to modify and personalize their play experience in a variety of ways can mitigate some of the stereotypical gender-specific effects of Barbie-like dolls . Repurposing common materials to craft intricate settings and props, children are empowered to envision boundless scenarios. Creative fusion allows children to transform ordinary items into extraordinary elements within Barbie's world. For example: The personalized aspect of using everyday materials to create accessories or outfits for dolls, or combining toys to allow for envisioning new worlds, fosters a sense of autonomy in children and instills a sense of ownership and pride in their creations. As children engage in collaborative play and work together to construct shared goals, they practice communication, teamwork and negotiation. Using ordinary items also nurtures an early awareness of environmental consciousness in children, teaching them the value of repurposing materials, reducing waste—and the wondrous capacity of imaginative play. Provided by The Conversation This article is republished from The Conversation under a Creative Commons license. Read the original article .",
    "pubDate": "2023-10-05 15:40:09",
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2023/yes-the-original-barbi.jpg",
    "source_id": "phys",
    "source_priority": 6461,
    "country": [
      "united states of america"
    ],
    "category": [
      "science"
    ],
    "language": "english",
    "short_uuid": "94245a09"
  },
  {
    "article_id": "d902eb7090415d73bdd67fb9c3363e1f",
    "title": "What the current wave of layoffs means for the games industry",
    "link": "https://www.gamesindustry.biz/what-the-current-wave-of-layoffs-means-for-the-games-industry",
    "keywords": [
      "Layoffs"
    ],
    "creator": [
      "James Batchelor"
    ],
    "video_url": null,
    "description": "Sign up for the GI Daily here to get the biggest news straight to your inbox 2023 continues to be a difficult year when it comes to layoffs. In the past couple of weeks alone, companies including Ascendant Studios, Beamdog, Crystal Dynamics, Roblox, Blizzard, Epic Games, Team17, Naughty Dog, Twitch and Keywords have all dismissed varying numbers of staff, ranging from 10 Hearthstone developers to more than 800 Epic employees. Read more",
    "content": "to get the biggest news straight to your inbox 2023 continues to be a difficult year when it comes to layoffs. In the past couple of weeks alone, companies including , , , , , , , , and have all dismissed varying numbers of staff, ranging from 10 Hearthstone developers to more than 800 Epic employees. The reasons for these redundancies can vary. Crystal Dynamics and Beamdog, for example, were which also resulted in the closure of studios such as . Meanwhile the Keywords layoffs reported today are a consequence of . But when job cuts make headlines so frequently in such a short space of time, it's easy to see there are wider issues at work. reached out to a range of analysts, recruiters and investors, who all cite myriad factors that are a sign of the current economic climate: high interest rates, inflation, slowed growth, rising production costs, and increased competition (to name but a few). These challenges are not unique to gaming, as indicated by the widespread layoffs at major tech firms like Microsoft, Meta and Amazon. \"In gaming, the significance of 'efficiency' has risen dramatically over the last 18 months,\" Kantan Games CEO Serkan Toto tells us. \"There is a much higher sense of urgency now to save costs and run slimmer organisations. The pressure is on for game industry CEOs to pull out the hammer and handle the biggest cost block of them all, namely staff. And this is what we have seen in 2023. \"All this happens under a sense of 'If we don't do it, our competitors will and then eliminate us on efficiency,' and people get fired left and right at the moment. There is also the phenomenon that often CEOs think 15% to 20% of their people are redundant anyway at any point in time.\" Hiro Capital partner Spike Laurie believes you can trace the current wave(s) of layoffs to one in particular: Elon Musk cutting 50% of Twitter's workforce in November 2022. \"He had figured out from people's electronic passes that there were more people serving food in the cafeteria than actually there to eat it,\" he says. \"This was the impetus other business leaders needed in order to start looking carefully at the size of their companies and start making judicious cuts. Why? We have come to the end of an economic cycle, fuelled by an addiction to cheap and readily available cash. \"A year later, we're seeing cuts in the games industry workforce and many good, talented people losing their jobs and financial security. This is made more painful for those affected by the high cost of basic goods like energy and food.\" Widespread layoffs are made all the more galling by what IDG Consulting's SVP of consulting Emilie Avera describes as a \"glaring disparity\" between executive and non-executive compensation, particularly in publicly traded companies. \"While measures like contractor and employee layoffs effectively reduce overhead costs and momentarily boost the appearance of balance sheets, there's an evident lack of comparable reduction in total compensation packages for executives,\" she says. She continues: \"When it comes to executive compensation, the current imperative is a robust 'pay-for-performance' model, where executive boards strictly enforce benchmarks for the upper echelons of management. Their compensation should be tied to tangible outcomes and performance metrics, with compensation adjusted downwards if the set targets aren't met.\" The pandemic inevitably factors into the current state of the market, too. Avera observes that the games industry expanded dramatically while stay-at-home measures were in place, but this was never going to last. \"As money started to dry out, firms were forced to reassess the ways funds were allocated, with layoffs emerging as an immediate solution to cut expenses,\" she explains. \"The short-term vision of chasing aggressive growth, often at the expense of sustainable profitability was exacerbated by investors — lured by the promise of rapid returns, many pursued hasty acquisitions, often without sufficient diligence paired with poor budget management. This frantic approach, driven partly by a 'fear of missing out,' had the unintended effect of bruising the industry they had aimed to prop up.\" Avera compares this to the entertainment sector, where streaming platforms prioritised audience expansion over profitability. Just as the streaming space is now recalibrating by increasing prices to \"mend their unsustainable model,\" the games industry is going through \"a comparable reckoning.\" \"The pace of growth for the games industry has peaked. It will keep growing, but mostly driven by increasing population and better internet connectivity, rather than by strengthening fundamentals of the business\" Liz Prince, head of recruitment specialist Amiqus, says that from a hiring perspective, the current situation is more of a recalibration than a deep-seated industry issue that warrants serious concern. \"Firstly, I'd like to express my compassion for all those affected by the recent layoffs and studio closures,\" she says. \"These times are undoubtedly challenging, and it's deeply unsettling to see talented individuals in our industry facing job losses. \"Every sector undergoes cycles of expansion and retraction, and what we're seeing looks to be a post-COVID realignment. As we know, during the pandemic there was a huge surge in games and this sudden boom led to studios scaling up swiftly, making acquisitions, and perhaps some over-investment in certain areas. Now some studios need to readjust. But it's worth noting that while certain studios are facing challenges, there are many others that are expanding.\" Ampere Analysis' head of games research Piers Harding-Rolls agrees: \"This is nothing new, especially in tougher economic times, although the scale of big budget games development today means that when a project gets cancelled, this can lead to hundreds of layoffs and that means a broader impact than in the past. \"It wasn't long ago that a major talking point of the industry was talent shortage. Key positions within studios were going unfilled and competition between companies for talent was intense. For bigger companies, this was part of the strategic rationale behind many of the acquisitions that took place between 2019 and early 2022.\" He adds that the M&A spree during the past few years was also fuelled by \"lofty games company valuations\" that peaked during the pandemic, and the availability of cheap debt. However, debt is now considerably more expensive and company valuations have fallen since Microsoft first announced its record-breaking proposed purchase of Activision Blizzard. Laurie is also unsurprised by the recalibration and companies resorting to layoffs, noting that many have been housing \"large, unprofitable teams.\" \"For a while, at peak hype, there were too many games being made by too many new teams, funded by cheap money and by the temporary boom in venture capital financing,\" he explains. \"Funds were pouring money into untested blockchain and metaverse studios, driving up wages but often not providing the studios enough runway to launch a game.\" Avera adds another factor: consumers are buying fewer games and spending more time with select franchises, a trend likely to accelerate as the market continues to shift towards live service titles. Even single-player titles are demanding more of players' time, with Avera noting that some of the biggest recent hits, including Baldur's Gate 3 and Zelda: Tears of the Kingdom, take 50 or more hours simply to get through the main story. \"These lengthy games, combined with a labor/talent shortage among developers, engineers and designers, place immense pressure on an industry striving to capture as much mindshare as possible from a discerning gaming audience,\" she says. Kim Parker-Adcock, owner of recruitment agency One Player Mission, adds that consumers' spending habits have broadened again in the wake of lockdowns: \"People are spending what disposable income they have on going out, holidays abroad, events and so on. You will still get the die-hard gamers spending every spare dime on games but a lot less can afford a luxury item that might also require buying new hardware to play them i.e. latest consoles. Sony's recent exclusives are no longer being released on PS4, so you'll have to fork out £400+ for a PS5, too.\" Midia Research co-founder and senior analyst Karol Severin adds: \"The pace of growth for the games industry has peaked. The industry will keep growing in dollar terms, but it is mostly going to be driven by increasing population and better internet connectivity, rather than by strengthening fundamentals of the games business. While in-game spending will still grow, so will games subscriptions. And as cloud gaming subscriptions grow, there will be less of a need to buy high price point individual games. \"The games industry is about to see similar pressures as the music and video industries saw when streaming subscriptions truly took off. There will, of course, be many differences in how these dynamics will play out, but the fact that the value of an individual game in consumers' eyes will decline is inevitable. As such there will be a need for fewer games, therefore fewer developers and publishers.\" \"Every sector undergoes cycles of expansion and retraction, and what we're seeing looks to be a post-COVID realignment... While certain studios face challenges, many others are expanding Severin adds that the number of games released is growing significantly faster than global games revenue; for example, he says, Steam is tracking to have seen more than 13,500 games in 2023, compared to 12,500 last year. There is also the added issue of companies whose business models aren't necessarily dependent on games (such as Netflix, Amazon and Apple) increasingly grabbing for more market share. In terms of what the industry can do going forward, Avera has a series of suggestions. For example, she believes generative AI could be used to assist (but not replace) overburdened development teams and reduce total development time, and predicts that more companies will turn to outsourcers such as Keywords and Virtuos for services such as art, engineering, audio and more so their in-house teams can focus on their core strengths. User-generated content could also be a way to trim development costs, although she acknowledges there are imperfections in this business model, citing the public scrutiny over Roblox and its revenue-sharing models. But ultimately, Avera believes the industry needs to address its expectations. \"Righting the ship will require gaming companies and investors to agree on and adhere to realistic KPIs,\" she says. \"While positive sentiment around a game on social media platforms is heartening, it does not necessarily correlate with solid sales. Tangible metrics such as review scores, pre-sales, and proven track records of releasing games with minimal bugs should be appraised when making investment decisions.\" She adds: \"It's undeniable that some studios may experience further financial strain, and additional course corrections — including new layoffs — might be forthcoming. Yet these adjustments, however painful in the short term, are necessary steps toward ensuring a sustainable future for the gaming industry.\" Severin adds that there is no silver bullet, since so many of the factors behind these layoffs are out of the industry's control: inflation, interest rates, and so on. \"The games industry was staffed and invested for overdrive success and is simply correcting to a more natural/profitable equilibrium now,\" he says. \"Though much of the above sounds like doom and gloom, this industry isn't going anywhere – it will still be worth approximately $187 billion this year. For games companies thinking of future projects, carefully planning routes to profitability over user growth will become increasingly important. Also, we see increasingly more success in the future for games that focus on capturing and serving enthusiastic niches, rather than competing for mass audiences.\" Toto warns that these layoffs are not about to ease off anytime soon, adding: \"There are still studios in the market that seem to be overstaffed, looking at them from the outside. My guess is we will see further bad news through 2024.\" Prince assures those affected by these and future layoffs that their skills and expertise are \"still very much in demand,\" noting that there are still plenty of studios looking for talent. Similarly, Parker-Adcock notes that the downsizing of studios often leads to new ones opening doors. \"Whilst these [new] studios are still growing, it's [key] to make sure they don't overspend to ensure their survival and again only hiring for critical roles. I don't see much changing until the new year once the industry has seen what sales have been like for their Christmas releases.\" Laurie concludes by observing that the future may \"superficially look challenging\" but the growth of the industry with Gen Z rising and games technologies being adopted by big tech firms like Meta and Apple means there is still cause for optimism. \"Now is the time for talented individuals to use the incredible suite of tools available to them to build fun and engaging experiences for people to enjoy,\" he says. \"If this round of layoffs in the industry is the catalyst people need to build new games in a leaner, more efficient and creative way, we are all richer for it. \"We must remember how lucky we are to work in such a flourishing industry. When the macroeconomic climate improves, games will inevitably be at the forefront of driving new growth and jobs. Our skills will be deeply valuable in the new forward looking digital economy.\" to get the biggest news straight to your inbox",
    "pubDate": "2023-10-05 15:24:45",
    "image_url": "https://assetsio.reedpopcdn.com/layoffs.jpeg?width=1920&height=1920&fit=bounds&quality=80&format=jpg&auto=webp",
    "source_id": "gamesindustry",
    "source_priority": 11760,
    "country": [
      "united states of america"
    ],
    "category": [
      "technology"
    ],
    "language": "english",
    "short_uuid": "a4ef004e"
  },
  {
    "article_id": "5aa6319d187d82573b159b4b42f1c7e8",
    "title": "Patrick Mahomes explains why he's scrambling more than ever through four games and why it won't change",
    "link": "https://www.cbssports.com/nfl/news/patrick-mahomes-explains-why-hes-scrambling-more-than-ever-through-four-games-and-why-it-wont-change/",
    "keywords": null,
    "creator": [
      "Jeff Kerr"
    ],
    "video_url": null,
    "description": "Mahomes is on pace to set a career-high in rushing yards",
    "content": "' passing numbers have looked a bit different this year, as he's only on pace to throw for 4,276 yards and 34 touchdowns. These numbers -- along with a 92.0 passer rating -- are considered low for Mahomes as he's still finding ways for the to win football games despite not having to play at an MVP level every week. With the passing game not as strong as in years past, Mahomes has turned to his legs to generate yards for the Chiefs. Through four games, Mahomes has 23 carries for 154 yards, a career high of 38.5 rushing yards per game. \"I'd probably just say more coverage. I haven't had a lot of pressure yet. I mean I'll obviously probably get some more this week,\" Mahomes said to reporters Wednesday, via a Chiefs transcript. \"They're playing a lot more coverage and dropping deep into coverages, and so it's opened lanes for me to scramble. That's something that I've always done. It just usually happens later in the season more than early, so (I'm) just trying to do whatever to go out there and win.\" The rushing yards average (38.5) easily surpasses Mahomes' previous career-high of 22.4 rushing yards per game, set in the 2021 season. Mahomes has never rushed for more than 381 yards in a season, but is on pace to shatter that mark. At this rate, Mahomes will have 655 rushing yards in 2023 -- more than he had in his first two full seasons as a starter combined (2018-2019). Mahomes isn't or running the football, but it's a part of his game defenses have to respect. His primary read is to throw the football, yet he'll take off to move the chains if necessary. \"I think what makes those dudes so great is that they can throw the football, too. I just have to be able to throw the football and then whenever the opportunity comes, just get enough yards to keep the chains moving,\" Mahomes said. \" I'm just trying to move the chains, and obviously, I want to throw for it. I want to make the throws, but when the opportunity arises, just – if I'm going to take it, make sure I go get the first down. \"It's just something you have to balance throughout the season is when to run for it, when to slide, when to throw the football and try to find ways to win games.\" Until the pass offense is able to make plays consistently, Mahomes is going to use his legs as an advantage to keep the offense on the field. The Chiefs' record hasn't been affected by the added dimension Mahomes has put in his game.",
    "pubDate": "2023-10-05 15:22:25",
    "image_url": "https://sportshub.cbsistatic.com/i/2023/10/02/1ef38018-bd8c-47e4-91a0-4cf1336bcfcf/template-pic.jpg",
    "source_id": "cbssports",
    "source_priority": 72,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "62298a46"
  },
  {
    "article_id": "6a065074961130b5d42a61d32decba2f",
    "title": "Week 6 college football picks, odds, lines, 2023 best bets from proven expert: This 3-leg parlay pays 6-1",
    "link": "https://www.cbssports.com/college-football/news/week-6-college-football-picks-odds-lines-2023-best-bets-from-proven-expert-this-3-leg-parlay-pays-6-1/",
    "keywords": null,
    "creator": [
      "CBS Sports Staff"
    ],
    "video_url": null,
    "description": "Barrett Sallee has locked in his top three college football picks for the Week 6 college football schedule",
    "content": "The co-leaders in both the SEC East and the SEC West meet up during the Week 6 college football schedule. In the East, No. 20 goes to Athens to take on top-ranked , and the Bulldogs are 14.5-point favorites in the latest Week 6 college football odds via the SportsLine consensus. It's expected to be a tighter matchup in the 3:30 p.m. ET SEC on CBS matchup when hosts No. 11 (-2.5). There's also a SEC crossover matchup between ranked teams as No. 21 hosts No. 23 (-6.5). Other Week 6 college football spreads of note around the nation include No. 3 (-6.5) vs. No. 12 in the 2023 Red River Showdown, No. 10 at No. 25 (+6.5), and No. 4 hosting (+19.5). Before locking in any Week 6 college football picks on those games or others, be sure to . Sallee is a true insider -- a CBS Sports analyst, SiriusXM host, Heisman voter and consistently one of the top CBS Sports experts picking games against the spread. He debuted with SportsLine in 2017 and has delivered his three best to members each week. Now, he has turned his attention to the Week 6 and is sharing his top three best bets over at SportsLine. If you parlay them together, you could be looking at a return of around 6-1. . One of Sallee's top Week 6 college football picks: He's taking No. 17 (-20.5) to cover against in an 8 p.m. ET kickoff on Saturday. Georgia Tech had one of the worst losses among Power Five teams in Week 5, giving up 38 unanswered points and ultimately falling 38-27 to , a MAC squad that entered that game winless against FBS competition. Miami, meanwhile, is cruising with a 4-0 straight-up record and three covers in as many tries against FBS competition this year. \"Their perfect season will continue this weekend against a wretched Yellow Jackets squad,\" Sallee told SportsLine. \"The Jackets haven't found their offensive identity, and Miami's defense has created chaos in every game this season. Even if this game is close for a half -- which is unlikely -- Miami will pull away in the second half for an easy cover.\" . Sallee has also found two other college football picks he loves, including backing a Group of Five underdog that he says can not only cover, but win outright. .",
    "pubDate": "2023-10-05 15:20:59",
    "image_url": "https://sportshub.cbsistatic.com/i/2023/10/05/97236e84-0ea2-4e5f-9a57-b88236d681a8/tyler-van-dyke-miami-usatsi.jpg",
    "source_id": "cbssports",
    "source_priority": 72,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "3a715545"
  },
  {
    "article_id": "1855e53b3fdd9d655fe6bcf2976af58f",
    "title": "Coach Prime TV series: Filming on second season has begun in Colorado",
    "link": "https://www.mercurynews.com/2023/10/05/coach-prime-amazon-tv-series-colorado-buffs-tax-incentives/",
    "keywords": [
      "College Sports",
      "Entertainment",
      "Sports",
      "Things To Do",
      "TV Streaming",
      "Amazon",
      "college",
      "College Football",
      "Colorado Buffaloes",
      "Football",
      "Media",
      "network"
    ],
    "creator": [
      "Jonathan Shikes"
    ],
    "video_url": null,
    "description": "Economic impact of \"Coach Prime\" production could reach $9 million, according to state.",
    "content": "All eyes have been on Colorado this college football season — — as Deion Sanders, better known as Coach Prime, has taken the University of Colorado Buffaloes , so far, with the kind of unique panache that has . The next big news? Amazon Prime Video and SMAC Productions have begun filming season two of “Coach Prime,” a multi-part “documentary” series that followed Sanders last year when he was coaching at Jackson State University and eventually to Boulder. And just as interesting: said Wednesday that it has “approved a Colorado film incentive for the show. “Per the applicant’s estimations, (the state) anticipates approximately $4.9 million in qualified local expenditures, resulting in an anticipated rebate of $500,000. With the multiplier effect, the economic impact could reach up to $9 million,” the agency said in a statement. That’s some big talk. But then, sports fans here are used to that by now.",
    "pubDate": "2023-10-05 17:12:10",
    "image_url": "https://www.mercurynews.com/wp-content/uploads/2023/10/TDP-L-Buffaloes-Cornhuskers-RJS-131054.jpg?w=1400px&strip=all",
    "source_id": "mercurynews",
    "source_priority": 2968,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "7cc554fc"
  },
  {
    "article_id": "09683b5100e62d0aad3b30474f0e8e52",
    "title": "The Distressed Look At Levi Strauss Is In The Corporate Suite Who Are Lacking Vision",
    "link": "https://www.forbes.com/sites/gregpetro/2023/10/05/the-distressed-look-at-levi-strauss-is-in-the-corporate-suite-who-are-lacking-vision/",
    "keywords": [
      "Investing",
      "/investing",
      "Money",
      "/money",
      "Investing",
      "/investing",
      "money",
      "investing",
      "standard"
    ],
    "creator": [
      "Greg Petro",
      " Contributor"
    ],
    "video_url": null,
    "description": "Levi's: From Fashion Icon to Corporate Distress – A Tale of Ups and Downs in the Denim Business. Can it find a new vision for the future?",
    "content": "Forbes Money Investing The Distressed Look At Levi Strauss Is In The Corporate Suite Who Are Lacking Vision Greg Petro Contributor Opinions expressed by Forbes Contributors are their own. Following Oct 5, 2023, 01:01pm EDT | Press play to listen to this article! Got it! Share to Facebook Share to Twitter Share to Linkedin The Distressed Look at Levi Strauss is in the Corporate Suite Who are Lacking Vision getty In the fickle business of fashion, the popularity of denim has ebbed and flowed over the years, and likewise, the fortunes of Levi Strauss. This venerable brand invented blue jeans in 1873. Just two years ago, Levi’s was riding high, sporting a market capitalization of $12 billion in May 2021, up from about $6 billion just two years earlier when it went public. For over three decades before that, Levi’s had been a struggling, privately held company whose core audience was aging out. Today, the company is worth about $5.3 billion, less than half what it was in 2021 when consumers were spending all that pandemic stimulus money to trade up and look good in Levi’s. The stock price has fallen from a high of about $29 a share to where it is today, about $13.50. Since 2021, the company seems to have again lost its way under CEO Chip Bergh, a former US Army captain recruited in 2011 as group president for global grooming at Procter & Gamble. After working his way up the ranks over nearly three decades, Bergh has said he left P&G when he realized he would not be a candidate for P&G’s CEO. So, rather than the fashion maven that Levi’s needed, the company’s board picked Bergh, an ambitious corporate executive responsible for such brands as Tampax and Gillette. The problem at Levi’s is not their distressed jeans; it’s distress in the C-suite. In the quarter ended June 30, the company posted a $1.6 million loss compared with nearly $50 million a year earlier. The company is now a consumer retail laggard. Anyone who follows fashion industry trends as closely as I do might have predicted Levi’s recent problems. For me, it was when I noticed that Bergh showed up at virtually every industry event and conference wearing an astonishing outfit for how out of step it is with the current culture – the so-called “Canadian Tuxedo”: denim jacket and jeans. Who wears denim jackets today? I thought this was a fashion exec out of step with the fashion market. Furthermore, as inflation-wary consumers trade down to save money, Levi’s is losing to Walmart, Target, Tractor Supply, and other retailers expanding their private label lines at prices Levi’s can’t, won’t, or shouldn’t match. MORE FOR YOU Ukrainian Troops Recovered One Of Their Damaged Strv 122 Tanks—In Time For The Tank To Meet The President BlackRock Insider Primes Crypto For A Huge 17 7 Trillion Wall Street Earthquake That Could Be About To Hit The Price Of Bitcoin Ethereum And XRP Powerball Jackpot Rises To 1 4 Billion Here s What The Winner Will Take Home After Taxes In January this year, Bergh assured analysts, “The skinny jean is not going anywhere.” That was about the same time fashion journals like Elle were running headlines like “The Skinny Jean is Dead.” The problem is people who wear jeans are getting bigger. At some point, skinny jeans on bulky bodies stop looking sexy. The trend is evident these days: jeans buyers are looking for room in their pants, wider legs, and stretchy materials. Skinny jeans may be dead, but as things stand, not the future of denim. The distress in Levi’s corporate ranks may not be over. As part of a succession plan announced late last year, Bergh was recently to be replaced by Michelle Gass, the former chief executive of department store chain Kohl’s. Gass takes over a company whose retail website promotes heavily discounted merchandise, and a whole section of denim jackets and other tops is a product category outside of its expertise (one exception: the trucker jacket). Last year, the company spent $400 million to buy Beyond Yoga, which focuses on activewear and body-positive apparel – think stretch pants. They have a wide array of “Western” tops, and one would argue a complete lack of product vision. The bottom line: Levi’s has lost its fashion sense and any product vision. The company seems to be clinging to the past, a past that belongs to a fashion cohort that is more concerned with getting in and out of their cars without having to hold their breath than looking sexy and having spoken to several friends and colleagues about what the first thing that crosses their minds when asked about Levi’s? Their response was, “The past”. Levi’s needs a make-over. A vision. New ideas for a future, not a past. Check out my website . Greg Petro Editorial Standards Print Reprints & Permissions",
    "pubDate": "2023-10-05 17:01:32",
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/651eeafb485c39ff1cdad09c/0x0.jpg?width=960&precrop=1544%2C868%2Cx46%2Cy0",
    "source_id": "forbes",
    "source_priority": 57,
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english",
    "short_uuid": "f8dd5f9d"
  },
  {
    "article_id": "78e0e924c4a4acc25d6a9db33ce67eba",
    "title": "EPIC Thread HUMILIATES Lefties/Dems who attacked Trump for building the wall Biden NOW wants built",
    "link": "https://twitchy.com/samj/2023/10/05/thread-humiliates-lefties-who-once-claimed-trumps-wall-was-racist-is-it-still-racist-under-biden-n2388157",
    "keywords": [
      "<![CDATA[Biden]]>",
      "<![CDATA[media]]>",
      "<![CDATA[racism]]>",
      "<![CDATA[racist]]>",
      "<![CDATA[Trump]]>",
      "<![CDATA[wall]]>"
    ],
    "creator": null,
    "video_url": null,
    "description": null,
    "content": "Now that Biden has gotten behind building the wall at the southern border, do you guys think the same people who called Trump a racist and xenophobe for wanting it built will call Sleepy Joe the same? Or will they fall in line behind the Botox-filled puppet in the Oval Office? It should be interesting to watch the mental and political gymnastics they'll need to get around this one. Especially when there are threads like this out on Twitter/X highlighting the many people on the Left who attacked Trump over the wall. Trump's border wall was never just about security. It's meant to remind all Latinos that we're unwelcome From . Will there be the same article about biden? So Biden just wants to remind Latinos they're unwelcome? is wall a \"racist border wall was NEVER an immigration policy solution. It was an anti-immigrant symbol\" too ? Biden is pushing an anti-immigrant symbol. Hey man, we're just playing by the rules. will come out with a new statement about Racist wall? As Blasting Continues, Dems Highlight Cultural Destruction of Trump’s Racist Border Wall – Racist wall. Trump's border wall isn't about national security. It's about stoking racial resentment. will you now do a piece on Can't wait to see all of these same people condemning Biden for his wall. Will you be following up with and ask her if wall is also racist? Warren Has A Plan For Coronavirus: Defund Trump’s “Racist Wall” Awww yes, the senator best known for lying about her heritage to take advantage of programs meant for minorities. Will you be doing a follow-up piece with these officials and ask how wall is racist Texas officials launch legal challenge against Trump's 'racist' border wall Wouldn't hold your breath on this one. Will you be doing a follow-up piece with these officials and ask how wall is racist Texas officials launch legal challenge against Trump's 'racist' border wall Will you be following up with the \"passionate community\" and report how wall is racist? 'A racist monument': Fresh battle looms over Trump's border wall We're guessing that's a big fat no. Will Do a follow-up piece asking Vicente Fox if wall is racist? Mexico's former president calls Trump's proposed border wall a 'racist monument' Racist monument. Heh. What a bunch of melodramatic doorknobs - America is apparently the only country in the world that's not allowed to protect and care about its border. Trump’s Border Wall Is an Expensive, Ineffective Application of Eminent Domain Wonder of American Progressive will say he same about Biden's Border Wall. Just kidding - we know they won't. *** Related: ***",
    "pubDate": "2023-10-05 16:45:00",
    "image_url": "https://media.townhall.com/cdn/hodl/tw/images/up/2023/167/94d33837-86bb-43b8-988e-6a7a84a03cbb.jpg",
    "source_id": "twitchy",
    "source_priority": 14687,
    "country": [
      "united states of america"
    ],
    "category": [
      "politics"
    ],
    "language": "english",
    "short_uuid": "1e23fccb"
  },
  {
    "article_id": "779f121732ba00146fb0185971e1a038",
    "title": "Earth's solid inner core is 'surprisingly soft' thanks to hyperactive atoms jostling around",
    "link": "https://www.livescience.com/planet-earth/geology/earths-solid-inner-core-is-surprisingly-soft-thanks-to-hyperactive-atoms-jostling-around",
    "keywords": [
      "Geology",
      "Planet Earth"
    ],
    "creator": null,
    "video_url": null,
    "description": "Atoms within the enormous ball of iron in Earth's inner core may move around much more than previously thought, which could explain recent findings about the core's surprising softness.",
    "content": "Scientists recently discovered that 's inner core, which was long thought to be an unmoving ball of solid metal, might be a lot less rigid than we expected. Now, a new study suggests this surprising softness may be caused by hyperactive that move around within their molecular structure much more than we realized. The inner core is a massive spherical lump of metal, predominantly iron, that spans roughly 760 miles (1,220 kilometers) and . The inner core is enveloped by the outer core — a sea of swirling liquid metals — that is in turn surrounded by a massive layer of molten rock, known as the mantle, which sits just below the solid crust we live on. The pressure at the heart of our planet is immense, so experts initially believed the core must be completely solid and that the iron atoms within it, which are arranged in a massive hexagonal lattice, must be permanently held in place. But in 2021, seismic waves from earthquakes , which led some scientists to describe it as a \"mushy hidden world.\" Subsequent studies suggested this or that the core exists in a \"superionic state,\" where atoms from other elements like carbon and hydrogen are . The new study, published Oct. 2 in the journal , provides an alternative explanation for what is going on inside the inner core. The researchers recreated the intense pressure within the inner core in the lab and observed how the iron atoms behaved under these conditions. The scientists then fed this data into a computer-learning program to create a simulated virtual core that they dubbed the \"supercell.\" Using the supercell, the team was able to see how the iron atoms moved within their supposedly rigid structure. The results suggest the atoms inside the inner core can \"move much more than we ever imagined,\" study co-author , a geophysicist at the University of Texas at Austin, said in a . The supercell simulations show that some of these atoms can move around in groups, taking up other positions in the lattice without compromising its overall shape — kind of like how dinner guests change seats at a table without adding or removing chairs, researchers wrote in the statement. This type of movement is known as \"collective motion.\" — — — \"This increased movement makes the inner core less rigid [and] weaker against shear forces,\" Lin said. This could explain why the inner core is \"surprisingly soft,\" he added. The researchers believe that the new findings could also reveal new insights into other inner core mysteries, like how it helps to generate . \"Now, we know about the fundamental mechanism that will help us with understanding the dynamic processes and evolution of the Earth's inner core,\" Lin said.",
    "pubDate": "2023-10-05 16:42:51",
    "image_url": "https://cdn.mos.cms.futurecdn.net/8oyp8YzygP5ZbwUsQNJN2K.jpg",
    "source_id": "livescience",
    "source_priority": 1057,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "6c954675"
  },
  {
    "article_id": "f3315f1f8d958c34a57d280c1c150ad5",
    "title": "Trump considering Capitol visit to meet House Republicans ahead of speakership election – live",
    "link": "https://www.theguardian.com/us-news/live/2023/oct/05/speaker-of-house-mccarthy-republicans-trump-biden-feinstein-funeral-politics-live-updates",
    "keywords": [
      "US politics",
      "US Congress",
      "Republicans",
      "Democrats",
      "Joe Biden",
      "Donald Trump"
    ],
    "creator": [
      "Chris Stein"
    ],
    "video_url": null,
    "description": "Former US president, who denies having a hand in McCarthy removal as speaker, could hold meeting next weekSpeaking of the House, the Cook Political Report just got its hand on Alabama’s new congressional map and, as expected, Democrats appear set to win a new seat in the state:The redrawn map came after the supreme court struck down an earlier version that included only one majority Black district, in what the justices determined was a violation of the Voting Rights Act. Continue reading...",
    "content": "Show key events only Please turn on JavaScript to use this feature Live feed From 54m ago 17.23 BST Trump considering visit to Capitol to meet with House Republicans ahead of speakership election Hugo Lowell Donald Trump is considering meeting with House Republicans at the Capitol next week, a source familiar with the former president’s plans tells the Guardian, as his party works to elect a new speaker following Kevin McCarthy ’s overthrow. Trump is the frontrunner for the GOP’s presidential nomination, and has been endorsed by several House lawmakers. He has denied involvement in congressman Matt Gaetz ’s successful effort to remove McCarthy from power, and both lawmakers call themselves Trump allies. Key events 18m ago Biden says border wall won't work, but law required construction 54m ago Trump considering visit to Capitol to meet with House Republicans ahead of speakership election 2h ago Former George Santos campaign treasurer pleads guilty to felony 3h ago Trump asks for classified documents trial to be delayed till after 2024 election 4h ago Biden waives federal laws to approve border wall construction 4h ago Few expect House to have new speaker by Wednesday - reports 5h ago McCarthy's ouster imperils Ukraine aid, threatens government shutdown Show key events only Please turn on JavaScript to use this feature 5m ago 18.13 BST Former Democratic presidential candidate and independent New York City mayor Michael Bloomberg said Democrats should have done more to stop Kevin McCarthy from being removed from office. He characterizes McCarthy as a conservative who had at least some interest in actually governing, but is now set to be replaced with a hardliner who will be even more difficult to work with. Writing in the Washington Post , Bloomberg says: McCarthy’s failure to reach out to Democrats was inexcusable, of course. But so too was Jeffries’ failure to extend an olive branch. Not only has it empowered the Republicans’ extreme right wing, but it also squandered an opportunity for Democrats to increase their influence. Jeffries had a chance to use the crisis to push for a more bipartisan governing model in the House, one that would have given Democrats more involvement in crafting legislation and conducting oversight. It could have been a transformative moment for Congress and the country. But if any informal Democratic overture occurred, it was too little, too late. It’s true that McCarthy gave no indication he would have had the good sense to accept a serious peace offering by Jeffries. But even if he had rejected it, Democrats could have shown voters that at least one party in Washington is serious about finding common ground. Their failure to make a peace offering falls heaviest on the party’s moderates, who speak of bipartisanship but, when push comes to shove, don’t practice it. Now, with the House paralyzed, not only is Congress failing to do the people’s business, but aid to Ukraine has been indefinitely paused, helping Russia’s war effort and costing people their lives. “There has to be an adult in the room,” McCarthy said over the weekend, after keeping the government from shutting down with the help of Democrats. He was right. Sadly, in the end, neither he nor Jeffries could do the adult thing, by reaching across the aisle to prevent Congress from sinking even deeper into dysfunction. 18m ago 17.59 BST Biden says border wall won't work, but law required construction Joe Biden explained that his administration was moving forward with building a wall on the US border with Mexico because federal law required it – even though he does not believe it will work. Here are comments he made to the press from the Oval Office: President Biden defends moving to build border barriers in a portion of the Rio Grande Valley, saying funding was already appropriated and he “can't stop that” despite asking Congress to redirect the money. Asked if he thinks the border wall works, Biden says “No.” pic.twitter.com/U9dRRl4Lbk — The Recount (@therecount) October 5, 2023 Environmental advocates are furious with Biden for waiving federal laws in order to move forward with the construction, even though his own administration said in its early days in office that such a barrier would not be effective. Here’s the latest on this story: Biden criticized for waiving 26 laws in Texas to allow border wall construction Read more 35m ago 17.42 BST For a sense of how the GOP is trying to spin this week’s theatrics in the House, take a look at this tweet from the National Republican Congressional Committee, which is tasked with winning seats in the chamber: Extreme House Democrats are the Chaos Caucus. pic.twitter.com/SDtxWqdKg3 — NRCC (@NRCC) October 5, 2023 All the Democrats you see there represent swing or red districts, and many won re-election only narrowly last year, when Joe Biden ’s allies overperformed expectations thanks to factors like the downfall of Roe v Wade and successful warnings about GOP extremism. The Democratic caucus was unanimous in voting to oust Kevin McCarthy , arguing that they were merely keeping with the common practice of the minority party in the House refusing to support the majority’s choice for speaker. 54m ago 17.23 BST Trump considering visit to Capitol to meet with House Republicans ahead of speakership election Hugo Lowell Donald Trump is considering meeting with House Republicans at the Capitol next week, a source familiar with the former president’s plans tells the Guardian, as his party works to elect a new speaker following Kevin McCarthy ’s overthrow. Trump is the frontrunner for the GOP’s presidential nomination, and has been endorsed by several House lawmakers. He has denied involvement in congressman Matt Gaetz ’s successful effort to remove McCarthy from power, and both lawmakers call themselves Trump allies. 1h ago 17.15 BST More hints of the dynamics of the speaker’s race within the House Republican Conference are emerging. The latest report is from the Messenger , which, citing unnamed sources, reports that Steve Scalise began campaigning to replace Kevin McCarthy even before he had been officially ousted. Scalise, the majority leader, is one of two major candidates who have declared their candidacy, along with judiciary chair Jim Jordan . Both are staunch conservatives, and the Messenger’s report may explain why McCarthy’s aides are reportedly encouraging lawmakers to support Jordan: Kevin McCarthy had just been ousted as speaker of the House. Republicans — and the entire Congress — were stunned. Yet McCarthy’s deputy, House Majority Leader Steve Scalise, R-La., wasted no time, as he quietly launched a bid to become the next speaker, multiple sources tell The Messenger. Four Republican sources say Scalise started his campaign for speaker on Tuesday evening, moments after the House approved a far-right motion to vacate McCarthy from the speakership, before any other member had formally declared a candidacy. One House Republican who was lobbied by Scalise early Wednesday morning said the Louisiana Republican’s outreach was “was too early.” “The body wasn’t even cold,” the lawmaker, who was granted anonymity to speak candidly about the speaker’s race, told The Messenger. “It was bullsh--.” The race to replace McCarthy has just two declared candidates so far: Scalise, and Rep. Jim Jordan, R-Ohio, the chairman of the powerful House Judiciary Committee. There is also Rep. Kevin Hern, R-Okla., who has fielded support from members but has not yet formally announced a bid. 1h ago 16.53 BST Another thing that could prove pivotal to determining control of the House next year: the revolt that ousted Kevin McCarthy from office. His ouster was unprecedented, and the GOP is still digesting its implications for their broader campaign to hold onto the House, and regain the senate and White House next year. One lawmaker, Ohio’s Max Miller , told CNN it set the party back: Rep. Max Miller fears GOP chaos could cost them House — and said he told that to Trump this week. “He’s incredibly upset.” Accuses Matt Gaetz of using the “MAGA cloak” to make it seem like Trump backs him. “That's why he's so good at what he does is because he's a BS artist” pic.twitter.com/Bss7KEPpvg — Manu Raju (@mkraju) October 5, 2023 2h ago 16.36 BST Speaking of the House, the Cook Political Report just got its hand on Alabama’s new congressional map and, as expected, Democrats appear set to win a new seat in the state: NEW: a federal court just selected Alabama's new congressional map, featuring an additional Black majority district. Under the remedial plan, #AL02 swings from Trump +29 to Biden +12, virtually assuring a Dem pickup. pic.twitter.com/9sXRVGwELB — Dave Wasserman (@Redistrict) October 5, 2023 The redrawn map came after the supreme court struck down an earlier version that included only one majority Black district, in what the justices determined was a violation of the Voting Rights Act. The state’s Republican lawmakers tried to get around that by enacting a new map that didn’t follow the court’s decision, leading them to again order Alabama to draw new maps . With Republicans controlling the House by only four seats, the decision could prove pivotal to Democrats’ quest to retake the majority in next year’s elections. 2h ago 16.15 BST Former George Santos campaign treasurer pleads guilty to felony An ex-campaign treasurer for George Santos , the Republican congressman who admitted to lying about large portions of his resume and is currently facing federal fraud charges, will plead guilty to an unspecific felony, prosecutors have announced, according to the Associated Press. It is currently unknown to what charge Nancy Marks is admitting guilt, the AP reports. A veteran of Long Island politics, Marks worked with Santos on his two congressional runs. In May, federal prosecutors indicted Santos on 13 charges, including fraud and money laundering. Democrats have called on him to resign, and Santos is currently being investigated by the House ethics committee. 2h ago 15.57 BST Jim Jordan appeared on Fox News earlier today to make his pitch for why he would be a good speaker. Here’s what he had to say: Rep. Jim Jordan (R-OH) on his candidacy for Speaker of the House in a Fox exclusive: “You need someone who can unite the conference … We have to have someone that can bring our team together. I think I’m best equipped to do that.” pic.twitter.com/ZVofF8glaI — The Recount (@therecount) October 5, 2023 3h ago 15.41 BST Back at the Capitol, Semafor reports that staffers for Kevin McCarthy have been making calls to support Jim Jordan’s bid to replace him as speaker. Jordan is the chair of the judiciary committee a former leader of the far-right House Freedom Caucus, and among the most prominent of the lawmakers who boosted their profile by strenuously defending Donald Trump . The Ohio lawmaker is considered the strongest competitor to Steve Scalise , the House majority leader who is also vying to take over for McCarthy. Following his ouster from the speaker’s chair on Tuesday, McCarthy did not endorse a successor, and Semafor reports it’s unclear if his staffers are making calls to support Jordan at his orders. 3h ago 15.23 BST Trump asks for classified documents trial to be delayed till after 2024 election The Guardian’s Hugo Lowell reports that Donald Trump has requested his trial on charges related to hiding classified government documents at Mar-a-Lago be delayed until after next year’s presidential election: NEW: Trump asks for the Mar-a-Lago classified docs trial to be delayed until at least Nov 2024 — after the election — citing discovery complaints and the trial schedule for his lawyer Chris Kise. https://t.co/40Eiq6f527 — Hugo Lowell (@hugolowell) October 5, 2023 The former president is facing more than three dozen federal charges relating to taking classified materials with him when he departed the White House, then frustrating investigators’ efforts to retrieve them from his south Florida resort. 3h ago 15.03 BST Republicans’ demands have expanded from merely building a border wall. Some lawmakers and candidates, including Donald Trump, have recently publicly mulled invading Mexico, ostensibly to fight drug traffickers. As the Guardian’s Ramon Antonio Vargas reports, on progressive Democrats wants them to knock it off: A progressive US congressman from Texas has asked his legislative colleagues to join him in condemning some American conservatives’ calls to invade Mexico – ostensibly to do battle with drug cartels there. Joaquin Castro says he intends to file a resolution in the US House as soon as Friday reaffirming the federal government’s “commitment to respecting the sovereignty of Mexico and condemning calls for military action without Mexico’s consent and congressional authorization”. The San Antonio Democrat and House foreign affairs committee member’s proposed measure – a copy of which was provided to the Guardian – comes after a high-profile episode in May saw US senator John Kennedy urge the US to send its military into Mexico to confront drug cartels. In the process, Kennedy insulted Mexicans by saying they “would be eating cat food out of a can and living in a tent behind an Outback” steakhouse restaurant if it were not for their proximity to the US. The racist remarks earned the Louisiana Republican criticism from Mexico’s top government leaders as well as many of his compatriots. Former president Donald Trump, Florida governor Ron DeSantis and Vivek Ramaswamy – who are all seeking the Republican party’s 2024 White House nomination – have similarly pledged to send US military forces into Mexico to wipe out drug lords if given the chance, as the Dallas Morning News reported . The resolution from Castro, who’s served in the House since 2013, seeks to assert that the US and Mexico “have cooperated for several decades on a variety of issues such as trade, investment, counter-narcotics, migration, rule of law and security, including through recent high-level security and economic dialogues”. US representative files resolution decrying rightwing calls for invasion of Mexico Read more 4h ago 14.44 BST Biden waives federal laws to approve border wall construction The Biden administration has issued waivers to federal law in order to build border fencing in south Texas, the Associated Press reports. Building a wall along the US frontier with Mexico was a priority of Donald Trump ’s administration and remains so for many Republicans, but Joe Biden has opposed continuing the plan. His administration is however under pressure amid a surge in asylum seekers arriving at the southern border. Here’s more on the wall construction, from the AP: The Joe Biden White House announced it waived 26 federal laws in south Texas to allow border wall construction on Wednesday, marking the administration’s first use of a sweeping executive power employed often during Donald Trump’s presidency. Homeland security department officials posted the announcement on the US federal registry with few details outlining the construction in Starr county, Texas, which is part of a busy border patrol sector seeing “high illegal entry”. According to government data, about 245,000 illegal entries have been recorded so far this fiscal year in the Rio Grande Valley sector, which contains 21 counties. “There is presently an acute and immediate need to construct physical barriers and roads in the vicinity of the border of the United States in order to prevent unlawful entries into the United States in the project areas,” the homeland security secretary, Alejandro Mayorkas, stated in the notice. The Clean Air Act, Safe Drinking Water Act and Endangered Species Act were some of the federal laws waived by the Department of Homeland Security (DHS) to make way for construction that will use funds from a congressional appropriation in 2019 for border wall construction. The waivers avoid time-consuming reviews and lawsuits challenging violation of environmental laws. Starr county’s hilly ranchlands, sitting between Zapata and McAllen, Texas , is home to about 65,000 residents sparsely populating roughly 1,200 sq miles (3,108 sq km) that form part of the Lower Rio Grande Valley National Wildlife Refuge. Although no maps were provided in the announcement, federal customs and border protection officials announced the project in June and began gathering public comments in August when they shared a map of the additional construction that can add up to 20 miles (32km) to the existing border barrier system in the area. The Starr county judge Eloy Vera said it will start south of the Falcon Dam and go past Salineño, Texas. “The other concern that we have is that area is highly erosive. There’s a lot of arroyos,” the county judge said, pointing out the creeks cutting through the ranchland and leading into the river. Biden waives 26 federal laws in south Texas to allow border wall construction Read more 4h ago 14.25 BST From the Guardian’s Martin Pengelly and Joan E Greve , here’s a look at two of the frontrunners who have emerged to replace Kevin McCarthy – both conservatives, but know for taking different approaches to governing: Jim Jordan of Ohio and Steve Scalise of Louisiana announced Wednesday they would seek to succeed Kevin McCarthy as speaker of the US House of Representatives, after the Californian was brutally removed by his own Republican party on Tuesday. Jordan is chair of the powerful judiciary committee, while Scalise is the majority leader. Both had been named as potential successors to McCarthy, and they confirmed their intentions to run for the top House job a day after the speakership was declared vacant. Pitching his candidacy in a “Dear Colleague” letter, Jordan pledged to unify his fractious conference, which has repeatedly stumbled under the weight of a razor-thin majority. “We are at a critical crossroad in our nation’s history. Now is the time for our Republican conference to come together to keep our promises to Americans,” Jordan said. “No matter what we do, we must do it together as a conference. I respectfully ask for your support for speaker of the House of Representatives .” But Scalise argued he had the experience needed to unite the conference, after serving as part of the House Republican leadership team for the past decade. “I have a proven track record of bringing together the diverse array of viewpoints within our Conference to build consensus where others thought it impossible,” Scalise said in his own “Dear Colleague” letter. “We have an extremely talented Conference, and we all need to come together and pull in the same direction to get the country back on the right track.” Republicans Jim Jordan and Steve Scalise launch House speakership bids Read more 4h ago 14.10 BST Few expect House to have new speaker by Wednesday - reports In theory, the House will be back to normal by next Wednesday, when lawmakers will vote on a new speaker. In practice, few in the chamber believe the infighting that led to Kevin McCarthy ’s overthrow will be resolved by then. Reports concluding this have been trickling out over the past day, and, this morning Axios revealed some of the dynamics behind this dysfunction. “There are way too many potential blowup points for this leadership vacuum to be easily resolved, thanks to a rump caucus of Republicans who proved they’ll break with the overwhelming majority of their colleagues,” they write. Conservatives are unlikely to vote for any candidate that would give more aid to Ukraine, while moderates want whoever is the new speaker to make it more difficult to remove the chamber’s head. And then there’s the fact that, with 435 members, there are plenty of people in the House who just don’t like each other. We’ll get a sense of these dynamics over the days to come, and especially on Tuesday, when a candidate’s forum for those seeking the speaker’s post will be held. 5h ago 13.47 BST McCarthy's ouster imperils Ukraine aid, threatens government shutdown Good morning, US politics blog readers. Not 48 hours after the House of Representatives was paralyzed by a far-right revolt that ousted Kevin McCarthy from the speaker’s chair, the broader implications are becoming clear. Leaderless, the chamber is in disarray, but lawmakers nonetheless have crucial work to do. One of McCarthy’s last acts was passing a deal to prevent a government shutdown that would have begun this last Sunday, but the bill funds the government only till 17 November. That is more than a month away, but Congress is riven with divisions over government spending, and the House’s present dysfunction robs lawmakers of time to address them. Then there’s the prospects for continued American aid to Ukraine. That, too, must be approved by Congress, and while senators of both parties appear open to continuing to help Kyiv, House conservatives are opposed, with speaker candidate Jim Jordan saying he will not bring further aide to the floor, if elected. Joe Biden , meanwhile, said yesterday he is exploring other ways to assist Ukraine, and will make a major speech on it soon. We’ll be following these stories today. Here’s what else is going on: Biden will at 12pm eastern time receive a briefing on Ukraine from his national security team, which could perhaps lead him to reveal more details about his plan to continue aid. Should Republicans continue holding debates, even though presidential frontrunner Donald Trump is not attending? Some party officials think the answer should be no, Politico reports . Kamala Harris and a host of other politicians will be in San Francisco for senator Dianne Feinstein ’s funeral. Harris delivers remarks at 4pm eastern time. Explore more on these topics US politics US politics live with Chris Stein US Congress Republicans Democrats Joe Biden Donald Trump Reuse this content",
    "pubDate": "2023-10-05 16:42:16",
    "image_url": "https://i.guim.co.uk/img/media/84d2387692fedbcf158b0e82d840cba2f47770c2/0_222_8101_4861/master/8101.jpg?width=460&quality=85&auto=format&fit=max&s=20dca00a29bdefd008a569794a3e9935",
    "source_id": "theguardian",
    "source_priority": 106,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "a70444fe"
  },
  {
    "article_id": "3570a852aaf946402c4c5fa534543cb2",
    "title": "College football predictions, picks, odds: LSU-Missouri, Colorado-Arizona State among value plays in Week 6",
    "link": "https://www.cbssports.com/college-football/news/college-football-predictions-picks-odds-lsu-missouri-colorado-arizona-state-among-value-plays-in-week-6/",
    "keywords": null,
    "creator": [
      "Will Backus"
    ],
    "video_url": null,
    "description": "This week's value can be found outside of the biggest games on the slate",
    "content": "Week 6 of the season should be an exciting one, with four games pitting ranked opponents against one another. Outside of that, teams like No. 13 and No. 11 are expected to get tough tests against unranked opponents. But a lot of this week's betting value can be found outside of this weekend's top-billed games. A lot of the ranked matchups are either too close to call or filled with too much uncertainty to confidently find a value play. Not that some of the more notable games lack merit. The aforementioned Washington State Cougars are actually underdogs on the road against unranked , which is looking to pick up its first Pac-12 win and stay afloat in the conference race. No. 23 is looking to bounce back on the road against No. 21 in a game that could see plenty of offense. This column needs a bounce back, as well. After a 4-1 start to things, we've had just two hits in the last two weeks. Last week was filled with bad beats: starting quarterback was ruled out right before kickoff against , throwing the Jayhawks covering a 16.5-point spread out the window, while and came within three points short of hitting the over. 1-4 6-9 Here are the value plays that bettors should keep an eye on during Week 6 of the college football season. Friday, 7:30 p.m. | Boone Pickens Stadium -- Stillwater, Oklahoma Oklahoma State has managed to stumble its way through the 19th easiest schedule in the nation and still has two losses on its resume. The Cowboys started the year 2-0, though their season-opening 27-13 win against FCS did little to instill confidence, and have not won a game since. That includes a 33-7 loss to , which may have been a new low in Mike Gundy's tenure. Kansas State's only setback thus far was on the road against a now-ranked Missouri team. Both squads are coming off a bye here, but if Oklahoma State can lose by 26 against the likes of South Alabama, Kansas State should have no problem maintaining a pretty comfortable gap in this one. Saturday, 12 p.m. | Faurot Field at Memorial Stadium -- Columbia, Missouri LSU is the type of team that boasts an offense that few can stop and a defense that might be better off just staying on the bench. The Tigers (from LSU) are fresh off a 55-49 loss to -- the highest-scoring FBS game this season. LSU quarterback passed for 414 yards and four touchdowns. Four LSU receivers had at least 50 yards through the air. Now Daniels and company get to go against a Missouri team that ranks ninth in the SEC in pass defense, allowing over 242 yards through the air per game. Missouri is no slouch offensively. Quarterback , who is getting healthier each week since he hyperextended his knee against Kansas State, and wide receiver Luther Burden are a potent duo. The two have combined for 629 yards and four touchdowns, more than any other quarterback-wide receiver combo in the nation. All this to say, points should come easy in Saturday's game. Saturday, 3 p.m. | Rose Bowl Stadium -- Pasadena, California It's not everyday that the No. 13 team in the nation is considered an underdog, even if that team is playing on the road. But the Cougars enter Saturday's contest +3.5 against UCLA. Instead of hitting a spread with meager payouts -- especially one so thin -- the money line brings a ton of value here. In fact, it almost feels like stealing. UCLA hasn't seen a team like Washington State yet. The Bruins lead the Pac-12 in scoring defense, allowing just 11 points per game and are second in total defense, but they have yet to play an FBS team that ranks better than 61st in offensive efficiency. The Cougars rank 11th nationally in offensive efficiency, sixth nationally in total offense (533.8 yards per game) and fifth nationally in scoring offense (45.8 points per game). UCLA should be able to move the ball if this game evolves into a shootout, as Wazzu's defense is quite porous. But in that scenario, it's smarter to lean on a veteran quarterback like WSU's over UCLA freshman , who hasn't had to play in a game like that at the collegiate level. Saturday, 3:30 p.m. | Memorial Stadium -- Clemson, South Carolina Only one of Clemson's three games against power conference competition this season has reached 50 total points, and it took overtime to get there. On the other hand, Wake Forest and its opponents have combined for at least 50 points in all but one of the Demon Deacons' four games this year. That being said, Wake Forest has yet to play an FBS team with a winning record, and it has yet to try and move the ball against anything close to Clemson's defense. The Tigers are strong as ever on that side of the ball, pacing the ACC in total defense (266.4 yards per game) while allowing 20.8 points per contest. Wake Forest isn't going to score much, which puts the burden on Clemson. Dabo Swinney's squad has only managed at least 40 points on its own against FCS and a 1-3 team. Saturday, 6:30 p.m. ET | Mountain America Stadium -- Tempe, Arizona Before the season started this game might have been at worst a tossup, but it's pretty clear at this point that Colorado is the better team. The Buffaloes have already exceeded expectations, with a 3-2 record against the hardest schedule in college football. They've already beaten better teams than Arizona State, and came within seven points of shocking a squad that some see as a College Football Playoff contender. The Sun Devils, meanwhile, are 1-4. Their lone win was a three-point triumph against FCS in the season opener. To make matters worse, ASU is down to its third-string quarterback for Saturday's game, as starter and his backup are both out with injuries. Colorado's defense has been a concern this season, but it should be able to get enough stops against a shorthanded Arizona State.",
    "pubDate": "2023-10-05 18:51:02",
    "image_url": "https://sportshub.cbsistatic.com/i/2023/10/05/3d52590c-59a8-43fe-b8d4-e73847b5a858/usatsi-15049503-168396417-lowres-1.jpg",
    "source_id": "cbssports",
    "source_priority": 72,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "5f8d0b50"
  },
  {
    "article_id": "b2f9d3964135e877e074f3bdc1b2ceef",
    "title": "Bears-Commanders DFS lineups: Fantasy Football Today analysts share daily lineups for FanDuel",
    "link": "https://www.cbssports.com/fantasy/football/news/bears-commanders-dfs-lineups-fantasy-football-today-analysts-share-daily-lineups-for-fanduel/",
    "keywords": null,
    "creator": [
      "Dan Schneier"
    ],
    "video_url": null,
    "description": "Before you set your DFS lineups, here's who our experts have in their own",
    "content": "Football is back! Every week starts with a Thursday Night Football game for most of the remainder of the 2023 season, and these are our favorite slates to play Daily . The TNF showdown slate allows you a smaller crop of players to choose from, and if your cheap sleeper pick hits, you can cash big in your tournaments or easily win your head-to-head DFS matchups. Tonight, we kickoff Week 5 with the hosting the . Every week, I'll get the Thursday Night DFS picks from our experts and we'll feature them below. We'll take a mix of lineups from our panel of experts that feature builds on Fanduel. But first, let's preview the matchup and what we might expect. The Commanders are fresh off what has to be one of the biggest \"moral victories\" in the last several years. got beat up in the first half and nearly led an incredibly impressive comeback against one of the deepest and most talented defenses in the NFL against the . Now, he gets a Bears defense that hasn't stopped anyone -- on the ground or in the air. Brian Robinson figures to get a lot of work in this game as the team continues to prefer him over . , whose rapport with Howell continues to grow each week, also makes for an interesting play. On the flip side, the Bears finally put together some offensive success in Week 4 -- at least for the first half -- of course it came against arguably the worst defense in the NFL. The gave up 70 points in their game prior to playing the Bears in Week 4. Still, found some success with a bootleg-action heavy game plan against Denver. They might try that against Washington, but the Commanders front is much stronger. The interesting play will be who broke out in Week 4 with a positive game script for the Beras. Sportsline's Jacob Gibbs does the with a breakdown of all the players who should be in your captain consideration, a break down of the FLEX plays by tiers and more. Mike McClure has you covered with on both DraftKings and FanDuel. Or you can for his picks. Without further ado, here's a look at who our experts are picking on this DFS Thursday Night Football slate: FanDuel: MVP Commanders DST $9,500 FLEX: Brian Robinson $14,000 FLEX: $12,500 FLEX: Terry McLaurin $12,000 FLEX: $9,000 FanDuel: MVP: . $14,000 FLEX: Justin Fields $17,000 FLEX: Sam Howell $15,500 FLEX: $7,000 FLEX: $6,500 FanDuel: MVP: Brian Robinson $14,000 FLEX: Sam Howell $15,500 FLEX: DJ Moore $12,500 FLEX: Khalil Herbert $11,000 FLEX: Logan Thomas $7,000",
    "pubDate": "2023-10-05 18:50:29",
    "image_url": "https://sportshub.cbsistatic.com/i/2023/10/04/9e6cb3ce-1b78-49bd-9cab-6f75cb2b8b6a/brian-robinson-1-1400-us.jpg",
    "source_id": "cbssports",
    "source_priority": 72,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "d6f57122"
  },
  {
    "article_id": "fc78427cfe938f112db7af0ad5db22fa",
    "title": "WNBA expansion: Joe Lacob guarantees title for new Golden State team in first five years",
    "link": "https://www.cbssports.com/wnba/news/wnba-expansion-joe-lacob-guarantees-title-for-new-golden-state-team-in-first-five-years/",
    "keywords": null,
    "creator": [
      "Jack Maloney"
    ],
    "video_url": null,
    "description": "The new WNBA Golden State franchise will begin play in 2025",
    "content": "Joe Lacob is no stranger to making bold promises and building winning teams. Now, the man who helped turn the into a dynasty -- with four titles and six Finals appearances since he bought the franchise in 2010 -- is hoping to do the same in the WNBA. On Thursday, the WNBA officially granted Lacob and the Warriors that will begin play in 2025. The yet unnamed team will play at Chase Center and practice at the Warriors' facility in Oakland. If all goes to plan, they'll be hoisting a trophy sooner rather than later. \"First press conference with the Warriors, I said we will win a championship in the first five years,\" Lacob said during a press conference to officially announce the team on Thursday. \"I'm telling you right now, we will win a WNBA championship in the first five years of this franchise.\" Put this in your bookmarks. owner Joseph Lacob vows that once play begins, they will win a championship in the first 5 years of their existence 🙌 Lacob's claim may be audacious, but that's the kind of mindset any owner should have. It's also not out of the realm of possibility. The Seattle Storm won a title in their first five years of existence, and the Atlanta Dream got to two Finals in their initial five seasons. For a full historical account, here's a look at the timeline for the most recent expansion franchises. Note: This only includes teams that are still in operation and joined the league since 2000. As you can see, there is a wide range of outcomes for expansion franchises. The one common denominator is you're almost certainly going to be bad in your first season. From there a lot depends on draft luck, developing players, coaching and resources. On the latter, it's clear Lacob and Co. will spare no expense. The team isn't even playing yet and has its own dedicated practice facility, which some current teams can't claim. That kind of commitment doesn't guarantee success, but it goes a long way. \"We're coming in here, number one, to win,\" . \"Number two, we want to see this league and women's basketball grow, and we hope to be a big part of it. We think it's a watershed event for us to come in and commit to it in a big way. We're going to bring all of our resources. We can put this machine to work, and we're going to do that.\"",
    "pubDate": "2023-10-05 18:47:18",
    "image_url": "https://sportshub.cbsistatic.com/i/2023/10/05/25d32529-2ff1-4fc3-a313-6f09ffec1cd0/gettyimages-1183480383-1-1.jpg",
    "source_id": "cbssports",
    "source_priority": 72,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "a776056d"
  },
  {
    "article_id": "de07c9e577ecd35cc64026891345d499",
    "title": "'LOL-NO': AOC melodramatically insists we're in a CLIMATE EMERGENCY, gets BURIED in tsunami of SNARK",
    "link": "https://twitchy.com/samj/2023/10/05/aoc-claims-were-in-a-climate-emergency-n2388160",
    "keywords": [
      "<![CDATA[Climate change]]>",
      "<![CDATA[Alexandria Ocasio-Cortez]]>",
      "<![CDATA[AOC]]>"
    ],
    "creator": null,
    "video_url": null,
    "description": null,
    "content": "Blah blah blah blah. Hey, Sandy ... change the record. We are in a climate emergency. And all the polar bears are going to die. Ice caps melting. Oceans rising. You'd think by now they'd have figured out this fearmongering doesn't work on anyone who isn't already convinced man can somehow magically control the climate. She's not changing minds, she's irritating people. Plus she reminds us all that like many other millennials, she thinks history started in 2000. Now, do the same across history and see for yourself Earth’s climate changes. It gets hotter, then cooler, then hotter again. Earth is but one of countless googolplexes of celestial bodies in the known universe… Literally… ALL experiencing climate changes! It’s how it works! BUT IT'S AN EMERGENCY NOW, YO. Here is a graph of the last 3 million years of Mother Earth’s climate changes for reference! Huh, that doesn't seem like an emergency then. Gosh, you guys think AOC would lead us astray? lol no. No we aren’t Then you should start eating bugs you twat. Meep. Sweetheart, I've been hearing the sky will fall since before you were born. Every single time, the idiotic predictions have not come true at which point the goal posts are shifted, a new lie is told, and we repeat. Human beings cannot control the weather. Take off the tin foil. And get a life. *** Related: ***",
    "pubDate": "2023-10-05 18:46:00",
    "image_url": "https://media.townhall.com/cdn/hodl/2019/106/e461895f-e446-4fe5-b139-6892f89af4ad.png",
    "source_id": "twitchy",
    "source_priority": 14687,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "eea48182"
  },
  {
    "article_id": "02d9451e942c92f5cf0b893c6a683dfd",
    "title": "Researchers say that disinfectants can promote antibiotic resistance",
    "link": "https://phys.org/news/2023-10-disinfectants-antibiotic-resistance.html",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "According to figures published by the journal Nature, 73% of the world's antibiotics are used in the production of domestic animals. They are used primarily for preventive purposes because these animals are kept in confined and unhygienic conditions, but are also administered to promote growth.",
    "content": "October 5, 2023 This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility: fact-checked peer-reviewed publication trusted source proofread by Christina Benjaminsen, SINTEF According to figures published by the journal Nature , 73% of the world's antibiotics are used in the production of domestic animals. They are used primarily for preventive purposes because these animals are kept in confined and unhygienic conditions, but are also administered to promote growth. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1449240174198-2'); }); The result is that bacteria are becoming increasingly resistant to essential and life-saving antibiotics. So says Gunhild Hageskal, who is a Senior Research Scientist at the Norwegian science institute SINTEF. Together with her colleagues, including Anne Tøndervik, she is currently working in the field of antibiotic resistance, which is currently regarded as one of the biggest threats to global public health. \"We know that resistant microbes can be transmitted from animals to humans via our food and the environment,\" says Hageskal. \"This interaction is recognized as part of a 'One Health perspective,' acknowledging that all things are interconnected and that the battle to combat resistance must be fought at all levels,\" she says. A reduction in the use of antibiotics alone is no longer sufficient to combat the global increase in resistant microbes. According to The Lancet , preventive approaches must be introduced in order to inhibit transmission, with a particular focus on the livestock sector. And the problem is getting worse. Global prognoses for 2050 indicate that 10 million people will die each year because bacteria are developing antibiotic resistance. In comparison, only 7 million died in the course of three years as a result of the COVID-19 pandemic. Together with Iceland, Norway can boast at being clearly among the best in the world when it comes to limiting its use of antibiotics in the livestock sector. It is prohibited in the Norwegian sector to use antibiotics to promote growth or prevent disease. However, you don't have to look any further than Denmark to find that it is common practice for pigs and other animals to be administered with antibiotics in their feed. According to the researchers, the situation is worse by far in Asia and South America. As consumers, we should bear this in mind when we buy Argentinian beef, Danish bacon or Spanish ham. Meat is of course incorporated into a variety of processed products, and even if the label says that the country of origin is Norway, this doesn't necessarily mean that the animal was reared in Norway. However, even if Norway's problems are small compared to the rest of the world, we shouldn't be complacent. The world is more globalized than ever, and resistant microbes (bacteria and fungi, Ed.) have no respect for national boundaries. We are currently already seeing an increase in infections that are difficult to treat in Norwegian hospitals. According to SINTEF researchers, 1.3 million people died in 2019 because their treatment failed as the result of antibiotic resistance. An additional 5 million died due to associated problems. We continue to find unwanted microbes in the Norwegian food production sector. This is why disinfection procedures are a very important part of the production process. The use of disinfection is crucial to disease prevention and the control of microbial threats in many fields, such as medicine, agriculture, aquaculture, food production, the drinking water and cleaning sectors, as well as personal hygiene. \"The problem is simply that the use of disinfectants can itself cause bacteria to develop resistance to antibiotics,\" says Anne Tøndervik, who is also a Senior Research Scientist at SINTEF. This issue is described as a gap in our knowledge as we engage in the battle against antibiotic resistance. When a bacterium is exposed to antibiotics it adopts a number of strategies to protect itself. In basic terms, these strategies are identical to those that it uses to protect itself against other chemicals such as disinfectants. Some bacteria are even resilient enough to ward off the very agents that are designed to destroy them. These can then reproduce, enabling their descendants to inherit their resistance. Resistance may also develop naturally as a result of genetic mutation. \"We have seen indications that disinfectants can promote resistance and possibly also so-called cross-resistance, which enables bacteria to resist the threats of both antibiotics and disinfectants,\" says Hageskal. \"It is well known that disinfectants that contain quaternary ammonium compounds (one of the three most common active substances used for disinfection) are able to promote antibiotic resistance,\" she says. It is this problem that SINTEF is currently addressing as part of the project called DisinfectAMR. Together with its research partners at NTNU, SINTEF is looking into the effectiveness of agents used to disinfect poultry and salmon production lines, and whether these may have unwanted side effects in terms of contributing to antibiotic resistance. In order to compare condition status in Norway with the situation overseas, researchers are working together with the University of Lasi in Romania, where scientists are taking samples from the premises of a local poultry producer. A Ph.D. student is also participating in the project. To date, researchers have been focusing on what are known as slaughterhouse processing lines. These conceal many nooks and crannies that are difficult to keep clean, even when premises are washed down and disinfected on a daily basis. \"This is where biofilms are created. Biofilms form thin, slimy layers of microbes that in some cases can be difficult to spot with the naked eye,\" says Tøndervik. \"Biofilms are another piece in the puzzle. They represent the natural habitat of bacteria and are well-known for acting as the cradle of resistance development,\" she says. The reason for this is that bacteria enjoy better protection in biofilms and can survive the disinfection process. It is easier for them to exchange so-called genetic elements when many are assembled in the same place. Biofilms are also known to be involved in 80% of all infections in humans. In order to evaluate the problem and investigate the links between antibiotic resistance and the various kinds of disinfectants, the researchers have collected bacteria from a number of surfaces in poultry and salmon processing lines. To date, they have established a \"clan assemblage\" of approximately 1,000 bacterial isolates, which are now being studied in detail in laboratories at SINTEF and NTNU. These bacteria are being identified and tested with a number of different disinfectants currently in use in the same processing lines. \"We're also studying the variety of bacteria in the biofilms in the processing lines—the so-called microbiome—both before and after disinfection in order to see how the disinfection process impacts on bacterial communities across the slaughterhouse,\" explains Hageskal. In the next stage of the project, the genomes in the microbiome will be mapped and analyzed. This will give the researchers a clearer picture of which resistance genes are present. Even if the researchers succeed in destroying a bacterium, the genes that carry the resistance may still be intact and can be transmitted in residual raw materials and wastewater. This is how the snowball keeps on rolling. \"For this reason, it's important to acquire as much knowledge as possible about how we can remove unwanted bacteria from the production process most effectively,\" says Hageskal. Journal information: The Lancet , Nature Provided by SINTEF",
    "pubDate": "2023-10-05 18:44:08",
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2023/can-disinfectants-prom.jpg",
    "source_id": "phys",
    "source_priority": 6461,
    "country": [
      "united states of america"
    ],
    "category": [
      "science"
    ],
    "language": "english",
    "short_uuid": "1e9e961"
  },
  {
    "article_id": "bfefb329cd6fa3485aa6165897c73962",
    "title": "Mel Tucker's attorneys allege 'new evidence' in sexual misconduct case against ex-Michigan State coach",
    "link": "https://www.cbssports.com/college-football/news/mel-tuckers-attorneys-allege-new-evidence-in-sexual-misconduct-case-against-ex-michigan-state-coach/",
    "keywords": null,
    "creator": [
      "Will Backus"
    ],
    "video_url": null,
    "description": "Tucker's attorneys aim to outline contradictions in Brenda Tracy's allegations",
    "content": "Attorneys representing former Michigan State coach Mel Tucker sent a 106-page letter to the university's interim president and board of trustees on Thursday outlining \"new evidence\" in his sexual misconduct case. This as the university begins its hearing, also Thursday, into allegations against Tucker made by rape survivor and activist Brenda Tracy. The letter, by attorney Jennifer Z. Belveal, aims to identify contradictions in Tracy's allegations, which led to Michigan State's investigation and Tucker's subsequent firing. It alleges that Tracy \"manipulated a key witness\" and \"deleted key evidence.\" It also claims Tracy's motivations for filing the complaint were financial and contains partially redacted messages between Tracy and her former assistant, now deceased. \"Money is my only recourse to make him feel like there is a punishment,\" Tracy wrote in one message, according to the letter, \"when they do the money I should make him pay me 10k directly.\" Tucker, who was not present at Thursday's hearing due to a \"serious medical condition,\" was initially suspended without pay on Sept. 10 after Tracy's allegations were made public. Michigan State initiated the firing process eight days later, citing Tucker's moral turpitude clause of his contract. Tucker and his attorneys are in which the coach claims university leadership had ulterior motives; by firing him with cause, Michigan State avoids paying Tucker the nearly $80 million left on his deal. Tucker amassed a 20-14 record during his time with the Spartans. He was hired in 2020 and the following year led Michigan State to its first 11-win season since 2015. Michigan State went 5-7 in 2022 and was off to a 2-0 start at the time of Tucker's suspension. Former defensive backs coach Harlon Barnett is serving as the interim coach for the remainder of the season.",
    "pubDate": "2023-10-05 18:37:52",
    "image_url": "https://sportshub.cbsistatic.com/i/2023/10/05/b8be1d77-3726-49fc-9c53-6529406bafd4/mel-tucker.jpg",
    "source_id": "cbssports",
    "source_priority": 72,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "be7bcd51"
  },
  {
    "article_id": "b608e15a9d5ef8da34fd9998376bc83f",
    "title": "Nearly 6,800 current and former Sony employees' information exposed in a security breach",
    "link": "https://www.gamesindustry.biz/nearly-6800-current-and-former-sony-employees-information-exposed-in-a-security-breach",
    "keywords": [
      "data breach",
      "Business",
      "Sony Interactive Entertainment"
    ],
    "creator": [
      "Jeffrey Rousseau"
    ],
    "video_url": null,
    "description": "Sign up for the GI Daily here to get the biggest news straight to your inbox Sony has contacted nearly 6,800 current and former employees, advising them that their personal information was compromised in a cyber breach. As reported by BleepingComputer, the hack recorded by the Office of the Maine Attorney General was conducted by ransomware group Clop and took place from May 28 until May 30. Read more",
    "content": "to get the biggest news straight to your inbox Sony has contacted nearly 6,800 current and former employees, advising them that their personal information was compromised in a cyber breach. , the hack recorded by was conducted by ransomware group Clop and took place from May 28 until May 30. The breach accessed the personal information from a vulnerability in Sony's file transfer platform, MOVEit. Sony confirmed that the exploit was fixed. Those affected by the hack are being offered credit monitoring and identity restoration services. The news comes a week after Sony announced it was",
    "pubDate": "2023-10-05 20:47:28",
    "image_url": "https://assetsio.reedpopcdn.com/hack-00.png?width=1920&height=1920&fit=bounds&quality=80&format=jpg&auto=webp",
    "source_id": "gamesindustry",
    "source_priority": 11760,
    "country": [
      "united states of america"
    ],
    "category": [
      "technology"
    ],
    "language": "english",
    "short_uuid": "f907aced"
  },
  {
    "article_id": "b75785ca4cdeeb61d8c838321ab9a1cf",
    "title": "Meghan Markle and Prince Harry Are Headed to New York Next Week",
    "link": "https://www.glamour.com/story/meghan-markle-and-prince-harry-are-headed-to-new-york-next-week",
    "keywords": [
      "Entertainment"
    ],
    "creator": [
      "Sam Reed"
    ],
    "video_url": null,
    "description": "Their trip comes nearly five months after their “near catastrophic” car chase involving NYC paparazzi.",
    "content": "Meghan Markle and are making their return to New York City, and their visit is happening sooner than you might expect. reports that the couple will visit the Big Apple on Tuesday, October 10—World Mental Health Day—when they will host The Archewell Foundation Parents’ Summit: Mental Wellness in a Digital Age. The summit is their first in-person event since they co-founded Archewell in 2020 after stepping away from their duties as senior members of the royal family. According to the report, the event will “feature parents who have experienced tragic loss connected to their child’s social media use.\" Per a statement from the Sussex's spokesperson, \"The families have been engaged with The Archewell Foundation for the past year, bolstering community and driving towards solutions. Together, they are united in their mission to share personal experiences, data, and research to ensure the same does not happen to other families.” Just a month ago, the Duke and Duchess of Sussex for Prince Harry's sixth annual Invictus Games. The pair have not visited New York City since May, when Markle was given a Ms. Foundation Women of Vision Award. The morning after Meghan Markle was honored at the event, the Sussexes released a statement regarding a “near catastrophic” car chase involving the paparazzi. The couple has been photographed out and about more in recent months than when they first moved to Montecito, California from the UK. Prior to their trip to Germany, both Harry and Meghan were spotted in the audience at Beyoncé's tour show in Los Angeles. A little work, a little play—if you ask me, that's the perfect recipe for good mental health.",
    "pubDate": "2023-10-05 20:39:11",
    "image_url": "https://media.glamour.com/photos/6507330b9493fc7c1f7d356b/master/pass/1685062013",
    "source_id": "glamour",
    "source_priority": 722,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "dfc3a781"
  },
  {
    "article_id": "bfd6487d03ebe90c615384286aa4c892",
    "title": "51 Best Gifts for Wives That Show How Much You Care",
    "link": "https://www.glamour.com/gallery/best-gifts-for-wives",
    "keywords": [
      "Gift Guides",
      "Shopping"
    ],
    "creator": [
      "Brigitt Earley"
    ],
    "video_url": null,
    "description": "It's more than just the thought that counts.",
    "content": "You know your wife better than just about anyone else—and as queen of the household, she deserves only the best gifts for wives to mark an important occasion. After all, she's your partner, friend, confidante, and maybe even the mother of your children. You know what that means: No last-minute convenience store chocolate boxes (though we’re sure she’d happily devour those, too!). The come from the heart, so we’re going for thoughtfulness here. And the best way to pick out a thoughtful is to pause and think about what makes her tick. Is your wife the type of person who loves to be pampered? Take her wellness routine to new heights with a or trending new or give her a luxe silk robe. Maybe she’s more of a doer? Impress her with the latest and greatest Apple Watch, a paint-by-numbers kit, or a beautiful journal. Of course, you could also mark a special milestone like an anniversary or big birthday with . Diamond earrings, anyone? To set you off in the right direction, we curated a list of more than 50 high-quality options—each one special and unique enough for your numero uno. All products featured on are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission. Ugg Scuffette II Slippers Nordstrom Amazon A is always a good idea, and this shearling-lined option is water-resistant and has a rubber sole, so she can grab the mail or take out the dog without having to do a switcheroo. Kate Spade “Heart of Gold” Idiom Bangle Nordstrom Amazon For the woman the whole family depends on, a dainty gold bracelet that reminds her how appreciated she is.",
    "pubDate": "2023-10-05 20:37:50",
    "image_url": "https://media.glamour.com/photos/651f099aa0aab8008392831d/master/pass/best%20gifts%20for%20wives.jpg",
    "source_id": "glamour",
    "source_priority": 722,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "e6493c73"
  },
  {
    "article_id": "fe21204afa7bda891eb2fa714f08bbeb",
    "title": "RIP: NFL great Dick Butkus dead at 80",
    "link": "https://twitchy.com/amy-curtis/2023/10/05/rip-nfl-great-dick-butkus-dead-at-80-n2388183",
    "keywords": [
      "<![CDATA[breaking news]]>",
      "<![CDATA[Chicago]]>",
      "<![CDATA[football]]>"
    ],
    "creator": null,
    "video_url": null,
    "description": null,
    "content": "Football legend Dick Butkus has died, TMZ Sports reports: NFL Legend Dick Butkus Dead At 80 Butkus was found unresponsive in his Malibu, California home: NFL legend Dick Butkus -- one of the greatest linebackers of all time -- has died, has learned. He was 80 years old. We're told someone went to check on Butkus at his home on Thursday ... and he was found unresponsive. The family later released the following : Dick Butkus, a legendary Bears Hall of Fame middle linebacker and Chicago native who many still consider the most ferocious defensive player in NFL history, has passed away. He was 80. The Butkus Family released the following statement: \"The Butkus Family confirms that football and entertainment legend Dick Butkus died peacefully in his sleep overnight at home in Malibu, Calif. The Butkus family is gathering with Dick's wife Helen. They appreciate your prayers and support.\" \"Dick was the ultimate Bear, and one of the greatest players in NFL history,\" Bears chairman George H. McCaskey said in a statement. \"He was Chicago's son. He exuded what our great city is about and, not coincidently, what George Halas looked for in a player: toughness, smarts, instincts, passion and leadership. He refused to accept anything less than the best from himself, or from his teammates. When we dedicated the George Halas statue at our team headquarters, we asked Dick to speak at the ceremony, because we knew he spoke for Papa Bear. \"Dick had a gruff manner, and maybe that kept some people from approaching him, but he actually had a soft touch. His legacy of philanthropy included a mission of ridding performance enhancing drugs from sports and promoting heart health. His contributions to the game he loved will live forever and we are grateful he was able to be at our home opener this year to be celebrated one last time by his many fans. \"We extend our condolences to Helen, Dick's high school sweetheart and wife of 60 years, and their family.\" They also posted this on Twitter: Dick Butkus was a legend who embodied what it means to be a Chicago Bear. Our hearts go out to his family and friends. As did the NFL: The NFL is mourning the loss of legendary Hall of Famer Dick Butkus. Our thoughts are with his family and the Bears organization. Fans on Twitter/X shared their reaction to Butkus's passing: Very sad. He is on the Mount Rushmore of Bears players. One of the best defensive players ever in football He once held the record for 26 fumble recoveries and is tied for 11th in Bears history at 22 career interceptions. The Bears retired his jersey in 1994. Damn, he was just on here tweeting like a week ago...RIP to a legend. He was. If the Bears don’t win tonight… 😤 The Bears play Washington tonight for Thursday night football. Kickoff is at 7:15 pm Chicago time. Dick Butkus had one of the greatest commercials ever. He had a lot of very fun commercials. Throwback to this epic Dick Butkus exchange RIP to a great one This was epic. Super Sky Point to the predatory, legendary, and utterly hilarious Dick Butkus. He was, and always will be, the goddamn physical embodiment of the greatness of the city of Chicago. If your kids don’t know, just tell ‘em if he didn’t know who had the ball he’d tackle the entire… He was incredible on the field. To really understand the greatness of Dick Butkus, he was the NFL Defensive Player of the Year in 1969 despite the fact that the Bears finished 1-13. RIP to a legend. What an achievement. Dick Butkus presenting that ball to the defender after the TD in 1971 was priceless. RIP Priceless. Prediction: Bears lose by 51 points to honor Dick Butkus. RIP legend. This writer is a Packer fan, so it wouldn't be a post about the Bears without some good natured fun. Somebody give me some pads and a QB to tackle. Our sympathies and prayers are with the Butkus family and the NFL as they mourn the loss of one of the greats. ***",
    "pubDate": "2023-10-06 00:15:44",
    "image_url": "https://media.townhall.com/cdn/hodl/2015/121/4191a796-5f43-4f17-b0b8-32b9f2b4f515.jpg",
    "source_id": "twitchy",
    "source_priority": 14687,
    "country": [
      "united states of america"
    ],
    "category": [
      "entertainment"
    ],
    "language": "english",
    "short_uuid": "62ecc60c"
  },
  {
    "article_id": "15caf18ff15ac5717ae4000486b2ea5d",
    "title": "Bears legend Dick Butkus dies at 80",
    "link": "https://www.postguam.com/sports/nation/bears-legend-dick-butkus-dies-at-80/article_a004740c-242a-5e56-bb5e-cd5b31492213.html",
    "keywords": null,
    "creator": [
      "Field Level Media"
    ],
    "video_url": null,
    "description": "Bears legend Dick Butkus dies at 80",
    "content": "Hall of Fame linebacker Dick Butkus, whose name became synonymous with the Chicago Bears and hard-nosed defense, has died, his family announced Thursday. Butkus was 80. \"The Butkus family confirms that football and entertainment legend Dick Butkus died peacefully in his sleep overnight at home in Malibu, California,\" the family said in a statement. \"The Butkus family is gathering with Dick's wife Helen. They appreciate your prayers and support.\" Additional information was not yet provided. The news came less than two hours before the Bears were slated to face the host Washington Commanders in a \"Thursday Night Football\" matchup. Born in Chicago, Butkus built his memorable football career in his home state, becoming an All-American at Illinois before joining the Bears in 1965. Butkus became a two-time NFL Defensive Player of the Year (1969, 1970) and an eight-time Pro Bowl selection in a nine-year pro career before going on to work as a broadcaster, pitchman and actor. He played 119 games for the Bears, tallying 22 interceptions, 27 fumble recoveries and at least 11 sacks during an era when defensive statistics weren't closely kept. He is a member of both the College Football and Pro Football Halls of Fame. \"Some people were made to be doctors, others to be lawyers,\" Butkus once said. \"I was made to play football.\" --Field Level Media",
    "pubDate": "2023-10-06 00:11:46",
    "image_url": "https://bloximages.newyork1.vip.townnews.com/postguam.com/content/tncms/assets/v3/editorial/b/5c/b5ce440d-64cf-59a9-8015-9cff86f02a9b/651f47027aaa6.image.jpg?resize=300%2C450",
    "source_id": "postguam",
    "source_priority": 93374,
    "country": [
      "united states of america"
    ],
    "category": [
      "sports"
    ],
    "language": "english",
    "short_uuid": "8c9ba046"
  },
  {
    "article_id": "4ffb65f2c2e2911906283ad54a10cfe8",
    "title": "Britney Spears’ Dad Jamie Reportedly Hospitalized for Infection: He’s ‘Severely Ill’",
    "link": "https://hollywoodlife.com/2023/10/05/britney-spears-dad-jamie-spears-reportedly-hospitalized-for-infection/",
    "keywords": [
      "Celebrity News",
      "News",
      "Jamie Spears"
    ],
    "creator": [
      "Audrey Rock"
    ],
    "video_url": null,
    "description": "A Thursday report claims that Britney's estranged dad has landed in the hospital with a serious infection, amid his ongoing feud with his famous daughter.",
    "content": ", 41, has had a tough year — and according to a new report, it’s about to get worse. Brit’s estranged father, , has reportedly been hospitalized with what’s described as a “bad” infection. “Jamie has been suffering with a bad infection that has required surgery,” an insider told for the Thursday, October 5 report. “He has been hospitalized for weeks in a special infectious disease facility.” Another insider reportedly told the outlet that the pop star’s dad, who oversaw her controversial and restrictive 13-year legal conservatorship, is “extremely ill.” The outlet also claimed that a recent report that for alleged alcoholism was false. Reports of health trouble for the Spears patriarch first emerged in late August, when reported that Jamie was in the hospital “several months” prior, where doctors reportedly “believed there was something wrong with his kidneys.” The outlet claimed his knees were the actual culprit, as Jamie had a knee replacement over a decade and a half ago and “somehow he developed a terrible infection.” At the time, the outlet also reported that the “Toxic” songstress was eyeing a potential reconciliation with her father — despite blasting him in court in 2021, when she was from her conservatorship. Sources with “direct knowledge” for the outlet claimed that following from estranged husband , the hitmaker “wants to repair the relationship with her dad. She knows Jamie has been ill — in and out of the hospital for months, and doesn’t want the regret of waiting too long,” the source reportedly said. The outlet also claimed that Jamie had lost in excess of 25 pounds over the ordeal and was “extremely thin.” Britney’s hard-fought battle against her lengthy conservatorship finally ended in victory in November of 2021. “I just want my life back,” she said during an emotional testimony in June of 2021. “And it’s been 13 years. And it’s enough.”",
    "pubDate": "2023-10-06 00:09:38",
    "image_url": "https://hollywoodlife.com/wp-content/uploads/2023/10/britney-spears-dad-jamie-hospitalized-FTR.jpg",
    "source_id": "hollywoodlife",
    "source_priority": 977,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "74aee583"
  },
  {
    "article_id": "7919d1d3ee1cbc2a3306cec413b0cd32",
    "title": "Tough guy nukes X account after saying conservatives need to be put in reeducation camps",
    "link": "https://twitchy.com/brettt/2023/10/05/tough-guy-nukes-x-account-after-saying-conservatives-need-to-be-put-in-reeducation-camps-n2388178",
    "keywords": [
      "<![CDATA[Conservatism]]>",
      "<![CDATA[mental illness]]>",
      "<![CDATA[murder]]>"
    ],
    "creator": null,
    "video_url": null,
    "description": null,
    "content": "Normally we don't pick on randos like @jestingtime, but not only has he deleted his tweet from earlier today — he's deleted his entire X account. \"This Post is from an account that no longer exists,\" is all X will tell us. It probably had something to do with him declaring that American conservatives needed to be put in reeducation camps and made to do forced labor. \"American conservatism is a mental illness that needs to be eradicated through reeducation camps and forced labor\" Yes Apparently, he, like many others, was upset about conservatives being less than broken up about the murder of a far-left activist on a New York City street. Reportedly, his girlfriend, who watched him get stabbed to death in the chest, refused to give a description of the (black male) suspect caught on video doing it. She literally refused to tell the police the description of her boyfriend’s killer because it would cause “racist stereotypes”. If anyone needs reeducation camps, it’s progressives like her, nevermind the killers. You want people in \"Reeducation camps and forced labor\" and I'm the delusional? Who's going to put me in a camp if you already defunded the police? Reeducation camps and forced labor? Jestin wants to be him so bad, it’s plain to see. The guy's name's apparently Jestin, which is probably why he got and nuked his account. American liberalism is a mental illness that needs to be eradicated through reeducation camps and forced labor American liberalism is a mental illness that needs to be eradicated through reeducation camps and forced labor Historically, reeducation camps and forced labor for the “mentally ill” (in other words “people who don’t buy our bullshit”) have been the favorite tools of leftists. It’s why they want to disarm conservatives. No armed person is going to willingly load themselves in boxcars. 🤷‍♂️ Your projection game is on point. Sounds very Nazish As the saying goes... Stack up kiddo 🥱 This is the guy who's supposedly going to show up at your door and drag you off for forced labor: Go round em up. Make sure to livestream it though I can't wait to see how it turns out for ya. Marx on the back of a Volvo 🤣 As always, the avowed marxists reject the tenets of Marxism and opt to live lavish lifestyles while cosplaying as Soviets or some such nonsense. There's a shot of the activist's girlfriend showing off her MARX license plate. The chances of you and your friends making that happen is literally zero. And are you going to be putting these people through reeducation camps and forced labor, or are you just gonna expect LEOs and the military to do it? Congratulations on absolutely vindicating the very people you’re trying to condemn lol What happened to Ryan Carson was horrific and absolutely meaningless. Sorry there are some who aren't as broken up about it. Bloomberg/WaPo op-ed writer is so mad about posts on Ryan Carson’s stabbing that he deleted X from his phone. ..But he’s still on here posting his article. And he’s still going to “continue to follow X.” He’s just really mad at There are 2 subreddits, one with 500K subscribers, anther with 1 million, dedicated to celebrating misfortune and deaths of political opponents, mostly conservatives. And given how tightly regulated that forum is, you have to think Reddit approves of them. Yeah, progressives have never celebrated the death of a conservative … we can't think of a single example. ***",
    "pubDate": "2023-10-06 00:00:10",
    "image_url": "https://media.townhall.com/cdn/hodl/tw/images/up/2023/206/d0750609-69d3-4b16-9403-ba9a70e97504.png",
    "source_id": "twitchy",
    "source_priority": 14687,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "8926c242"
  },
  {
    "article_id": "cfb60ea4c3573b8a150f67a53a5b4d24",
    "title": "MTG surveying constituents for Speakership vote, despite saying Trump is ‘perfect man for the job’",
    "link": "https://thehill.com/homenews/house/4241355-mtg-surveying-constituents-for-speakership-vote/",
    "keywords": [
      "House",
      "News",
      "Speakership vote"
    ],
    "creator": [
      "Lauren Irwin"
    ],
    "video_url": null,
    "description": "Rep. Marjorie Taylor Greene (R-Ga.) is asking her constituents for input on who they think should be the next Speaker of the House. “The House of Representatives is scrambling to find the next Speaker of the House,” she said in a page on her Congressional website. After Tuesday’s historic vote ousted former Speaker Kevin McCarthy...",
    "content": "Rep. Marjorie Taylor Greene (R-Ga.) is for input on who they think should be the next Speaker of the House. “The House of Representatives is scrambling to find the next Speaker of the House,” she said in a page on her Congressional website. After Tuesday’s historic vote ousted former Speaker Kevin McCarthy (R-Calif.), several Republicans have stepped up to fill the vacant seat. Judiciary Committee Chairman Jim Jordan (R-Ohio) and Majority Leader Steve Scalise (R-La.) have both . On her website, Greene said she is “not sure the next Speaker should be a sitting Representative at this time.” The Speaker does not have to be a current member of the House of Representatives. She said she has the “perfect man for the job,” former President Donald Trump. But before she casts her vote next week, she said she wanted to poll her constituents on who they think should be the next speaker. Options in Greene’s poll include Trump, Jordan, Scalise or “other.” “Republicans have one chance to select a NEW Speaker of the House,” . “President Trump has a PROVEN track record for the American people.” Trump the idea of being Speaker, but later told Fox News Digital on Thursday that he would accept a short-term role and serve as a “unifier” for the Republican party as speaker “if necessary.”",
    "pubDate": "2023-10-06 01:00:15",
    "image_url": "https://thehill.com/wp-content/uploads/sites/2/2023/07/taylorgreenemarjorie_051823tc07_w.jpg?w=900",
    "source_id": "thehill",
    "source_priority": 393,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "d30fd4d2"
  },
  {
    "article_id": "1d2f27938c699abc8275b46a7a8170a6",
    "title": "Grassley says Biden border wall decision made because 'big blue cities' are 'facing the reality' of migrant crisis",
    "link": "https://thehill.com/homenews/administration/4241269-grassley-says-biden-administration-border-wall-decision-made-because-big-blue-cities-are-facing-the-reality-of-migrant-crisis/",
    "keywords": [
      "Administration",
      "Biden administration",
      "border wall",
      "Department of Homeland Security",
      "U.S.-Mexico border"
    ],
    "creator": [
      "Nick Robertson"
    ],
    "video_url": null,
    "description": "Sen. Chuck Grassley (R-Iowa) had backhanded praise for the Biden administration’s decision to expand the border wall on the U.S.-Mexico border in Texas on Thursday, saying the shift proves Republican border policy right. Grassley celebrated the move, but said previous Biden administration policies caused the mass undocumented immigration that made more wall necessary. \"never shld...",
    "content": "Sen. Chuck Grassley (R-Iowa) had backhanded praise for the Biden administration’s decision to expand the border wall on the U.S.-Mexico border in Texas on Thursday, saying the shift proves Republican border policy right. Grassley celebrated the move, but said previous Biden administration policies caused the mass undocumented immigration that made more wall necessary. “never shld hv taken Pres Biden this long to agree WALLS WRK,” , the platform formerly known as Twitter. “This admins policies encouraged illegal immigration &created humanitarian crisis+strained town resources across US Now that big blue cities r facing reality of crisis Biden admin starts 2wake up?? Praise the lord FINALLY.” The Biden administration 26 federal regulations to speed up border wall construction over 20 miles of the U.S.-Mexico border in Texas. The move has garnered criticism from both Republicans and Democrats. Sen. Ted Cruz (R-Texas) while Rep. Alexandria Ocasio-Cortez (D-N.Y.) demanded an immediate correction. But Homeland Security Secretary Alejandro Mayorkas that the announcement is a change of administration policy — like Grassley and others have claimed. “From day one, this Administration has made clear that a border wall is not the answer. That remains our position and our position has never wavered,” Thursday evening. Biden said Thursday that the administration was forced into the move due to legal restrictions. Funding for the new Texas wall was already allocated during the Trump administration, and the Biden administration could not spend it elsewhere, despite attempts to. In the announcement of the move earlier Thursday, Mayorkas said the new border wall was needed. “There is presently an acute and immediate need to construct physical barriers and roads in the vicinity of the border of the United States in order to prevent unlawful entries into the United States in the project areas,” he said.",
    "pubDate": "2023-10-06 00:35:09",
    "image_url": "https://thehill.com/wp-content/uploads/sites/2/2023/07/TOP-Grassley_041923_AP_Carolyn-Kaster.jpg?w=900",
    "source_id": "thehill",
    "source_priority": 393,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "9a290647"
  },
  {
    "article_id": "ee4cf5e1a57feff17492a9f354f9e80c",
    "title": "Illinois legend Dick Butkus dies at 80: Former linebacker's name is synonymous with excellence at his position",
    "link": "https://www.cbssports.com/college-football/news/illinois-legend-dick-butkus-dies-at-80-former-linebackers-name-is-synonymous-with-excellence-at-his-position/",
    "keywords": null,
    "creator": [
      "Dean Straka"
    ],
    "video_url": null,
    "description": "Butkus redefined linebacker play at the college level during his time at Illinois",
    "content": "The football community lost an icon Thursday when Dick Butkus . Butkus was best known for his Hall of Fame career as a linebacker for the Chicago Bears from 1965-73, but his legacy is not limited to professional football. Butkus' legendary career at earned him a place in the Hall of Fame. His name is so synonymous with excellence that the award presented to college football's best linebacker every year bears his name. \"I am saddened to learn of the passing of Dick Butkus, the greatest linebacker in football history,\" Illinois coach Bret Bielema said in a press release. \"As the head coach of his alma mater that he loved, I had the great honor to meet Dick, one of my childhood idols, last September. He was an amazing person, as well as football player, and a loyal Illini. Dick embodied everything that Illinois football has represented in the past and what we look to represent into the future. His deep love for Illinois football will be honored and remembered forever.\" A Chicago native, Butkus attended Illinois in the early-to-mid 1960s, playing center and middle linebacker for the Fighting Illini from 1962-64. His impact for the Illinois program was immediate. Butkus was an All-Big Ten selection his first year. While the team finished 2-7 that fall, far more success for both Butkus and the program as whole was on the horizon. \"Dick Butkus was a giant in a land of giants,\" Illinois athletic director Josh Whitman said in a release. \"In a game built on toughness and tenacity, he stood alone. One of the most imposing figures to ever wear a helmet, away from the field, Dick was self-effacing, humble, and generous. A cultural icon, Dick leaves a legacy on Americana that will never be forgotten.\" The 1963 season saw Illinois compile an 8-1-1 overall record, capturing the Big Ten championship and ending the season with a Rose Bowl victory against for a No. 3 finish in the AP rankings. Butkus was the star of the show for the Illini defense that season, winning Big Ten Player of the Year honors and Unanimous All-American honors. In 1964 Butkus finished third in Heisman voting and was named a Consensus All American as Illinois finished 6-3 and ranked No. 16. \"Our University is better, our game is better, and our country is better, all because we were graced by the presence of one Dick Butkus,\" Whitman said. For his Illinois career, Butkus totaled 347 tackles. His 145 tackles in 1963 stood as a school record until 1976. Butkus also toppled the century-mark in 1964, registering 132 total tackles before he went No. 3 overall in the 1965 to the Chicago Bears. Butkus' No. 50 was retired by the university in 1986 before he was named to the Walter Camp Foundation All-Century team in 1989. Additionally, Butkus is a member of the Illinois Athletics Hall of Fame. By going on to play exclusively for Chicago in the NFL, Butkus was able to spend his entire football playing career within his native Illinois. In his eight-year NFL tenure, Butkus totaled 1,020 tackles, 22 interceptions, and 25 fumble recoveries. He was inducted into the Pro Football Hall of Fame in 1979.",
    "pubDate": "2023-10-06 00:24:38",
    "image_url": "https://sportshub.cbsistatic.com/i/2023/10/05/a8ec36c2-c50b-4337-88c2-bdadaeb36f86/gettyimages-1175410105.jpg",
    "source_id": "cbssports",
    "source_priority": 72,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "99873bd6"
  },
  {
    "article_id": "3b8f5ffd08b64cc1d4cfce73d4d49942",
    "title": "Mets GM Billy Eppler steps down amid reported probe into alleged misuse of injured list",
    "link": "https://www.cbssports.com/mlb/news/mets-gm-billy-eppler-steps-down-amid-reported-probe-into-alleged-misuse-of-injured-list/",
    "keywords": null,
    "creator": [
      "Dayn Perry"
    ],
    "video_url": null,
    "description": "The changes in Queens continue this offseason",
    "content": "general manager Billy Eppler has resigned after two seasons on the job, Thursday. , Eppler stepped down in the midst of a probe by Major League Baseball into \"alleged improper uses of the injured list.\" Eppler, 48, had been the Mets' GM since November of 2021 and helped build the team that won 101 games and made the playoffs in 2022. This season, however, the Mets were grave disappointments as they went 75-87 and finished in fourth place in the National League East despite the highest payroll in history. Eppler's resignation comes not long after former executive and new lead decision-maker. \"Billy Eppler led this team through a 101-win season and postseason berth last year and he will be missed,\" Mets owner Steve Cohen said in the statement released by the team. \"We accepted Billy's resignation today as he decided it is in everyone's best interest to fully hand over the leadership of Baseball Operations to David Stearns. On behalf of the Mets organization, we wish him all the best.\" \"I wanted David [Stearns] to have a clean slate and that meant me stepping down,\" Eppler said in that same statement. \"I hope for nothing but the best for the entire Mets organization.\" Given Eppler's presence at Stearns' introductory press conference, the decision comes a surprise. That may be explained by the reported investigation by the league noted above. While Stearns and the Mets will likely replace Eppler at some point, it's not an urgent matter given that Stearns is already in place atop baseball operations. Eppler previously served as GM of the but was let go in 2020 after five seasons. at the end of the regular season, which means Stearns will be able to have a hand-picked leader in the dugout and as his chief lieutenant in the front office.",
    "pubDate": "2023-10-06 00:22:41",
    "image_url": "https://sportshub.cbsistatic.com/i/2023/10/05/ba53a9b6-6e5b-4800-b27e-e7a003b5f38a/eppler-mets-getty.png",
    "source_id": "cbssports",
    "source_priority": 72,
    "country": [
      "united states of america"
    ],
    "category": [
      "top"
    ],
    "language": "english",
    "short_uuid": "e36b7dcd"
  }
]
