[
  {
    "article_id": "5fac7781a73d91fcbe1a67bd28676f3c",
    "title": "Three-Continent 2030 World Cup Gives Some Teams An Unfair Disadvantage",
    "link": "https://www.forbes.com/sites/steveprice/2023/10/05/three-continent-2030-world-cup-gives-some-teams-an-unfair-disadvantage/",
    "keywords": [
      "SportsMoney",
      "/sportsmoney",
      "Business",
      "/business",
      "SportsMoney",
      "/sportsmoney",
      "business",
      "sportsmoney",
      "standard"
    ],
    "creator": [
      "Steve Price, Senior Contributor"
    ],
    "video_url": null,
    "description": "The opening 3 games of the FIFA 2030 World Cup will be played 10,000 km away from the rest of the tournament. The teams playing in those games have a huge disadvantage.",
    "content": "Forbes Business SportsMoney Three-Continent 2030 World Cup Gives Some Teams An Unfair Disadvantage Steve Price Senior Contributor Opinions expressed by Forbes Contributors are their own. Following Oct 5, 2023, 02:45am EDT | Press play to listen to this article! Got it! Share to Facebook Share to Twitter Share to Linkedin LONDON, ENGLAND - JULY 11: Francesco Acerbi, Leonardo Bonucci and teammates celebrate after victory ... [+] in the UEFA Euro 2020 Championship Final between Italy and England at Wembley Stadium on July 11, 2021 in London, England. (Photo by Andy Rain - Pool/Getty Images) Getty Images Teams hoping to win the World Cup not only have to beat their opponents, they need to beat the local climate and conditions. Games played at altitude, in soaring temperatures, or with huge distances between venues can make or break a team’s tournament. At the 2014 World Cup, an energy-sapping encounter in Manaus, deep in the hot and humid Amazon basin, exhausted England and Italy’s players, and was partially blamed for both countries’ group-stage exits. Many of these challenges are caused simply by the diverse nature of our planet. But for the 2030 World Cup, FIFA has skewed the field for its own political reasons. Reports suggest that the 2030 World Cup will be hosted in Spain, Portugal and Morocco, but with the opening three matches played across the ocean in South America. Uruguay, Paraguay and Argentina had bid for the 2030 tournament, with a main focus of their bid being that it would be 100 years since the first World Cup in Uruguay, so it would be nice and sentimental to host the centenary event there too (despite most of the games being in neighboring Argentina). In some feat of sporting diplomacy, it seems the bulk of the 2030 tournament will now be played in Europe and North Africa, with the opening three games being played in Uruguay, Paraguay and Argentina to reflect this centenary year. MORE FOR YOU Ukrainian Troops Recovered One Of Their Damaged Strv 122 Tanks—In Time For The Tank To Meet The President Bill Gates Predicts Arista Networks Will Disrupt Google And Amazon Powerball Jackpot Rises To 1 4 Billion Here s What The Winner Will Take Home After Taxes It is a solution that tries to make everybody happy (not least Saudi Arabia, who appear to have an open goal for their bid to host the 2034 World Cup) while actually making nobody happy. Local South Americans will be unlikely to get any tickets despite “hosting” a World Cup, national team fans will have to add a transatlantic ticket to their World Cup expenses, and while Infantino says 2030 “will have a unique global footprint,” it seems he hasn’t considered the tournament’s carbon footprint . The decision to host the opening three games in South America could also impact the sporting integrity of the tournament. Buenos Aires is more than 10,000 kilometers, or a 12-hour flight, from Madrid. That’s more than double the distance between 2026 host cities Vancouver and Miami, and more than three times the distance between the two furthest apart cities at Russia 2018. While Madrid and Morocco could be in the middle of summer heatwaves during the World Cup, it will be winter in Buenos Aires with the daily mean temperature in June just 12 degrees Celsius (53 degrees Fahrenheit), and there is a six-hour time difference between Paraguay and Spain. The effect of travel on performance can be seen at Euro 2020 , which was held across Europe and had huge disparities between distances traveled, with some countries potentially traveling more than ten times further than others. Out of all the teams to reach the knockout stages, the two finalists, England and Italy, had the shortest total distance from their opening game to the final. Semi-finalists Denmark had the second shortest distance to travel up to the round of 16, where they won 4-0 against Wales, who had the fifth longest distance at that stage. The other semi-finalist, Spain, had the fifth shortest route to the final. And in the three-day turnaround between the quarterfinals and semifinals, the two losers of the semifinals had much longer journeys to London from Baku and Saint Petersburg. Correlation might not be causation, but there is certainly some correlation between the distances traveled and results during Euro 2020. Overcoming the local conditions is part of tournament soccer. As far back as the Mexico 1986 World Cup, England trained in steam rooms at altitude in Colorado to try to prepare for with the altitude of Mexico City and extreme heat of Monterrey. But depending on the fixture schedule, six teams at the 2030 World Cup could possibly have to travel an extra 10,000 miles more than their next opponents. They will also need to find two base camps, disrupting their tournament preparations. Whether it shows in the next game, or through accumulated fatigue as the tournament progresses, these kinds of factors can make the difference between winning and losing. Follow me on Twitter . Steve Price Editorial Standards Print Reprints & Permissions",
    "pubDate": "2023-10-05 06:45:29",
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/651e57ad9b42485e6812d410/0x0.jpg?width=960",
    "source_id": "forbescrypto",
    "source_priority": 57,
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english",
    "short_uuid": "b00f87ca"
  },
  {
    "article_id": "82093009c8030984a7c4dbd9fb2991d3",
    "title": "Doctors urged to ask patients about gambling in new NHS mental health guidance",
    "link": "https://www.theguardian.com/society/2023/oct/05/doctors-urged-to-ask-patients-about-gambling-in-new-nhs-mental-health-guidance",
    "keywords": [
      "Gambling",
      "Society",
      "Mental health",
      "NHS",
      "Health"
    ],
    "creator": [
      "PA Media"
    ],
    "video_url": null,
    "description": "People should be asked about problem gambling in same way they are asked about drugs and alcohol, say draft rulesPeople who seek help for mental health issues should be asked about problem gambling in the same way they are asked about drugs, smoking and alcohol, new guidance has suggested.According to the National Institute for Health and Care Excellence (Nice), those who visit an NHS health professional in England for depression, anxiety or thoughts about self-harm or suicide due to a possible addiction, such as alcohol or drugs, could be at a greater risk of harm from gambling.In the UK and Ireland, Samaritans can be contacted on freephone 116 123, or email jo@samaritans.org or jo@samaritans.ie. In the US, you can call or text the National Suicide Prevention Lifeline on 988, chat on 988lifeline.org, or text HOME to 741741 to connect with a crisis counselor. In Australia, the crisis support service Lifeline is 13 11 14. Other international helplines can be found at befrienders.org Continue reading...",
    "content": "People who seek help for mental health issues should be asked about problem gambling in the same way they are asked about drugs, smoking and alcohol, new guidance has suggested. According to the National Institute for Health and Care Excellence (Nice), those who visit an NHS health professional in England for depression, anxiety or thoughts about self-harm or suicide due to a possible addiction, such as alcohol or drugs, could be at a greater risk of harm from gambling. Nice said questions should be asked about patients’ gambling habits to ensure they can cope with their thoughts and urges. In new draft guidance, it suggested patients should be encouraged to assess the severity of their gambling by using a questionnaire available on the NHS website. Those who score eight or higher should seek support and treatment from gambling services. Health professionals should also discuss software blocking tools to limit online gambling and consider cognitive behavioural therapy (CBT) as an option. NHS England has said about 1,400 people were referred for help for gambling addiction last year, up by a third on 2021. Prof Jonathan Benger, the chief medical officer and interim director of the centre for guidelines at Nice, said: “Harmful gambling causes immense misery to all those who experience it. We want those needing help or who are at risk to be identified sooner and receive appropriate help.” Since 2019, NHS England has opened 12 gambling treatment clinics, with a further three due to open in the coming months. It is planning to treat up to 3,000 people a year across the 15 facilities, as part of the NHS long-term plan. Benger added: “The independent committee who made these draft recommendations included both clinicians and people with personal experience of harmful gambling. They scrutinised all the available evidence to identify treatments and therapies that have been shown to work and offer good value for money. The result is this useful and usable advice to help NHS clinics as they develop their service.” Fiona Macleod, the director of services at the charity GamCare, said the Nice guidance was “an important step”. “Identifying an issue with gambling as early as possible is vital to prevent harm from occurring later down the line, and we know that there is an important role that healthcare professionals can play in helping more people find the support they need. “We believe these recommendations, if implemented, will present a greater opportunity to prevent gambling harms from occurring in the UK. They represent an important step in encouraging more people to seek support, through services such as those GamCare provides.” Zoë Osmond, the chief executive of GambleAware, also welcomed the draft guidance. “Gambling harms are a serious public health issue, which can affect anyone, and healthcare professionals are ideally placed to identify and help people experiencing them,” she said. “We welcome the development of guidelines to further inform treatment for those seriously affected by gambling harm and will be responding to the consultation with our views.” The NHS England mental health director, Claire Murdoch, said: “Gambling addiction is a cruel disease that destroys people’s lives, and the NHS is already playing its part in treating it with four new specialist clinics opening in recent months and a further three opening later this year, so if you’re struggling, please come forward for help. “We will work with Nice on this consultation process and while this new guidance will ensure the NHS can help even more people struggling with gambling addiction to receive evidenced-based treatment, it is vital that the billion-pound industry also takes action in line with the government’s white paper to stop people coming to harm in the first place.” In April, the government outlined plans to reform gambling to ensure regulation meets new challenges as the “landscape has changed significantly since 2005”. For support, advice or information about gambling, contact the National Gambling Helpline on 0808 8020 133. In the UK and Ireland, Samaritans can be contacted on freephone 116 123, or email jo@samaritans.org or jo@samaritans.ie . In the US, you can call or text the National Suicide Prevention Lifeline on 988, chat on 988lifeline.org , or text HOME to 741741 to connect with a crisis counselor. In Australia, the crisis support service Lifeline is 13 11 14. Other international helplines can be found at befrienders.org",
    "pubDate": "2023-10-05 06:37:09",
    "image_url": "https://i.guim.co.uk/img/media/e859935cfbd1a3c9d1fed54ddb12dc3b5a4c5966/0_457_5357_3213/master/5357.jpg?width=460&quality=85&auto=format&fit=max&s=1a1bec6ad5c74045791e8c7b6190e8f4",
    "source_id": "theguardian",
    "source_priority": 106,
    "country": [
      "united states of america"
    ],
    "category": [
      "health"
    ],
    "language": "english",
    "short_uuid": "713c7186"
  },
  {
    "article_id": "3ce9cc74e879b5e8030e810391d83124",
    "title": "Cricket’s World Cup Starts Amid Uncertainty For Maligned ODI Format",
    "link": "https://www.forbes.com/sites/tristanlavalette/2023/10/05/crickets-world-cup-starts-amid-uncertainty-for-maligned-odi-format/",
    "keywords": [
      "SportsMoney",
      "/sportsmoney",
      "Business",
      "/business",
      "SportsMoney",
      "/sportsmoney",
      "business",
      "sportsmoney",
      "standard"
    ],
    "creator": [
      "Tristan Lavalette, Contributor"
    ],
    "video_url": null,
    "description": "There is an unknown over cricket's 50-over future as its popularity declines, but the World Cup in India might stir a wave of nostalgia.",
    "content": "Forbes Business SportsMoney Cricket’s World Cup Starts Amid Uncertainty For Maligned ODI Format Tristan Lavalette Contributor Opinions expressed by Forbes Contributors are their own. Following Oct 5, 2023, 02:34am EDT | Press play to listen to this article! Got it! Share to Facebook Share to Twitter Share to Linkedin The cricket World Cup starts on October 5 (Photo by Matthew Lewis-ICC/ICC via Getty Images) ICC via Getty Images The cricket World Cup starts on October 5 in the sport's rabid heartland. India which famously last hosted the event in 2011 when a MS Dhoni title-clinching six into a sea of ecstatic fans became instantly etched into lore. Even though T20s had been around for some time, with two T20 World Cups contested and the Indian Premier League exploding onto the scene in 2008, the most important prize was undoubtedly the World Cup of the 50-over variety. Back then there was no need to differentiate. The World Cup was the World Cup. The T20 equivalent was a little bit mickey mouse at the international level, still not taken seriously. But things have changed significantly in the last 12 years. The shorter three-hour format of T20 has grabbed the hearts of a younger generation, spawning lucrative domestic leagues globally, and proving a suitable game for this instant gratification era. Last year's T20 World Cup , marked by an epic India-Pakistan contest at a 90,000 MCG, felt like the tournament had really arrived. And the next event - just eight months away - might be a definitive moment for the sport with it being co-hosted by the U.S. Kohli inspired India to an amazing victory over arch-rivals Pakistan (Photo by Daniel ... [+] Pockett-ICC/ICC via Getty Images) ICC via Getty Images MORE FOR YOU Ukrainian Troops Recovered One Of Their Damaged Strv 122 Tanks—In Time For The Tank To Meet The President Bill Gates Predicts Arista Networks Will Disrupt Google And Amazon Powerball Jackpot Rises To 1 4 Billion Here s What The Winner Will Take Home After Taxes But sandwiched between those mega events is the World Cup, which will thrust the maligned 50-over format - becoming something of a black sheep middle sibling - to the forefront of fans over the next six months. There has been much debate over the future of the 50-over format - which is played over around eight hours - and whether it should be significantly reduced or ditched entirely. As I reported recently, ODI's immediate future is secure with cricket's powerbrokers intent on protecting the format. ODIs still holds significant cache because of the 50-over World Cup, which is a money-spinner and remains the most coveted prize for players. It won't be going anywhere because there are World Cups in the next cycle of events in 2027 and 2031. For the next event, which will be played in South Africa, Zimbabwe and Namibia, the World Cup will finally expand from its measly number of 10 teams to 14. That means smaller cricket nations will need more exposure beforehand to ensure they are competitive for the next World Cup. But amid such a crammed calendar, with ODIs seemingly the casualty, there will be precious opportunities for them. With seemingly little appetite, despite administrators saying otherwise, the format is clearly on the nose, played less these days with little fanfare from fans. It's saddening for a previous generation when the 50-over format was the most exciting spectacle imaginable. ODI cricket once attracted packed crowds (Photo by Tony Marshall/EMPICS via Getty Images) PA Images via Getty Images There have already been reports from India that this cricket-mad country has been less enthused over the World Cup. Sports fever is currently centered over India's strong showing at the Asian Games - the world's second biggest multi-sport event being contested in Hangzhou, China. Inevitably, especially if hosts and favorites India start getting on a roll, the World Cup will ignite and it could lead to a swirl of nostalgia. Maybe fans will believe the format can offer the right balance of Test cricket's slow burn along with T20's manic approach. Or perhaps this will be something of a last dance, where the often excruciating middle overs makes everyone realise that the format is a relic. Either way, 50-over cricket will be the center of attention in the cricket world. Something that rarely happens these days. Follow me on Twitter . Tristan Lavalette Editorial Standards Print Reprints & Permissions",
    "pubDate": "2023-10-05 06:34:23",
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/651e45b0e93a541eea2a4d04/0x0.jpg?width=960",
    "source_id": "forbescrypto",
    "source_priority": 57,
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english",
    "short_uuid": "bf9adce5"
  },
  {
    "article_id": "3ccb3114ac70587179265eb19ae2a333",
    "title": "Biden’s Dog Commander ‘Not Presently’ At White House After Biting Incidents",
    "link": "https://www.forbes.com/sites/siladityaray/2023/10/05/bidens-dog-commander-not-presently-at-white-house-after-biting-incidents/",
    "keywords": [
      "Business",
      "/business",
      "Business",
      "/business",
      "Breaking",
      "breaking-news",
      "topline"
    ],
    "creator": [
      "Siladitya Ray, Forbes Staff"
    ],
    "video_url": null,
    "description": "The German shepherd has been involved in a series of biting incidents at the White House.",
    "content": "Forbes Business Breaking Biden’s Dog Commander ‘Not Presently’ At White House After Biting Incidents Siladitya Ray Forbes Staff Covering breaking news and tech policy stories at Forbes. Following Oct 5, 2023, 02:22am EDT | Press play to listen to this article! Got it! Updated Oct 5, 2023, 02:33am EDT Share to Facebook Share to Twitter Share to Linkedin Topline President Joe Biden’s dog Commander is not at the White House premises at present, a spokesperson for First Lady Jill Biden said Wednesday, after multiple reports of the German shepherd biting several Presidential staffers, including Secret Service agents. File Photo: Commander, US President Joe Biden and US First Lady Jill Bidens German Shepherd, is ... [+] taken for a walk on the South Lawn before their return to the White House in Washington, DC. AFP via Getty Images Key Facts The First Lady’s spokesperson said Commander “is not presently on the White House campus while next steps are evaluated,” the Associated Press reported . The spokesperson noted that the Bidens are “grateful for the patience and support” of the Secret Service staffers and all other staffers as they attempt to “work through solutions.” Last month, a tourist took a photo of Commander biting Dale Haney, the White House’s chief groundskeeper and later that month the dog bit a Secret Service officer. White House press secretary Karine Jean-Pierre commented on the photo of Commander biting Haney and said the dog and the chief groundskeeper were playing and no skin was broken at the time. What To Watch For It is unclear where the 2-year-old German shepherd is living currently and if there are plans to bring him back to the White House. The First Lady’s spokesperson said the White House can be a “stressful environment” for pets and the family was working on “ways to help Commander handle the often unpredictable nature of the White House grounds.” Key Background Aside from the two biting incidents reported last month, the 2-year-old German shepherd has bitten Secret Service personnel at least 10 other times , according to the Department of Homeland Security’s records. The ten earlier biting incidents were recorded between October 2022 and January 2023, one of which required a hospital visit. It is unknown if any other biting incidents have taken place between January and September. Biden’s older German Shepherd Major was also involved in several biting incidents, which eventually resulted in him moving out of the White House. Tangent CNN reported that Secret Service personnel at the White House had raised concerns about workplace safety over the biting incidents. One source cited by CNN referred to the work environment as “hostile” and “dangerous” adding that agents are forced to avoid some entrances and routes inside the building to avoid getting bitten by Commander. Despite purportedly receiving assurances that the dog would receive appropriate training, the incidents continued to happen. Further Reading Biden’s Dog Bit Secret Service Officers At Least 10 Times, Records Show (Forbes) Biden’s dog Commander no longer at White House after biting incidents (Associated Press) Follow me on Twitter . Send me a secure tip . Siladitya Ray Editorial Standards Print Reprints & Permissions",
    "pubDate": "2023-10-05 06:22:44",
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/651e52ec642ecd18166ddd32/0x0.jpg?width=960&precrop=4500%2C2531%2Cx0%2Cy75",
    "source_id": "forbescrypto",
    "source_priority": 57,
    "country": [
      "united states of america"
    ],
    "category": [
      "business"
    ],
    "language": "english",
    "short_uuid": "1059cb2b"
  }
]
